[
  {
    "id":"75",
    "title": "Public Speaking: Speak to Inspire, Lead, and Influence",
    "price": "Current priceE£599.99",
    "description": "Do you struggle with stage fright or lose focus during high-stakes meetings? This course is your ultimate guide to mastering public speaking and confident communication in every professional scenario.Whether addressing a large audience on stage, leading a work meeting, negotiating a deal, hosting a webinar, or presenting to a board of directors, this course provides the tools and techniques you need to succeed.What You'll Learn:The fundamentals of impactful public speaking and how to tailor your message to different audiences.Strategies to overcome fear and anxiety, transforming nerves into confidence.Practical tips to hold attention during your speech, work meetings, negotiations, etc.Solutions to handle unexpected challenges or difficult questions with composure.By the end of this course, you’ll:Be able to prepare and deliver compelling speeches for any occasion.Gain confidence in overcoming fear and connecting with your audience.Avoid common mistakes and bad habits that can weaken your presentation.Handle unexpected challenges with poise and professionalism.Public speaking isn't just about being on stage—it's about communicating persuasively and confidently in all aspects of professional life. By the end of this course, you'll have the confidence, skills, and strategies to deliver your message effectively, no matter the audience or setting.",
    "instructor": "Banza Academy",
    "requirements": [
      "This course is designed for learners of all levels, with no specific prerequisites."
    ],
    "whatYouWillLearn": [
      "Identify key components of effective communication",
      "Explore proven techniques and strategies to deliver impactful speeches",
      "Utilize practical tools and methods for thorough preparation",
      "Learn practical steps to improve the quality of preparation and delivery",
      "Apply techniques to manage and reduce fear effectively",
      "Recognize and avoid common public speaking mistakes",
      "Develop strategies to stay composed and adapt in high-pressure moments"
    ],
    "content": [
      {
        "title": "Introduction",
        "subsections": [
          {
            "title": "Introduction",
            "time": "02:54",
            "url": "https://www.youtube.com/watch?v=962eYqe--Yc&pp=ygUzcHVibGljLXNwZWFraW5nLXNwZWFrLXRvLWluc3BpcmUtbGVhZC1hbmQtaW5mbHVlbmNl"
          }
            ]
      },
      {
        "title": "What is public speaking?",
        "subsections": [
          {
            "title": "What is public speaking?",
            "time": "13:17",
            "url": "https://www.youtube.com/watch?v=3G__0hU_hxI&pp=ygUYV2hhdCBpcyBwdWJsaWMgc3BlYWtpbmc_"
          }
        ]
      },
      {
        "title": "Secrets of public speaking",
        "subsections": [
          {
            "title":"Secrets of public speakingPreview",
            "time":"05:58",
            "url":"https://www.youtube.com/watch?v=-FOCpMAww28&pp=ygUaU2VjcmV0cyBvZiBwdWJsaWMgc3BlYWtpbmc%3D"
          }
        ]
      },
      {
        "title": "Preparing for public speaking",
        "subsections": [
          {
            "title":"Preparing for public speaking",
            "time":"11:23",
            "url":"https://www.youtube.com/watch?v=i5mYphUoOCs&pp=ygUdUHJlcGFyaW5nIGZvciBwdWJsaWMgc3BlYWtpbmc%3D"
          }
        ]
      },
      {
        "title": "How do you speak convincingly?",
        "subsections": [
          {
            "title":"How do you speak convincingly?",
            "time":"06:56",
            "url":"https://www.youtube.com/watch?v=vjdNewrG20E&pp=ygUdSG93IGRvIHlvdSBzcGVhayBjb252aW5jaW5nbHk%3D"
          }
        ]
      },
      {
        "title": "Сommon mistakes in preparation",
        "subsections": [
          {
            "title":"Сommon mistakes in preparation",
            "time":"07:28",
            "url":"https://www.youtube.com/shorts/S0Z0D3bMxuU"
          }
        ]
      },
      {
        "title": "Fighting fear",
        "subsections": [
          {
            "title":"Fighting fear",
            "time":"10:48",
            "url":"https://www.youtube.com/watch?v=-FyVetL1MEw&pp=ygUNRmlnaHRpbmcgZmVhcg%3D%3D"
          }
        ]
      },
      {
        "title": "Holding audience attention",
        "subsections": [
          {
            "title":"Holding audience attention",
            "time":"08:56",
            "url":"https://www.youtube.com/watch?v=cV6aHYx6E-E&pp=ygUaSG9sZGluZyBhdWRpZW5jZSBhdHRlbnRpb24%3D"
          }
        ]
      },
      {
        "title": "Top most common mistakes and harmful tips",
        "subsections": [
          {
            "title":"Top most common mistakes and harmful tips",
            "time":"05:45",
            "url":"https://www.youtube.com/watch?v=t0pC_TBeH-w&pp=ygU9VG9wIG1vc3QgY29tbW9uIG1pc3Rha2VzIGFuZCBoYXJtZnVsIHRpcHMgY29tbXVuaWNhdGluIGNvdXJzZQ%3D%3D"
          }
        ]
      },
      {
        "title": "Getting out of difficult situations",
        "subsections": [
          {
            "title":"Getting out of difficult situations",
            "time":"17:34",
            "url":"https://www.youtube.com/watch?v=ShXJM70bwU0&pp=ygU3R2V0dGluZyBvdXQgb2YgZGlmZmljdWx0IHNpdHVhdGlvbnMgY29tbXVuaWNhdGluIGNvdXJzZQ%3D%3D"
          }

          
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/6238781_ace5.jpg",
    "category":"communications"
  },
  {
    "id":"76",
    "title": "Communicating change with impact",
    "price": "Current priceE£599.99",
    "description": "Communicating Change with Impact is a practical, engaging course designed to help change practitioners craft messages that truly land.Whether you’re leading Change efforts on a major transformation or supporting a small process shift, communication plays a central role in whether change succeeds — or falls flat. Yet too often, change comms are seen as an afterthought. They’re top-down, too technical, or just plain ignored.This course flips that on its head.You’ll learn how to create clear, human-centred communication that doesn’t just inform people — it moves them. That means messages that cut through the noise, resonate emotionally, build understanding, and drive real behaviour change.Grounded in a five-phase model — Hear it, Feel it, Understand it, Do it, Live it — the course walks you through the full communication journey. You’ll explore how to build awareness, create emotional connection, support action, and sustain momentum, long after go-live.Along the way, you’ll get practical tools you can use right away: comms plans, audience maps, message layering templates, and more. You’ll also see real-world examples of what works (and what doesn’t), and hear tips on how to keep your comms clear, focused, and human — even in complex environments.This course is built for real life. No jargon. No fluff. Just smart, flexible approaches you can tailor to your context, no matter the size or scope of your change.",
    "instructor": "Toby Wragg",
    "requirements": [
      "There are no formal prerequisites for this course.  It’s designed to support a wide range of learners — whether you’re a full-time change practitioner or someone who finds themselves communicating change as part of your day job."
    ],
    "whatYouWillLearn": [
      "Explain the strategic importance of communication in change and why it’s a core change deliverable, not just a support function.",
      "Adopt a human-centred mindset for change comms by shifting from broadcasting to meaning-making, logic to emotion, and telling to co-creating.",
      "Identify and segment change audiences based on roles, needs, and impact level to ensure communication is relevant and resonant.",
      "Address both functional and emotional needs in your messaging to build trust and reduce resistance.",
      "Develop a clear, phased communication plan that aligns messages with audience, timing, channels, and senders for maximum impact.",
      "Craft communication that cuts through noise by using hooks, human tone, and scannable design that earns attention.",
      "Create emotionally engaging messages that connect with what people value, using empathy, tone, and storytelling.",
      "Structure communication using layered messaging to ensure clarity without overload, tailoring detail to different audience needs.",
      "Use visual tools and metaphors to simplify complex ideas and help people understand the change journey.",
      "Measure communication effectiveness using practical signals of visibility, understanding, and behaviour change — and adapt based on what you learn."
    ],
    "content": [
      {
        "title": "Introduction and overview",
        "subsections": [
          {
            "title":"Why change communications matters more than everPreview",
            "time":"2:52",
            "url":"https://www.youtube.com/watch?v=7Rt8sgt7gNE&pp=ygVMV2h5IGNoYW5nZSBjb21tdW5pY2F0aW9ucyBtYXR0ZXJzIG1vcmUgdGhhbiBldmVyUHJldmlldyJjb21tdW5pY2F0aU9uIGNvdXJzZQ%3D%3D"
          }
          
        ]
      },
      {
        "title": "Phase 1: Hear it - the first phase of our staggered approach to change comms",
        "subsections": [
          {
            "title":"Cutting through the noise",
            "time":"04:46",
            "url":"https://www.youtube.com/watch?v=UkcxKXBWio0&pp=ygUuQ3V0dGluZyB0aHJvdWdoIHRoZSBub2lzZSBjb21tdW5pY2F0aU9uIGNvdXJzZdIHCQl-CQGHKiGM7w%3D%3D"
          }
         
          
        ]
      },
      {
        "title": "Feel it - the second phase of our staggered approach to change comms",
        "subsections": [
          {
            "title":"From head to haert",
            "time":"4:49",
            "url":"https://www.youtube.com/watch?v=QGeHS4jO0X0&pp=ygUnRnJvbSBoZWFkIHRvIGhhZXJ0IGNvbW11bmljYXRpb24gY291cnNl"
          }
          
          
        ]
      },
      {
        "title": "Understand it - the third phase of our staggered approach to change comms",
        "subsections": [
          {
            "title":"Building understanding through layered messaging",
            "time":"4:56",
            "url":"https://www.youtube.com/watch?v=Q8SFYo1nmrQ&pp=ygVFQnVpbGRpbmcgdW5kZXJzdGFuZGluZyB0aHJvdWdoIGxheWVyZWQgbWVzc2FnaW5nIGNvbW11bmljYXRpb24gY291cnNl"
          }
        ]
      },
      {
        "title": "Do it - the fourth phase of our staggered approach to change comms",
        "subsections": [
          {
            "title":"Turning communications into behaviour",
            "time":"4:40",
            "url":"https://www.youtube.com/watch?v=hAxCpAnV3-E&pp=ygU6VHVybmluZyBjb21tdW5pY2F0aW9ucyBpbnRvIGJlaGF2aW91ciBjb21tdW5pY2F0aW9uIGNvdXJzZQ%3D%3D"
          }
        ]
      },
      {
        "title": "Live it - the final phase of our staggered approach to change comms",
        "subsections": [
          {
            "title":"Sustaining the conversation",
            "time":"4:11",
            "url":"https://www.youtube.com/watch?v=0g1r7v2xX4E&pp=ygUjU3VzdGFpbmluZyB0aGUgY29udmVyc2F0aW9uIGNvbW11bmljYXRpb24gY291cnNl"
          }
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/6538415_9441.jpg",
    "category":"communications"
  },

  {
    "id":"77",
    "title": "Zoom Mastery: The Ultimate Platform for Professional Meeting",
    "price": "Current priceE£599.99",
    "description": "Master Zoom Like a Pro: Elevate Your Online Meetings and WebinarsAre you ready to maximize your efficiency with Zoom and host professional, engaging meetings and webinars? Whether you're an entrepreneur, educator, business professional, or content creator, this course will teach you how to unlock the full potential of Zoom and use its advanced features to streamline your workflow.In this comprehensive Zoom Mastery course, you'll learn:1. How to navigate the Zoom platform and set up your account for success2. Step-by-step tutorials on scheduling meetings, managing participants, and optimizing settings3. How to use Zoom’s webinar tools for hosting large-scale online events4. Exploring Zoom’s AI-powered features for enhanced meeting automation and efficiency5. Managing recordings, polls, quizzes, and live streaming to increase audience engagement6. Using Zoom Whiteboards, Clips, and Surveys to boost collaboration and productivity7. Setting up Zoom Mail and business communication tools for seamless interactionBy the end of this course, you’ll have the skills to run professional Zoom meetings and webinars with confidence, automate repetitive tasks, and create a seamless virtual communication experience.Whether you're working remotely, hosting virtual events, or teaching online, this Zoom training will help you stand out, increase engagement, and make your online sessions more impactful.Enroll now and take your Zoom skills to the next level!",
    "instructor": "Milan Milosevic #1 Public Speaking Coach in South Africa, Best-Selling Author",
    "requirements": [
      "Basic Computer Skills – Ability to navigate the internet, download software, and manage files.",
      "A Zoom Account – A free or paid Zoom account to follow along with the tutorials.",
      "A Computer or Mobile Device – A laptop, desktop, or smartphone with a stable internet connection.",
      "A Webcam and Microphone (Optional) – Recommended for hands-on practice with meetings and webinars.",
      "Basic Understanding of Online Meetings – No advanced experience required, but familiarity with virtual communication is helpful."
    ],
    "whatYouWillLearn": [
      "How to fully optimize Zoom for online business activities",
      "Best practices for hosting meetings and webinars with Zoom’s advanced features",
      "Using AI tools to improve engagement and automate tasks in meetings and webinars",
      "How to manage Zoom recordings, quizzes, and polls for better interaction",
      "Tips for going live with Zoom and integrating it into business workflows"
    ],
    "content": [
      {
        "title": "Introduction",
        "subsections": [
          {
            "title":"Lead magnet videoPreview",
            "time":"01:28",
            "url":""
          }
        ]
      },
      {
        "title": "Zoom client",
        "subsections": [
          {
            "title":"From team chat to accessibility",
            "time":"02:08",
            "url":""
          }
        ]
      },
      {
        "title": "Zoom Webinar",
        "subsections": [
          {
            "title":"Ai Companion with Webinars",
            "time":"02:00",
            "url":""
          }
        ]
      },
      {
        "title": "Setup",
        "subsections": [

          {
            "title":"Setup Zoom",
            "time":"00:57",
            "url":""
          }
        ]
      },
      {
        "title": "Add ons",
        "subsections": [

          {
            "title":"Ai Companion with Meetings",
            "time":"00:57",
            "url":""
          }
        ]
      },
      {
        "title": "Post Meeting",
        "subsections": [
          {
            "title":"Managing Recordings",
            "time":"01:52",
            "url":""
          }
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/6458791_2ce8_2.jpg",
    "category":"communications"
  },
  
  {
    "id":"78",
    "title": "Learn Persuasion & Influence Psychology for Personal Success",
    "price": "Price not found",
    "description": "Want to be more persuasive in your personal and professional life? Whether you’re negotiating a deal, leading a team, or improving relationships, mastering persuasion psychology is a game-changer.Course Title: Learn Persuasion & Influence Psychology for Personal SuccessSection 1 Introduction to Persuasion PsychologyLecture 1 Understanding the Power of PersuasionLecture 2 The Science Behind InfluenceLecture 3 Key Principles of Persuasion PsychologySection 2 Core Techniques of InfluenceLecture 4 Building Trust and CredibilityLecture 5 Emotional Appeal in PersuasionLecture 6 Using Reciprocity to Build ConnectionsSection 3 Persuasive Communication SkillsLecture 7 The Art of Active ListeningLecture 8 Crafting Persuasive MessagesLecture 9 Storytelling for Maximum InfluenceSection 4 Applying Persuasion for Personal SuccessLecture 10 Influencing Decisions in Personal RelationshipsLecture 11 Persuasion in Professional SettingsLecture 12 Creating Lasting Impact and ConfidenceThis course dives deep into scientifically proven techniques of persuasion and influence, giving you practical strategies that work in real-life situations. You'll discover how trust, emotional appeal, storytelling, and reciprocity can transform the way you communicate and connect with others.By the end of this course, you'll not only understand the principles of persuasion but also know how to apply them effectively to achieve success in various aspects of life.",
    "instructor": "Fahad Virk",
    "requirements": [
      "No prior knowledge of psychology or persuasion is needed – just a willingness to learn and apply new techniques."
    ],
    "whatYouWillLearn": [
      "Master persuasion psychology to influence decisions, build trust, and enhance communication in personal and professional settings.",
      "Learn proven persuasion techniques like reciprocity, emotional appeal, and storytelling to captivate and inspire others.",
      "Develop strong communication skills with active listening and persuasive messaging to improve relationships and leadership influence.",
      "Apply persuasion strategies in real-life scenarios to boost confidence, negotiate effectively, and create lasting impact."
    ],
    "content": [
      {
        "title": "Introduction",
        "subsections": [

          {
            "title": "Introduction",
            "time":"02:25",
            "url":"https://www.youtube.com/shorts/S0Z0D3bMxuU"
          }
        ]
      },
      {
        "title": "10 Best Practices for Email Deliverability",
        "subsections": [

            {
              "title":"SPAM Trigger Words",
              "time":"02:06",
              "url":"https://www.youtube.com/watch?v=wvAWyeqiql4&pp=ygUnU1BBTSBUcmlnZ2VyIFdvcmRzIGNvbW11bmljYXRpb24gY291cnNl"
            }
        ]
      },
      {
        "title": "13 Ways to Minimize SPAM Complaints",
        "subsections": [

          {
            "title":"Protecting Your IP Address",
            "time":"05:44",
            "url":"https://www.youtube.com/watch?v=--onbg-jHqQ&pp=ygUvUHJvdGVjdGluZyBZb3VyIElQIEFkZHJlc3MgY29tbXVuaWNhdGlvbiBjb3Vyc2U%3D"
          }
        ]
      },
      {
        "title": "Gowing Email Marketing",
        "subsections": [
          {
            "title":"Email Marketing",
            "time":"01:05",
            "url":"https://www.youtube.com/shorts/ReOyGeTHwfE"
          }
        ]
      },
      {
        "title": "Summary and Thank You!",
        "subsections": [

        {
          "title":"Summary and Thank you!",
          "time":"01:43",
          "url":"https://www.youtube.com/watch?v=--onbg-jHqQ&pp=ygUvUHJvdGVjdGluZyBZb3VyIElQIEFkZHJlc3MgY29tbXVuaWNhdGlvbiBjb3Vyc2U%3D"
        }
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/6514629_7f49.jpg",
    "category":"communications"
  },
  {
    "id":"79",
    "title": "Amplify Your Impact: Personal Branding for Professionals",
    "price": "Price not found",
    "description": "If you’ve landed here, it’s probably because you’re looking to add value to what you do and want to find an effective way to do it.You know yourself, you’re aware of your talents and skills… Now the question is: \"How do I communicate them to others?\"Together, we’ll discover how to capture attention, how to build trust, and how to increase our influence.We’ll explore the best communication tools, strategies, and tactics—what works best and which mistakes are worth avoiding when presenting who we are.We will focus on how you can enhance your personal networks, the key elements that define your authority, and all the digital tools available to share your ideas.The goal? To build YOUR brand.This course is perfect for small business owners, those just starting their careers, or anyone stepping into a new professional challenge.Here, everything revolves around you—on how to build a brand around your name, your unique way of doing things, your values, and what makes you stand out.If these topics resonate with you, I promise we’ll dive into them in a fun, simple, and direct way. I’ll respect your valuable time and, most importantly, we’ll enjoy the journey—because who says learning has to be boring?And, if nothing else, my terrible English will definitely make you smile more than once!",
    "instructor": "Michele Bresciani",
    "requirements": [
      "No particular tools or knowledge required."
    ],
    "whatYouWillLearn": [
      "Give more value to what you do",
      "Increase your authority and the trust others have in you",
      "Use the best tools to convey your brand",
      "Produce digital content effectively, reaching your goals",
      "Set the right mindset for your business activities",
      "Communicate effectively with your clients and business partners"
    ],
    "content": [
      {
        "title": "Introduction",
        "subsections": [

          {
            "title": "Introduction",
            "time":"02:25",
            "url":"https://www.youtube.com/shorts/S0Z0D3bMxuU"
          }
        ]
      },
      {
        "title": "10 Best Practices for Email Deliverability",
        "subsections": [

            {
              "title":"SPAM Trigger Words",
              "time":"02:06",
              "url":"https://www.youtube.com/watch?v=wvAWyeqiql4&pp=ygUnU1BBTSBUcmlnZ2VyIFdvcmRzIGNvbW11bmljYXRpb24gY291cnNl"
            }
        ]
      },
      {
        "title": "13 Ways to Minimize SPAM Complaints",
        "subsections": [

          {
            "title":"Protecting Your IP Address",
            "time":"05:44",
            "url":"https://www.youtube.com/watch?v=--onbg-jHqQ&pp=ygUvUHJvdGVjdGluZyBZb3VyIElQIEFkZHJlc3MgY29tbXVuaWNhdGlvbiBjb3Vyc2U%3D"
          }
        ]
      },
      {
        "title": "Gowing Email Marketing",
        "subsections": [
          {
            "title":"Email Marketing",
            "time":"01:05",
            "url":"https://www.youtube.com/shorts/ReOyGeTHwfE"
          }
        ]
      },
      {
        "title": "Summary and Thank You!",
        "subsections": [

        {
          "title":"Summary and Thank you!",
          "time":"01:43",
          "url":"https://www.youtube.com/watch?v=--onbg-jHqQ&pp=ygUvUHJvdGVjdGluZyBZb3VyIElQIEFkZHJlc3MgY29tbXVuaWNhdGlvbiBjb3Vyc2U%3D"
        }
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/6442291_f3f7.jpg",
    "category":"communications"
  },
  {
    "id":"80",
    "title": "How To Succeed At Work - Complete Guide and Secrets",
    "price": "Current priceE£599.99",
    "description": "IF YOU WANT TO SUCCEED AT WORK AND REACH TOP MANAGEMENT LEVELS, THIS COURSE IS FOR YOU.If you're determined to succeed in your career and reach top management positions, this course is for you.This comprehensive program offers actionable strategies to help you rise to the top.  It covers the essential skills needed to navigate the complex dynamics of the workplace, where colleagues are also vying for success and will not hesitate to outshine you along the way.The content is based on real-world experiences and proven strategies—not theories you might find in textbooks.  Delivered in a straightforward, easy-to-understand and follow format, with clear explanations through presentation slides, this course will equip you with the tools necessary to tackle the challenges professionals face daily.In this course, you will learn how to:Adjust your mindset to anticipate workplace challenges and respond effectively when they ariseMaster the art of compartmentalizing situations to handle conflicts and situations more efficientlyUnderstand the three most valuable Power Influencers that will shape your professional image and successDevelop and enhance your charisma so that colleagues and friends know that you are the one to followLastly, the content is summarized in an-easy-to-follow 20-step roadmap to maximize your chances of successThis course is infused with all the insights and strategies you need to thrive in the workplace.  I’m confident you’ll find immense value in it if you are willing to invest your time.",
    "instructor": "Nasser Lukmani",
    "requirements": [
      "Willingness to recognize and identify shortfalls in oneself for personal development",
      "Willingness to change habits and implement strategic soft skills to succeed",
      "Willingness to apply the learning in the professional life as well as the personal life"
    ],
    "whatYouWillLearn": [
      "Essential tools and insights to navigate and succeed at work to master the corporate game",
      "The course will teach the student, how to achieve a productive work environment to achieve desired goals",
      "The learning will help the student identify and avoid land mines & pitfalls most professionals face at work",
      "The learning will help the student improve his or her soft skills to master the corporate game"
    ],
    "content": [
      {
        "title": "Module 1 - Introduction To The Course",
        "subsections": [
          {
            "title":"Course VideosPreview",
            "time":"1:30",
            "url":"https://www.youtube.com/watch?v=UGFfEchk7nc&pp=ygUyICBDb3Vyc2UgVmlkZW9zUHJldmlldyBjb21tdW5pY2F0aW9uIHNraWxscyBjb3Vyc2U%3D"
          }
        ]
      },
      {
        "title": "Module 2 - Mindset Adjustment",
        "subsections": [

          {
            "title":"Mindset AdjustmentPreview",
            "time":"1:57",
            "url":"https://www.youtube.com/watch?v=LI57EB_T38c&pp=ygU3ICBNaW5kc2V0IEFkanVzdG1lbnRQcmV2aWV3IGNvbW11bmljYXRpb24gc2tpbGxzIGNvdXJzZQ%3D%3D"
          }
        ]
      },
      {
        "title": "Module 3 - Key Power Influencers",
        "subsections": [
          {
           "title":"Power Influencers",
            "time": "04:09",
            "url":"https://www.youtube.com/watch?v=Fnt6P7Rnho8&pp=ygUvICBQb3dlciBJbmZsdWVuY2VycyBjb21tdW5pY2F0aW9uIHNraWxscyBjb3Vyc2U%3D"
          }
         
        ]
      },
      {
        "title": "Module 4 - The Power Of Appearance",
        "subsections": [
          {
            "title":"Power Of Appearance",
             "time": "01:23",
             "url":"https://www.youtube.com/watch?v=CrnF8YsXD_g&t=17s&pp=ygUWICBQb3dlciBPZiBBcHBlYXJhbmNlIA%3D%3D"
           }
        ]
      },
      {
        "title": "Module 5 - The Power Of Body Language",
        "subsections": [

          {
            "title":"Power Of Body Language",
             "time": "00:53",
             "url":"https://www.youtube.com/watch?v=ergJz5LUAGg&pp=ygUxICBQb3dlciBPZiBBcHBlYXJhbmNlIGNvbW11bmljYXRpb24gc2tpbGxzIGNvdXJzZQ%3D%3D"
           }
        ]
      },
      {
        "title": "Module 6 - The Power Of Words",
        "subsections": [
          {
            "title":"Power Of Words",
             "time": "01:56",
             "url":"https://www.youtube.com/watch?v=Iqq1roF4C8s&pp=ygUsICBQb3dlciBPZiBXb3JkcyBjb21tdW5pY2F0aW9uIHNraWxscyBjb3Vyc2U%3D"
           }
        ]
      },
      {
        "title": "Module 7 - The Art Of Contentment",
        "subsections": [

          {
            "title":"The Art Of Contentment",
             "time": "00:39",
             "url":"https://www.youtube.com/watch?v=wfIhGsoWgGw&pp=ygU0ICBUaGUgQXJ0IE9mIENvbnRlbnRtZW50IGNvbW11bmljYXRpb24gc2tpbGxzIGNvdXJzZQ%3D%3D"
           }
        ]
      },
      {
        "title": "Module 8 - The Art Of Charisma",
        "subsections": [
          {
            "title":"Art Of Charisma",
             "time": "01:16",
             "url":"https://www.youtube.com/watch?v=Ijcnk2OHrhc&pp=ygUSICBBcnQgT2YgQ2hhcmlzbWEg"
           }
        ]
      },
      {
        "title": "Other Important Considerations",
        "subsections": [

          {
            "title":"Art Of Giving Advice",
             "time": "08:57",
             "url":"https://www.youtube.com/watch?v=R4TY5LW3feM&pp=ygUXICBBcnQgT2YgR2l2aW5nIEFkdmljZSA%3D"
           }
        ]
      },
      {
        "title": "Module 10 - Roadmap To Success",
        "subsections": [
          {
            "title":"Conclusions",
             "time": "01:16",
             "url":"https://www.youtube.com/watch?v=Jm6EBTW1JVc&pp=ygUSUm9hZG1hcCBUbyBTdWNjZXNz"
           }
          
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/6392491_9e5a_5.jpg",
    "category":"communications"
  },
  {
    "id":"81",
    "title": "Confident presentations & public speaking 2024 certification",
    "price": "Price not found",
    "description": "Very unique is that we update our mini-course every couple of weeks, and host online workshops, so the value of the course grows exponentially for users who stay longer.--Certification for people who finish this course included----Coming from a team working with clients from the USA to Amsterdam----Personal questions are encouraged and included our support staff is available 7 days a week--Do you believe in making a real positive impact on people?In this mini-course, we look at the fundamentals getting you more confident as a public speaker. We'll be looking at both a healthy preparation, as well as strategies that are required to begin as a public speaker. We'll also encourage you to look into exploring public speaking as a way of acquisition if you're a small business owner. And how you can use this skill to start an organic lead generation cycle.We'll be diving deeper into strategies that have allowed us to speak at countless conferences, and what it's like to host and keynote a 1000+ visitor conference.As well as getting invited to events like TEDx and Google to speak at. This course will focus on a great fundamentals overview of different ways to start and grow your career as a public speaker. We will include case studies and step-by-step walkthroughs so you can start with confidence in your personal branding career.Do you want access to a world-class team of people who are grinding every day and have real business recognition?In this course, our focus is on you. We are daily practitioners giving you answers when you ask them in the QnA. Making sure you get the most cutting-edge advice out there.Are we the real deal?Please check out the video testimonials from our executive clients, as well as students of this course who have won our monthly 1-on-1 coaching giveaway. These principles we're about to teach you are based on our very own blueprint and have been featured on TEDx, Google StartupGrind, and many more...Outside of using these principles to help others, we also use them daily on our own team of over 40+ people, and they have been proven to work with the most diverse from small startup team leaders to large corporates, who have dealt with all the struggles you can have in public speaking.If you've ever struggled with getting invited to speak at major events or convincing people that you do have the skills to speak at a major event, and if you're instead looking to stop convincing your potential clients that you have a high-quality message to convey. Then you'll definitely love having access to our team and these strategies.We're practitioners, that's why we can provide real use cases, 24/7 support, and a certification from an organization that has delivered thousands of trainings to corporate organizations worldwide.This specific LFRD Agency Public Speaking Sales Mini-course is approx 1 hour and more heavily focused on getting you up and running. In this course, we will be focused on:Fundamentals for Public SpeakersContent marketing workshopBehind-the-scenesHow we got on big stagesImportant templates, messages, and more...Even though it is smaller, it's still ongoing and will be updated monthly with new QnA videos until we've answered all your questions. You can request the next topic once inside the course. So make sure to stay engaged once inside....THIS IS FOR PEOPLE WHO ARE INTERESTED IN:Public speakingSpeaking on a TEDx stageBuilding their first TED talkImproving your presentation skillsGetting more organic leads as a business ownerGaining access to a support team that answers questions and has expertise in this topicPublic speaking topics that gain attentionSocial media Content strategies for public speakersStarting with public speaking by learning the fundamentals of each strategy and how to structure your speechStructuring group sessionsBusiness owners who are starting with public speaking and want a more organic way of attracting leadsHow to guide your team to become better public speakersHow to guide and facilitate your team to a certain goal with motivating speechA great new way to create additional revenue and give yourself more credibilityGreat step-by-step process and history to explain organic lead generation better to beginnersDO NOT BUY THIS COURSE IF:Only parts of this course may be relevant for you if you are a professional Chief Executive Officer or doing 7-figure sales and up. For that, you'll need our more in-depth courses.This course is heavily focused on attracting what you need to get started or improve your basic teachings. You need to be comfortable with advertising and putting yourself in the digital world with your brand to people on the internet to accomplish this.Even if you are a beginner or advanced, our entire team is here to answer your questions, so if you have a unique situation, getting this course is a cheaper way to get access to us.Extra 3+ hour Expert interviews included.* And a ton of extras, QnA's, Free update videos, More content, more expert interviews ...A BRAND NEW WAY TO DO IMPACTFUL PUBLIC SPEAKING AND PRESENTATIONS!Do you also find it extremely difficult to get more opportunities to speak on big stages and conferences – where you are actually not stressing about where your next speaking gig is coming from?I mean let's be honest, most of us get excited when we're asked to be a keynote speaker, yet we wish we'd have more of those types of opportunities coming in every day.For the first time ever, as LFRD Agency, we’re launching the ultimate online course that can guide you through that journey, with customer support that answers within 24 hours.We’ll be teaching you how we came up with our teachings through countless interactions with our clients from all over the world, from Silicon Valley to Amsterdam, and how we scaled it within our organization of over 40+ people. The best thing is that you can have zero experience starting out and we'll be able to guide you through the essential strategies of sales.IS THIS PERFECT FOR YOU?This is perfect for you if you’re a business owner, freelancer, or student that is looking to create a career path and wants to learn proven strategies and practices... Whether you're a beginner or a seasoned public speaker we'll cover the basics of lead generation in this course.Our practices have been featured in small rooms as well as in front of global audiences with thousands of people at our events.GET READY!If you ever wondered how to start your public speaking career or explain certain practices to your team… but the only thing stopping you is the experience or lack of resources, then this course will be worth it to you....LEARNOur learning platform is updated monthly with new videos. If there is a certain topic you want to know about, please request this by asking us a question on the Udemy Platform. Our support and instructor team answer quickly.Of course, the practical experience is half the work. That’s why we also invite you to our virtual job shadows, and any of our events, to really get practical with everything you learn. That's right, free access giveaways to our members to visit a live event.CULTUREWe invest highly in the community culture, with live events, meetups, feedback Fridays, and collaborations. It is our everyday mission to create a creative, safe, and fun environment to thrive in....ABOUT USThe LFRD Agency is a private online training community founded in 2018.It’s the ultimate online school for impact creators, designed to teach you how to build and scale any skill that has the potential to bring good into the world and impact human lives, even if you have no idea where to start or you have no technical skills or knowledge.Each year we have thousands of new people from all around the world enter our online training programs, and live events and I want to make sure that you can make an informed and educated decision on whether the LFRD Agency is right for you.What people say about our live in-person events\"I recently completed this public speaking course, and it exceeded all my expectations. The content was incredibly well-structured, covering everything from overcoming anxiety to mastering body language and variety of delivery mechanisms. The instructor was engaging and provided practical tips and exercises that were easy to follow and highly effective. The course materials, including video lectures, were top-notch and immensely helpful. Overall, this course has significantly boosted my confidence and skills in public speaking, making it an invaluable investment in my personal and professional development. Highly recommended!\" \"Great material and very valuable information. This is a great quality course at a very affordable price. Definitely recommend it!\"\"The course was insanely insightful for such a short course. The instructor walks the walk and talks the talk. She showcased everything that she taught and applied it herself. That made it very applicable and clear for me. It really will improve my skills as a presenter and I loved the practising parts and tips. Her delivery was great and I loved how she gave examples from different situations. Great course.\"\"This course was great value! To the point and concise yet actionable. The simple framework gave me a good idea of the main 3 things to consider. I can already see I will apply the tips in my next presentation with my team. I certainly recommend taking this course if you are looking for great advice without it being overwhelming.\"\"Great course flow, and very experienced teacher. Happy with this course and can definitely recommend it to others if you’re about to have a public speaking opportunity!\"Who this course is for:Anyone that is interested in improving their public speaking careerAnyone who is interested in earning money with public speaking",
    "instructor": "LFRD Agency",
    "requirements": [
      "No prior knowledge needed. Only requirement is to be willing to put in the time and effort",
      "Laptop and internet connection"
    ],
    "whatYouWillLearn": [
      "Improve presentation skills",
      "Understand common fears in presenting and public speaking",
      "Understand the framework and structure for presentations and public speaking",
      "Apply tips to become a confident presenter",
      "improve public speaking skills"
    ],
    "content": [
      {
        "title": "Introduction",
        "subsections": [
          {
            "title":"Lead magnet videoPreview",
            "time":"01:28",
            "url":""
          }
        ]
      },
      {
        "title": "Zoom client",
        "subsections": [
          {
            "title":"From team chat to accessibility",
            "time":"02:08",
            "url":""
          }
        ]
      },
      {
        "title": "Zoom Webinar",
        "subsections": [
          {
            "title":"Ai Companion with Webinars",
            "time":"02:00",
            "url":""
          }
        ]
      },
      {
        "title": "Setup",
        "subsections": [

          {
            "title":"Setup Zoom",
            "time":"00:57",
            "url":""
          }
        ]
      },
      {
        "title": "Add ons",
        "subsections": [

          {
            "title":"Ai Companion with Meetings",
            "time":"00:57",
            "url":""
          }
        ]
      },
      {
        "title": "Post Meeting",
        "subsections": [
          {
            "title":"Managing Recordings",
            "time":"01:52",
            "url":""
          }
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/6045880_5ccb_2.jpg",
    "category":"communications"
  },
  {
    "id":"82",
    "title": "The Art of Great Conversations | TAGC",
    "price": "Current priceE£599.99",
    "description": "COURSE DESCRIPTION:Are you ready to elevate your conversations and create deeper, more meaningful connections in all areas of life? The Art of Great Conversations is your ultimate guide to mastering communication, whether in personal relationships, professional settings, or social gatherings. Unlock the tools you need to engage confidently and effectively.In this course, you'll discover essential techniques like active listening, asking insightful questions, and tackling awkward silences or challenging topics. Master the art of storytelling, use humor to connect with others, and interpret non-verbal cues such as tone, gestures, and body language to strengthen your message.We’ll also explore strategies for networking, managing meetings with confidence, and building authentic connections. You’ll learn how to handle difficult conversations, adapt to different personalities, and respond thoughtfully under pressure. With access to downloadable resources like conversation trackers, worksheets, and printable conversation cards, you’ll be equipped to enhance your skills long after the course ends.By the end of this course, you’ll not only understand the secrets of great conversation but also be able to apply them in real-life scenarios. Transform your interactions, leave lasting impressions, and make every conversation truly count. Gain confidence, clarity, and the ability to connect like never before.",
    "instructor": "Robin Chan",
    "requirements": [
      "A willingness to engage and improve your communication skills.",
      "Access to a device for watching course videos and downloading resources.",
      "No prior experience required — just an open mind and a desire to learn!"
    ],
    "whatYouWillLearn": [
      "Master the Art of Building Connections: Learn how to actively listen, ask thoughtful questions, and find common ground to create genuine rapport.",
      "Navigate Conversational Challenges with Ease: Handle awkward silences, difficult topics, and interruptions gracefully and confidently.",
      "Enhance Your Storytelling Skills: Discover how to use engaging stories and humor to make your conversations memorable and relatable.",
      "Communicate Effectively in Any Setting: Gain practical skills for conversations at networking events, professional meetings, and social gatherings.",
      "Develop Empathy and Emotional Intelligence: Understand how to read emotions and respond thoughtfully to create deeper, more meaningful interactions.",
      "Leverage Non-Verbal Cues: Master tone, body language, and the power of silence to add impact and clarity to your conversations.",
      "Create a Personalized Growth Plan: Walk away with actionable goals and downloadable resources to continuously improve your conversational skills."
    ],
    "content": [
      {
        "title": "Module 0: Welcome to the Course",
        "subsections": [
          {
            "title":"Welcome and What to ExpectPreview",
            "time":"03:12",
            "url":"https://www.youtube.com/shorts/J8ZlGN_VI8I"
          }
          
        ]
      },
      {
        "title": "Module 1: Introduction to Great Conversations",
        "subsections": [
          {
            "title":"Common Barriers to Great Conversations",
            "time":"01:57",
            "url":"https://www.youtube.com/watch?v=jsl468Hwr4o&pp=ygVDIENvbW1vbiBCYXJyaWVycyB0byBHcmVhdCBDb252ZXJzYXRpb25zIGNvbW11bmljYXRpb24gc2tpbGxzIGNvdXJzZQ%3D%3D"
          }
        ]
      },
      {
        "title": "Module 2: Building Rapport and Connection",
        "subsections": [
          {
            "title":"The Power of Active ListeningPreview",
            "time":"02:07",
            "url":"https://www.youtube.com/watch?v=7wUCyjiyXdg&pp=ygU6IFRoZSBQb3dlciBvZiBBY3RpdmUgTGlzdGVuaW5nIGNvbW11bmljYXRpb24gc2tpbGxzIGNvdXJzZQ%3D%3D"
          }
        ]
      },
      {
        "title": "Module 3: Overcoming Conversational Challenges",
        "subsections": [
          {
            "title":"Dealing with Awkward Silences",
            "time":"02:41",
            "url":"https://www.youtube.com/watch?v=vIzmHLzLFaU&pp=ygU6IERlYWxpbmcgd2l0aCBBd2t3YXJkIFNpbGVuY2VzIGNvbW11bmljYXRpb24gc2tpbGxzIGNvdXJzZQ%3D%3D"
          }
       ]
      },
      {
        "title": "Module 4: Enhancing Conversational Skills",
        "subsections": [
          {
            "title":" Storytelling Techniques",
            "time":"02:36",
            "url":"https://www.youtube.com/watch?v=hNuAv-42jzY&pp=ygU1ICBTdG9yeXRlbGxpbmcgVGVjaG5pcXVlcyBjb21tdW5pY2F0aW9uIHNraWxscyBjb3Vyc2U%3D"
          }
        ]
      },
      {
        "title": "Module 5: Applying Conversations in Real-Life Scenarios",
        "subsections": [

          {
            "title":"Conversations in Networking Events",
            "time":"02:14",
            "url":"https://www.youtube.com/watch?v=Z-AOshRnJEY&pp=ygVAICBDb252ZXJzYXRpb25zIGluIE5ldHdvcmtpbmcgRXZlbnRzIGNvbW11bmljYXRpb24gc2tpbGxzIGNvdXJzZQ%3D%3D"
          }
        ]
      },
      {
        "title": "Congratulations!",
        "subsections": [
          {
            "title":"Words of Thanks & Announcement",
            "time":"01:58",
            "url":"https://www.youtube.com/watch?v=mNqUWyACoxI&pp=ygU8ICBXb3JkcyBvZiBUaGFua3MgJiBBbm5vdW5jZW1lbnQgY29tbXVuaWNhdGlvbiBza2lsbHMgY291cnNl"
          }
          
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/6421415_9812_5.jpg",
    "category":"communications"
  },
  {
    "id":"83",
    "title": "Network Visualization - An Introduction",
    "price": "Price not found",
    "description": "Course DescriptionWelcome to the world of network science, where connections come to life! This course is your comprehensive guide to understanding and applying the principles of network science, graph analytics, and visualization. Whether you're a data scientist looking to expand your expertise or a tech-savvy learner eager for hands-on experience, this course will take you from the basics to practical, real-world applications.What You’ll LearnThe foundations of network science, as well as its applicabilityKey concepts like nodes, links, paths, centralities (e.g., PageRank), and network communities.Step-by-step techniques for visualizing networks using Gephi, one of the most popular tools in the field.Hands-on projects with real-world networks, including the Witcher network, the Manhattan Project network, and a Python library usage network.Why Take This Course?Network science is a rapidly growing field with applications in diverse areas like data science, HR, urban planning, biology, and beyond. This course combines theory with practical, hands-on skills to help you:Analyze and understand complex systems through networks.Create stunning visualizations that uncover hidden patterns and insights.Expand your skill set to include one of the most in-demand data analysis techniques today.Who is This Course For?This course is designed for:Data scientists and analysts who want to enhance their skills by mastering network visualization.Tech-savvy learners and professionals curious about hands-on tools and techniques to explore networks.Beginners with no prior experience in network science who want to learn through practical examples.What Makes This Course Unique?Learn through diverse case studies: sports, biology, urban planning, and even fantasy worlds like The Witcher.Hands-on projects and walk-throughs to build your skills step by step.Focus on both the theoretical foundations and practical applications of network science.World-class instructor with featured network visualizations as venues such as the New York Times, GQ, and the Miami Art Week.Join us and start your journey into the fascinating world of connections, where networks reveal the patterns that shape our lives. By the end of this course, you'll be equipped with the tools, knowledge, and confidence to tackle network analysis and visualization like a pro.",
    "instructor": "Milan Janosov",
    "requirements": [
      "No programming experience is needed. You will learn everything you need on the go."
    ],
    "whatYouWillLearn": [
      "Understand the Theoretical Foundations of Network Science - From Theory to Applications",
      "Master Key Concepts in Network Analytics - Preparation for an Analytical View of Networks",
      "Develop Practical Skills in Network Visualization with the Software Gephi",
      "Apply Hands-On Techniques to Analyze Real-World Networks"
    ],
    "content": [
      {
        "title": "Introduction",
        "subsections": [

          {
            "title": "Introduction",
            "time":"02:25",
            "url":"https://www.youtube.com/shorts/S0Z0D3bMxuU"
          }
        ]
      },
      {
        "title": "10 Best Practices for Email Deliverability",
        "subsections": [

            {
              "title":"SPAM Trigger Words",
              "time":"02:06",
              "url":"https://www.youtube.com/watch?v=wvAWyeqiql4&pp=ygUnU1BBTSBUcmlnZ2VyIFdvcmRzIGNvbW11bmljYXRpb24gY291cnNl"
            }
        ]
      },
      {
        "title": "13 Ways to Minimize SPAM Complaints",
        "subsections": [

          {
            "title":"Protecting Your IP Address",
            "time":"05:44",
            "url":"https://www.youtube.com/watch?v=--onbg-jHqQ&pp=ygUvUHJvdGVjdGluZyBZb3VyIElQIEFkZHJlc3MgY29tbXVuaWNhdGlvbiBjb3Vyc2U%3D"
          }
        ]
      },
      {
        "title": "Gowing Email Marketing",
        "subsections": [
          {
            "title":"Email Marketing",
            "time":"01:05",
            "url":"https://www.youtube.com/shorts/ReOyGeTHwfE"
          }
        ]
      },
      {
        "title": "Summary and Thank You!",
        "subsections": [

        {
          "title":"Summary and Thank you!",
          "time":"01:43",
          "url":"https://www.youtube.com/watch?v=--onbg-jHqQ&pp=ygUvUHJvdGVjdGluZyBZb3VyIElQIEFkZHJlc3MgY29tbXVuaWNhdGlvbiBjb3Vyc2U%3D"
        }
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/6408017_72ed_8.jpg",
    "category":"communications"
  },
  {
    "id":"84",
    "title": "Mastering the Art of Public Speaking, Presentations & Speech",
    "price": "Price not found",
    "description": "Hi Udemy User,It's Magdalena. I wanted to personally thank you for choosing my Power of Public Speaking course.I am a Licensed Clinical Director with 20+ years of public speaking, coaching experience.In this Power of Public Speaking Course, you will learn everything and anything you need to know about Mastering the Art of Communication.When you enroll in this course, you will learn how to command a stage, while leveraging your words with confidence.You will learn to design inspiring speeches, while delivering compelling views. You will learn advanced techniques to woo your crowds with persuasion, while heightening their interest with the craft of aids.You will learn to upskill your talents with coaching techniques, while mastering the skills of empowerment.With 16 Power Driven Videos, this course is designed to help you shine where others falter.This course is designed to give you the tools for that new promotion.What are your Power Lessons? Power Of Finding Your Voice 2:17 MinutesPower Of Communication 4:14 MinutesPower Of Paving Success 3:26 MinutesPower Of Modern Speech 2:52 MinutesPower Of Modern Interaction 2:44 MinutesPower Of The Six Cs 18:16 MinutesPower of Words 28:22 MinutesPower Of The Brain 10:22 MinutesPower Of The Sensory 15:41 MinutesPower Of Conversational Coaching 10:41 MinutesPower Of Persuasion 24:00 MinutesPower Of Removing Fear 21:06 MinutesPower Of Listening 15:18 MinutesPower Of Analysis 10:11 MinutesPower Of Non-Verbals 16:33 MinutesPower Of Navigating Distractions 2:23 MinutesBy the end of this course, you will have Mastered the Art of Public Speaking and Giving Great Business and/or Personal Presentations, that puts you at the forefront of new opportunities.I will keep it simple, comprehensive and concise to make the experience easy and enjoyable.If you have any questions, I will also make myself readily available to answer questions you may have.This class is designed for all levels.I look forward to seeing you in my class!Magdalena",
    "instructor": "Magdalena Valentin MS MA CCC-SLP",
    "requirements": [
      "No experience needed. You will learn everything you need to know.",
      "Internet access required."
    ],
    "whatYouWillLearn": [
      "#1 Best Presentation Skills Course on Udemy!",
      "Gain Confidence And Become A Master Of The Art Of Communication",
      "Own The Stage And Develop Your Power Stance",
      "Move Up In Your Career And Win That Promotion",
      "Become A Leader In Conversational Coaching",
      "Master The Art Of Business Presentations",
      "Master The Art Of Personal Presentations",
      "Master The Art Of Public Speaking"
    ],
    "content": [
      {
        "title": "Module 1 - Introduction To The Course",
        "subsections": [
          {
            "title":"Course VideosPreview",
            "time":"1:30",
            "url":"https://www.youtube.com/watch?v=UGFfEchk7nc&pp=ygUyICBDb3Vyc2UgVmlkZW9zUHJldmlldyBjb21tdW5pY2F0aW9uIHNraWxscyBjb3Vyc2U%3D"
          }
        ]
      },
      {
        "title": "Module 2 - Mindset Adjustment",
        "subsections": [

          {
            "title":"Mindset AdjustmentPreview",
            "time":"1:57",
            "url":"https://www.youtube.com/watch?v=LI57EB_T38c&pp=ygU3ICBNaW5kc2V0IEFkanVzdG1lbnRQcmV2aWV3IGNvbW11bmljYXRpb24gc2tpbGxzIGNvdXJzZQ%3D%3D"
          }
        ]
      },
      {
        "title": "Module 3 - Key Power Influencers",
        "subsections": [
          {
           "title":"Power Influencers",
            "time": "04:09",
            "url":"https://www.youtube.com/watch?v=Fnt6P7Rnho8&pp=ygUvICBQb3dlciBJbmZsdWVuY2VycyBjb21tdW5pY2F0aW9uIHNraWxscyBjb3Vyc2U%3D"
          }
         
        ]
      },
      {
        "title": "Module 4 - The Power Of Appearance",
        "subsections": [
          {
            "title":"Power Of Appearance",
             "time": "01:23",
             "url":"https://www.youtube.com/watch?v=CrnF8YsXD_g&t=17s&pp=ygUWICBQb3dlciBPZiBBcHBlYXJhbmNlIA%3D%3D"
           }
        ]
      },
      {
        "title": "Module 5 - The Power Of Body Language",
        "subsections": [

          {
            "title":"Power Of Body Language",
             "time": "00:53",
             "url":"https://www.youtube.com/watch?v=ergJz5LUAGg&pp=ygUxICBQb3dlciBPZiBBcHBlYXJhbmNlIGNvbW11bmljYXRpb24gc2tpbGxzIGNvdXJzZQ%3D%3D"
           }
        ]
      },
      {
        "title": "Module 6 - The Power Of Words",
        "subsections": [
          {
            "title":"Power Of Words",
             "time": "01:56",
             "url":"https://www.youtube.com/watch?v=Iqq1roF4C8s&pp=ygUsICBQb3dlciBPZiBXb3JkcyBjb21tdW5pY2F0aW9uIHNraWxscyBjb3Vyc2U%3D"
           }
        ]
      },
      {
        "title": "Module 7 - The Art Of Contentment",
        "subsections": [

          {
            "title":"The Art Of Contentment",
             "time": "00:39",
             "url":"https://www.youtube.com/watch?v=wfIhGsoWgGw&pp=ygU0ICBUaGUgQXJ0IE9mIENvbnRlbnRtZW50IGNvbW11bmljYXRpb24gc2tpbGxzIGNvdXJzZQ%3D%3D"
           }
        ]
      },
      {
        "title": "Module 8 - The Art Of Charisma",
        "subsections": [
          {
            "title":"Art Of Charisma",
             "time": "01:16",
             "url":"https://www.youtube.com/watch?v=Ijcnk2OHrhc&pp=ygUSICBBcnQgT2YgQ2hhcmlzbWEg"
           }
        ]
      },
      {
        "title": "Other Important Considerations",
        "subsections": [

          {
            "title":"Art Of Giving Advice",
             "time": "08:57",
             "url":"https://www.youtube.com/watch?v=R4TY5LW3feM&pp=ygUXICBBcnQgT2YgR2l2aW5nIEFkdmljZSA%3D"
           }
        ]
      },
      {
        "title": "Module 10 - Roadmap To Success",
        "subsections": [
          {
            "title":"Conclusions",
             "time": "01:16",
             "url":"https://www.youtube.com/watch?v=Jm6EBTW1JVc&pp=ygUSUm9hZG1hcCBUbyBTdWNjZXNz"
           }
          
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/5913400_b7da_3.jpg",
    "category":"communications"
  },
  {
    "id":"85",
    "title": "ChatGPT for Freelance Translators",
    "price": "Price not found",
    "description": "Our instructor tested dozens of ChatGPT prompts related to the business of translation, in order to save you time and show you what works.Did you know that translators can use ChatGPT for more than just machine translation? This self-paced course will cover the ChatGPT prompts that streamline translation research, drafting, editing, formatting, and more. And of course, we will also cover how to effectively generate and post-edit machine translation that does not compromise on quality or accuracy.The course will also cover data privacy, translation project management, and troubleshooting.Use this course to boost your speed, accuracy, and enjoyment of the translation process! With this course you will learn to outsource the grunt work of translation, so that you can focus on what you do best.Designed for all levels, students can choose to take every detailed introductory lesson, or to skip ahead to more advanced topics.This class is ideal for freelance or in-house translators who are interested in implementing new effective habits to increase both their output and their enjoyment of the translation process.Our instructor, Sara Maria Hasbun, has worked in the translation industry for over a decade, and specializes in implementing new translation technologies. She has taught over 3,000 students through Udemy.",
    "instructor": "Sara Maria Hasbun",
    "requirements": [
      "No prior experience with ChatGPT or programming is necessary. All levels welcome."
    ],
    "whatYouWillLearn": [
      "How to use ChatGPT for terminology research",
      "How to use ChatGPT to format documents",
      "How to use ChatGPT for file conversions",
      "How to use ChatGPT for translation and editing"
    ],
    "content": [
      {
        "title": "Introduction",
        "subsections": [
          {
            "title": "Introduction",
            "time": "02:54",
            "url": "https://www.youtube.com/watch?v=962eYqe--Yc&pp=ygUzcHVibGljLXNwZWFraW5nLXNwZWFrLXRvLWluc3BpcmUtbGVhZC1hbmQtaW5mbHVlbmNl"
          }
            ]
      },
      {
        "title": "What is public speaking?",
        "subsections": [
          {
            "title": "What is public speaking?",
            "time": "13:17",
            "url": "https://www.youtube.com/watch?v=3G__0hU_hxI&pp=ygUYV2hhdCBpcyBwdWJsaWMgc3BlYWtpbmc_"
          }
        ]
      },
      {
        "title": "Secrets of public speaking",
        "subsections": [
          {
            "title":"Secrets of public speakingPreview",
            "time":"05:58",
            "url":"https://www.youtube.com/watch?v=-FOCpMAww28&pp=ygUaU2VjcmV0cyBvZiBwdWJsaWMgc3BlYWtpbmc%3D"
          }
        ]
      },
      {
        "title": "Preparing for public speaking",
        "subsections": [
          {
            "title":"Preparing for public speaking",
            "time":"11:23",
            "url":"https://www.youtube.com/watch?v=i5mYphUoOCs&pp=ygUdUHJlcGFyaW5nIGZvciBwdWJsaWMgc3BlYWtpbmc%3D"
          }
        ]
      },
      {
        "title": "How do you speak convincingly?",
        "subsections": [
          {
            "title":"How do you speak convincingly?",
            "time":"06:56",
            "url":"https://www.youtube.com/watch?v=vjdNewrG20E&pp=ygUdSG93IGRvIHlvdSBzcGVhayBjb252aW5jaW5nbHk%3D"
          }
        ]
      },
      {
        "title": "Сommon mistakes in preparation",
        "subsections": [
          {
            "title":"Сommon mistakes in preparation",
            "time":"07:28",
            "url":"https://www.youtube.com/shorts/S0Z0D3bMxuU"
          }
        ]
      },
      {
        "title": "Fighting fear",
        "subsections": [
          {
            "title":"Fighting fear",
            "time":"10:48",
            "url":"https://www.youtube.com/watch?v=-FyVetL1MEw&pp=ygUNRmlnaHRpbmcgZmVhcg%3D%3D"
          }
        ]
      },
      {
        "title": "Holding audience attention",
        "subsections": [
          {
            "title":"Holding audience attention",
            "time":"08:56",
            "url":"https://www.youtube.com/watch?v=cV6aHYx6E-E&pp=ygUaSG9sZGluZyBhdWRpZW5jZSBhdHRlbnRpb24%3D"
          }
        ]
      },
      {
        "title": "Top most common mistakes and harmful tips",
        "subsections": [
          {
            "title":"Top most common mistakes and harmful tips",
            "time":"05:45",
            "url":"https://www.youtube.com/watch?v=t0pC_TBeH-w&pp=ygU9VG9wIG1vc3QgY29tbW9uIG1pc3Rha2VzIGFuZCBoYXJtZnVsIHRpcHMgY29tbXVuaWNhdGluIGNvdXJzZQ%3D%3D"
          }
        ]
      },
      {
        "title": "Getting out of difficult situations",
        "subsections": [
          {
            "title":"Getting out of difficult situations",
            "time":"17:34",
            "url":"https://www.youtube.com/watch?v=ShXJM70bwU0&pp=ygU3R2V0dGluZyBvdXQgb2YgZGlmZmljdWx0IHNpdHVhdGlvbnMgY29tbXVuaWNhdGluIGNvdXJzZQ%3D%3D"
          }

          
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/6311215_0791_2.jpg",
    "category":"communications"
  },
  {
    "id":"86",
    "title": "Collaborative Excellence: Mastering Teamwork in Companies",
    "price": "Price not found",
    "description": "Mastering Teamwork and Collaboration in Corporate EnvironmentsBuilding High-Performance Teams in Corporate Environments Discover how to build a strong, cohesive team culture that drives success, happiness, and performance in the corporate world. Are you tired of watching your team struggle to work together? Are you dealing with silos, poor communication, and lack of motivation? As a leader, you know how frustrating it is when your team isn’t firing on all cylinders. Productivity takes a hit, people aren’t happy, and let’s face it, the business suffers. But here’s the thing—building a high-performing team doesn’t have to be complicated.That’s where my course, Collaborative Excellence: Mastering Teamwork in Companies, comes in. I’ve taken everything I’ve learned from years of working with companies worldwide and put together a simple, practical system to help you turn things around. We’ll get straight to the point with no fluff—just actionable steps to create a team that works together and actually enjoys it.You’ll learn how to implement the T.E.A.M. approach—Together Everyone Achieves More™—and trust me, this isn’t just another catchy acronym. This system is being used by some of the best companies out there, and now it’s your turn to use it. You’ll discover what it takes to get your team aligned, motivated, and ready to take on challenges.What’s great about this course is that it’s designed for you—the busy manager or leader who’s juggling 10 things at once. It’s all about practical, no-nonsense strategies you can start using right away. Whether it’s boosting communication, breaking down silos, or simply getting people to enjoy working together again, this course gives you everything you need.Think about it: what would it mean for your business if your team worked seamlessly? Less stress for you, happier employees, and most importantly, better results. If you’re ready to stop the frustration and start building a team that thrives, then sign up today. Because after all, Together Everyone Achieves More™—and that includes you.",
    "instructor": "CRFT Productions",
    "requirements": [
      "No previous experience or equipment is needed",
      "You may want to write down or print some of the information",
      "Having some examples in mind of situations you'd like to try it out on would be helpful",
      "A willingness to learn is essential!"
    ],
    "whatYouWillLearn": [
      "Understand how teamwork and collaboration drive success in corporate environments.",
      "Inspire your team with a clear vision and a larger shared purpose.",
      "Build trust, safety, and open communication within your team.",
      "Develop team members' ownership mindset and align them with the right roles.",
      "Foster a strong team spirit while managing underperformers effectively.",
      "Create growth opportunities, celebrate success, and empower teams to learn from failures.",
      "And much much more!"
    ],
   "content": [
      {
        "title": "Introduction and overview",
        "subsections": [
          {
            "title":"Why change communications matters more than everPreview",
            "time":"2:52",
            "url":"https://www.youtube.com/watch?v=7Rt8sgt7gNE&pp=ygVMV2h5IGNoYW5nZSBjb21tdW5pY2F0aW9ucyBtYXR0ZXJzIG1vcmUgdGhhbiBldmVyUHJldmlldyJjb21tdW5pY2F0aU9uIGNvdXJzZQ%3D%3D"
          }
          
        ]
      },
      {
        "title": "Phase 1: Hear it - the first phase of our staggered approach to change comms",
        "subsections": [
          {
            "title":"Cutting through the noise",
            "time":"04:46",
            "url":"https://www.youtube.com/watch?v=UkcxKXBWio0&pp=ygUuQ3V0dGluZyB0aHJvdWdoIHRoZSBub2lzZSBjb21tdW5pY2F0aU9uIGNvdXJzZdIHCQl-CQGHKiGM7w%3D%3D"
          }
         
          
        ]
      },
      {
        "title": "Feel it - the second phase of our staggered approach to change comms",
        "subsections": [
          {
            "title":"From head to haert",
            "time":"4:49",
            "url":"https://www.youtube.com/watch?v=QGeHS4jO0X0&pp=ygUnRnJvbSBoZWFkIHRvIGhhZXJ0IGNvbW11bmljYXRpb24gY291cnNl"
          }
          
          
        ]
      },
      {
        "title": "Understand it - the third phase of our staggered approach to change comms",
        "subsections": [
          {
            "title":"Building understanding through layered messaging",
            "time":"4:56",
            "url":"https://www.youtube.com/watch?v=Q8SFYo1nmrQ&pp=ygVFQnVpbGRpbmcgdW5kZXJzdGFuZGluZyB0aHJvdWdoIGxheWVyZWQgbWVzc2FnaW5nIGNvbW11bmljYXRpb24gY291cnNl"
          }
        ]
      },
      {
        "title": "Do it - the fourth phase of our staggered approach to change comms",
        "subsections": [
          {
            "title":"Turning communications into behaviour",
            "time":"4:40",
            "url":"https://www.youtube.com/watch?v=hAxCpAnV3-E&pp=ygU6VHVybmluZyBjb21tdW5pY2F0aW9ucyBpbnRvIGJlaGF2aW91ciBjb21tdW5pY2F0aW9uIGNvdXJzZQ%3D%3D"
          }
        ]
      },
      {
        "title": "Live it - the final phase of our staggered approach to change comms",
        "subsections": [
          {
            "title":"Sustaining the conversation",
            "time":"4:11",
            "url":"https://www.youtube.com/watch?v=0g1r7v2xX4E&pp=ygUjU3VzdGFpbmluZyB0aGUgY29udmVyc2F0aW9uIGNvbW11bmljYXRpb24gY291cnNl"
          }
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/6215765_552b_2.jpg",
    "category":"communications"
  },
  {
    "id":"87",
    "title": "Constructive Feedback",
    "price": "Price not found",
    "description": "CONSTRUCTIVE FEEDBACK – CONTINUOUSLY IMPROVING YOUR FEEDBACK SKILLS.IF YOU ARE AN HR MANAGER OR SUPERVISOR OR TEAM LEADER AND LACK SKILLS IN GIVING FEEDBACK, THIS COMPREHENSIVE COURSE IS EXCLUSIVELY DESIGNED FOR YOU.Giving constructive feedback is nerve-wracking but very important for thriving in the workplace.It is very important to receive and give feedback to unlock the full potential in you and now where you are lagging.ONE STUDY FOUND OUT THAT PEOPLE WANT FEEDBACK IF THEY ARE ON THE RECEIVING END.THIS COURSE IS CREATED TO OVERCOME THE FEAR OF GIVING FEEDBACK.The entire course is flanked with proven techniques, personalized assessments, and in-depth understanding of constructive feedback.Moreover, the tips given in this course will make you a REAL MASTER IN GIVING CONSTRUCTIVE FEEDBACK.ENROL SOON! DON’T MISS THIS OPPORTUNITY!Why you should enroll in this course?By taking this course, you will understand the importance of giving and receiving feedback.  How a positive and negative feedback can help you to grow in the organization.  You will learn how both positive and negative feedback will motivate the individual to perform better, improve himself/herself and the organization. What you will learn by taking this course?After enrolling in this course, you will learn the following:-Importance of feedback:-  Communication is a two-way exchange of thoughts. Feedback is an integral part of this process. For the communication to be effective, you have to be aware of the impact of your words and actions on others. In personal as well as professional life, interpersonal skills are critical in developing healthy relationships. The ability to provide effective feedback, is an important aspect of interpersonal skills.Purpose of feedback:- Provides information about behaviour and performance against standards in such a way that recipients maintain a positive attitude towards themselves and their work.  Encourages recipients to commit themselves to a personal plan to move towards agreed standards of behaviour and performance.From whom do you need or want feedback?:- We need feedback from those whose opinion we value most and those who can have the greatest influence on our development. However, you may be less willing to accept feedback from your staff, feeling that it threatens your position as manager. But, remember that your staff know you more closely than others and can offer a very valuable review. Similarly, close colleagues or other team members can provide a unique perspective on your skills and communication abilities.How to get constructive feedback?:- Decide on the outcomes you want, Calibrate your feedback, Alert your “feed-back provider” that you are looking for a frank review, Use your communication skills, Be specific about the help you are seeking.How this course is structured?This is a comprehensive course and the entire course is divided into several modules of video formats.  All the concepts - both basic and advanced are explained using simple English.  More practical scenarios, case studies and real life examples are included in this course to make you understand the concepts in an easy manner and to make the course is very interesting.   The course is very interactive and you can participate in the case studies and scenarios and you will feel as if you are in real class room.  How this course will benefit you?At the end of the course, you will learn how to take feedbacks in a positive manner and will teach you how to improve on those areas where you are lagging.   This course also teaches you how to be more productive and contribute more to your organization.",
    "instructor": "Management Study Guide",
    "requirements": [
      "No prior knowledge or experience is required.",
      "A laptop or a PC with good internet connection and basic understanding of English."
    ],
    "whatYouWillLearn": [
      "Learn how to give constructive feedback to your staff.",
      "Learn how NOT to delay in giving feedback.",
      "Learn how to discuss performance and behavioral issues with staff.",
      "Learn how to improve continuously improving your feedback skills."
    ],
    "content": [
      {
        "title": "Introduction",
        "subsections": [

          {
            "title": "Introduction",
            "time":"02:25",
            "url":"https://www.youtube.com/shorts/S0Z0D3bMxuU"
          }
        ]
      },
      {
        "title": "10 Best Practices for Email Deliverability",
        "subsections": [

            {
              "title":"SPAM Trigger Words",
              "time":"02:06",
              "url":"https://www.youtube.com/watch?v=wvAWyeqiql4&pp=ygUnU1BBTSBUcmlnZ2VyIFdvcmRzIGNvbW11bmljYXRpb24gY291cnNl"
            }
        ]
      },
      {
        "title": "13 Ways to Minimize SPAM Complaints",
        "subsections": [

          {
            "title":"Protecting Your IP Address",
            "time":"05:44",
            "url":"https://www.youtube.com/watch?v=--onbg-jHqQ&pp=ygUvUHJvdGVjdGluZyBZb3VyIElQIEFkZHJlc3MgY29tbXVuaWNhdGlvbiBjb3Vyc2U%3D"
          }
        ]
      },
      {
        "title": "Gowing Email Marketing",
        "subsections": [
          {
            "title":"Email Marketing",
            "time":"01:05",
            "url":"https://www.youtube.com/shorts/ReOyGeTHwfE"
          }
        ]
      },
      {
        "title": "Summary and Thank You!",
        "subsections": [

        {
          "title":"Summary and Thank you!",
          "time":"01:43",
          "url":"https://www.youtube.com/watch?v=--onbg-jHqQ&pp=ygUvUHJvdGVjdGluZyBZb3VyIElQIEFkZHJlc3MgY29tbXVuaWNhdGlvbiBjb3Vyc2U%3D"
        }
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/2539126_c59d.jpg",
    "category":"communications"
  },
  {
    "id":"88",
    "title": "A Leader's Guide to Camera-Confident Communication",
    "price": "Price not found",
    "description": "Are you tired of feeling nervous and self-conscious on camera? Do you struggle to make an impact when giving virtual presentations, hesitate to speak up at online meetings, or try to avoid being on video? If so, my new course, \"A Leader's Guide to Camera-Confident Communication\" is here to help.In this course, we will explore proven techniques to feel more confident and in control when speaking on camera. The course is designed for busy rising and aspiring business leaders who need to communicate effectively on camera, but don't have the time to spend hours in a classroom. I've designed the lessons to be short, easy to apply, and highly effective.From learning how to set up your physical space for shooting video to mastering your message to convey confidence and credibility, this course is packed with valuable information that will help you take your leadership communication to the next level.In addition to the lessons, you'll have access to various resources, including worksheets, and video exercises I call “homework.” They’re optional, but I encourage you to try them. The course's foundational principles will help you continue to develop your skills long after the course is over.Don't let nerves hold you back any longer.Sign up for \" A Leader's Guide to Camera-Confident Communication” today and stand out. You'll be amazed at the difference confidence can make in your career when you become a better business communicator, on camera and off.Note:  I used ChatGPT to edit and refine this copy.",
    "instructor": "Janet Vasil",
    "requirements": [
      "Working video camera on smart phone, tablet or computer",
      "Ability to record and willingness to watch yourself on video",
      "Desire to improve your on-camera communication skills",
      "Willingness to practice to become a better business communicator"
    ],
    "whatYouWillLearn": [
      "Feel comfortable and confident on camera",
      "Project authenticity and credibility on camera",
      "Look and sound your best on camera",
      "Be ready to communicate with courage and charisma on-camera and off"
    ],
    "content": [
      {
        "title": "Introduction and overview",
        "subsections": [
          {
            "title":"Why change communications matters more than everPreview",
            "time":"2:52",
            "url":"https://www.youtube.com/watch?v=7Rt8sgt7gNE&pp=ygVMV2h5IGNoYW5nZSBjb21tdW5pY2F0aW9ucyBtYXR0ZXJzIG1vcmUgdGhhbiBldmVyUHJldmlldyJjb21tdW5pY2F0aU9uIGNvdXJzZQ%3D%3D"
          }
          
        ]
      },
      {
        "title": "Phase 1: Hear it - the first phase of our staggered approach to change comms",
        "subsections": [
          {
            "title":"Cutting through the noise",
            "time":"04:46",
            "url":"https://www.youtube.com/watch?v=UkcxKXBWio0&pp=ygUuQ3V0dGluZyB0aHJvdWdoIHRoZSBub2lzZSBjb21tdW5pY2F0aU9uIGNvdXJzZdIHCQl-CQGHKiGM7w%3D%3D"
          }
         
          
        ]
      },
      {
        "title": "Feel it - the second phase of our staggered approach to change comms",
        "subsections": [
          {
            "title":"From head to haert",
            "time":"4:49",
            "url":"https://www.youtube.com/watch?v=QGeHS4jO0X0&pp=ygUnRnJvbSBoZWFkIHRvIGhhZXJ0IGNvbW11bmljYXRpb24gY291cnNl"
          }
          
          
        ]
      },
      {
        "title": "Understand it - the third phase of our staggered approach to change comms",
        "subsections": [
          {
            "title":"Building understanding through layered messaging",
            "time":"4:56",
            "url":"https://www.youtube.com/watch?v=Q8SFYo1nmrQ&pp=ygVFQnVpbGRpbmcgdW5kZXJzdGFuZGluZyB0aHJvdWdoIGxheWVyZWQgbWVzc2FnaW5nIGNvbW11bmljYXRpb24gY291cnNl"
          }
        ]
      },
      {
        "title": "Do it - the fourth phase of our staggered approach to change comms",
        "subsections": [
          {
            "title":"Turning communications into behaviour",
            "time":"4:40",
            "url":"https://www.youtube.com/watch?v=hAxCpAnV3-E&pp=ygU6VHVybmluZyBjb21tdW5pY2F0aW9ucyBpbnRvIGJlaGF2aW91ciBjb21tdW5pY2F0aW9uIGNvdXJzZQ%3D%3D"
          }
        ]
      },
      {
        "title": "Live it - the final phase of our staggered approach to change comms",
        "subsections": [
          {
            "title":"Sustaining the conversation",
            "time":"4:11",
            "url":"https://www.youtube.com/watch?v=0g1r7v2xX4E&pp=ygUjU3VzdGFpbmluZyB0aGUgY29udmVyc2F0aW9uIGNvbW11bmljYXRpb24gY291cnNl"
          }
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/5334454_2413_3.jpg",
    "category":"communications"
  },
  {
    "id":"89",
    "title": "Developing Assertive Personality",
    "price": "Price not found",
    "description": "Being assertive is key in life journey, assertiveness is a personality traits that is located in the middle of the personality scale or continuum, where you have passiveness on one end and aggressiveness on the other. When a person is label as assertive, it means they embody certain traits, characteristics, and behaviors that are not passive or aggressive and they can stand effectively for their own rights. Let look at this example, a person with assertive personality has the confidence to effectively, calmly, directly, and confidently communicate what they need, desire, and want while, at the same time, being respectful of others, they minimize conflict and maintaining their own boundaries.   Developing assertively is very important and it goes through a process, being assertive is a healthy social and interpersonal skill you can learn and work at, nobody is born of being assertive. It is very important to express ourselves assertively in all spheres of life, from family and friends to school and work.  Assertive individuals confront life challenges with determination and they develop the best strategies to overcome them, they do not give up in life easily. Assertiveness is a valuable traits because it helps you to reduce stress, regulate our feeling and emotions, and also aid in improving our coping skills.",
    "instructor": "Eric Yeboah",
    "requirements": [
      "No special requirement",
      "Desire to be more assertive",
      "Hoping to develop assertive personality"
    ],
    "whatYouWillLearn": [
      "Assertive core personality traits",
      "Developing more assertively",
      "Assertiveness and the four styles of communication",
      "Strategies to stand up for yourself",
      "Ways to use personality styles in your organization",
      "How to respond to passive-aggressive comments",
      "How to use the \"I\" language",
      "Working with assertive personality",
      "Assertiveness is key in risk management",
      "The limitations of niceness"
    ],
   "content": [
      {
        "title": "Introduction",
        "subsections": [
          {
            "title":"General Housekeeping",
            "time":"02:03",
            "url":"https://www.youtube.com/watch?v=aYEuRc0vk7U&pp=ygUUR2VuZXJhbCBIb3VzZWtlZXBpbmc%3D"
          }
          
        ]
      },
      {
        "title": "Building Your Career While Utilizing Internal and External Resources",
        "subsections": [
          {
            "title":"Learn about Constructive Criticism, Billing, and Staying ProductivePreview",
            "time":"03:58",
            "url":"https://www.youtube.com/shorts/68N8tyXylrU"
          }
        ]
      },
      {
        "title": "The Core Foundations of Communication",
        "subsections": [
          {
            "title":"Verbal CommunicationPreview",
            "time":"02:01",
            "url":"https://www.youtube.com/watch?v=4_5dayHDdBk&pp=ygUbVmVyYmFsIENvbW11bmljYXRpb25QcmV2aWV3"
          }
        ]
      },
      {
        "title": "Internal and External Resources and What to Expect as a New Lawyer",
        "subsections": [
          {
            "title":"Leveraging Social Media",
            "time":"01:37",
            "url":"https://www.youtube.com/watch?v=9AtpcZv--MA&pp=ygUXTGV2ZXJhZ2luZyBTb2NpYWwgTWVkaWE%3D"
          }
        ]
      },
      {
        "title": "The Basics on Negotiating",
        "subsections": [
          {
            "title":"Proper Negotiation Tactics For Clients",
            "time":"05:45",
            "url":"https://www.youtube.com/watch?v=z3U0FRb9yr4&pp=ygUmUHJvcGVyIE5lZ290aWF0aW9uIFRhY3RpY3MgRm9yIENsaWVudHM%3D"
          }
        ]
      },
      {
        "title": "Your One Year Mark",
        "subsections": [
          {
            "title":"Asking for a Raise",
            "time":"05:29",
            "url":"https://www.youtube.com/watch?v=vGqswpmICP8&pp=ygUSQXNraW5nIGZvciBhIFJhaXNl"
          }
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/5454126_a9b4.jpg",
    "category":"communications"
  },
  {
    "id":"90",
    "title": "Technical Writing: How to Become a Technical Writer",
    "price": "Price not found",
    "description": "Technical Writing: How to Become a Technical WriterAre you looking for a high-paying, in-demand career that allows you to work remotely and break into the tech industry—even without coding skills? Technical writing is your answer!Why Become a Technical Writer?Technical writers earn good pay annually on average, with top professionals making six figures. With companies constantly looking for skilled writers to simplify complex information, the demand for technical writers has never been higher!What You'll Learn in This CourseThis comprehensive course will take you from a beginner to a job-ready technical writer by covering:What is technical writing? Understand the fundamentals and why it’s one of the most sought-after skills in the job market.The many hats of a technical writer – Explore different roles from API documentation to UX writing.Technical writing vs. other forms of writing – Learn what makes it unique.Essential skills required for technical writing – Master research, structuring, and clarity.Do you need coding skills? Find out when and why coding is helpful for technical writers.Mastering the art of technical writing – Learn best practices and industry standards.Building a technical writing portfolio – Showcase your skills and attract high-paying clients or employers.How to find technical writing jobs on LinkedIn – Land jobs faster using proven job-hunting techniques.Mistakes to avoid when applying for technical writing jobs – Get hired with confidence by avoiding common errors.Paid programs for writers – Discover opportunities to monetize your skills and grow your career.Who is This Course For?Beginners who want to start a career in technical writingWriters looking to transition into the tech industryFreelancers who want to increase their income with a new skillProfessionals looking to switch careers and work remotelyEnroll Now & Begin Your Technical Writing Career!",
    "instructor": "Harriet Tonlagha",
    "requirements": [
      "No prior experience needed"
    ],
    "whatYouWillLearn": [
      "Mastering the Art of Technical Writing",
      "Building a Technical Writing Portfolio",
      "How to Find Technical Writing Jobs on LinkedIn",
      "Mistakes to Avoid When Applying for Technical Writing Jobs"
    ],
    "content": [
      {
        "title": "Module 1 - Introduction To The Course",
        "subsections": [
          {
            "title":"Course VideosPreview",
            "time":"1:30",
            "url":"https://www.youtube.com/watch?v=UGFfEchk7nc&pp=ygUyICBDb3Vyc2UgVmlkZW9zUHJldmlldyBjb21tdW5pY2F0aW9uIHNraWxscyBjb3Vyc2U%3D"
          }
        ]
      },
      {
        "title": "Module 2 - Mindset Adjustment",
        "subsections": [

          {
            "title":"Mindset AdjustmentPreview",
            "time":"1:57",
            "url":"https://www.youtube.com/watch?v=LI57EB_T38c&pp=ygU3ICBNaW5kc2V0IEFkanVzdG1lbnRQcmV2aWV3IGNvbW11bmljYXRpb24gc2tpbGxzIGNvdXJzZQ%3D%3D"
          }
        ]
      },
      {
        "title": "Module 3 - Key Power Influencers",
        "subsections": [
          {
           "title":"Power Influencers",
            "time": "04:09",
            "url":"https://www.youtube.com/watch?v=Fnt6P7Rnho8&pp=ygUvICBQb3dlciBJbmZsdWVuY2VycyBjb21tdW5pY2F0aW9uIHNraWxscyBjb3Vyc2U%3D"
          }
         
        ]
      },
      {
        "title": "Module 4 - The Power Of Appearance",
        "subsections": [
          {
            "title":"Power Of Appearance",
             "time": "01:23",
             "url":"https://www.youtube.com/watch?v=CrnF8YsXD_g&t=17s&pp=ygUWICBQb3dlciBPZiBBcHBlYXJhbmNlIA%3D%3D"
           }
        ]
      },
      {
        "title": "Module 5 - The Power Of Body Language",
        "subsections": [

          {
            "title":"Power Of Body Language",
             "time": "00:53",
             "url":"https://www.youtube.com/watch?v=ergJz5LUAGg&pp=ygUxICBQb3dlciBPZiBBcHBlYXJhbmNlIGNvbW11bmljYXRpb24gc2tpbGxzIGNvdXJzZQ%3D%3D"
           }
        ]
      },
      {
        "title": "Module 6 - The Power Of Words",
        "subsections": [
          {
            "title":"Power Of Words",
             "time": "01:56",
             "url":"https://www.youtube.com/watch?v=Iqq1roF4C8s&pp=ygUsICBQb3dlciBPZiBXb3JkcyBjb21tdW5pY2F0aW9uIHNraWxscyBjb3Vyc2U%3D"
           }
        ]
      },
      {
        "title": "Module 7 - The Art Of Contentment",
        "subsections": [

          {
            "title":"The Art Of Contentment",
             "time": "00:39",
             "url":"https://www.youtube.com/watch?v=wfIhGsoWgGw&pp=ygU0ICBUaGUgQXJ0IE9mIENvbnRlbnRtZW50IGNvbW11bmljYXRpb24gc2tpbGxzIGNvdXJzZQ%3D%3D"
           }
        ]
      },
      {
        "title": "Module 8 - The Art Of Charisma",
        "subsections": [
          {
            "title":"Art Of Charisma",
             "time": "01:16",
             "url":"https://www.youtube.com/watch?v=Ijcnk2OHrhc&pp=ygUSICBBcnQgT2YgQ2hhcmlzbWEg"
           }
        ]
      },
      {
        "title": "Other Important Considerations",
        "subsections": [

          {
            "title":"Art Of Giving Advice",
             "time": "08:57",
             "url":"https://www.youtube.com/watch?v=R4TY5LW3feM&pp=ygUXICBBcnQgT2YgR2l2aW5nIEFkdmljZSA%3D"
           }
        ]
      },
      {
        "title": "Module 10 - Roadmap To Success",
        "subsections": [
          {
            "title":"Conclusions",
             "time": "01:16",
             "url":"https://www.youtube.com/watch?v=Jm6EBTW1JVc&pp=ygUSUm9hZG1hcCBUbyBTdWNjZXNz"
           }
          
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/6154251_41c8.jpg",
    "category":"communications"
  },
  {
    "id":"91",
    "title": "Prompt Engineering with Chat GPT",
    "price": "Price not found",
    "description": "Ready to cut your content creation TIME IN HALF?Stop using the same old prompts as everyone else—learn how to make ChatGPT work for your brand with prompt engineering.The frustration is real You’re excited about using ChatGPT to create content for your business, but every time you try, the results are disappointing.Instead of fresh, engaging content, you end up with the same dull, generic output that everyone else is getting. It’s frustrating, isn’t it?Your brand deserves to stand out, but how can it when the AI keeps delivering the same uninspired results?IT DOESN'T HAVE TO BE THAT WAY! Imagine writing prompts that actually work —prompts that sound like you and speak directly to your audience. No more trial and error, no more wasted hours. Just clear, actionable results that help you get ahead, not just keep up.Throughout this course, you will:Master the fundamentals of prompt engineering, learning what makes a good prompt and how to structure it for optimal results.Tailor prompts to enhance your brand’s unique voice, ensuring your content is engaging and perfectly aligned with your business goals.Dive into advanced prompt techniques tailored for specific business scenarios, including marketing and customer service, enhancing your digital outreach.By the end of this course, you will be able to efficiently create content that stands out, engages your target audience, and optimizes your content creation process. Whether you're a small business owner, a digital marketer, or an entrepreneur, this course will equip you with the skills needed to turn AI into one of your most powerful business tools. Ensure your brand’s message is heard loud and clear in a saturated digital landscape.",
    "instructor": "Liya Bergen",
    "requirements": [
      "Suitable for both AI beginners and experienced users.",
      "Access to ChatGPT (versions 4o) is required.",
      "Enthusiasm for enhancing digital content and brand presence."
    ],
    "whatYouWillLearn": [
      "Master the Fundamentals of Prompt Engineering: You will learn what makes an effective prompt and how to structure your prompts to get optimal results.",
      "Learn to craft prompts that showcase your brand voice, making your content unique and aligned with business goals.",
      "Explore advanced prompt techniques for business scenarios like marketing and customer service, learning to apply prompt engineering effectively.",
      "Master creating engaging, standout digital content that optimizes your creation process by the end of this course."
    ],
    "content": [
      {
        "title": "Introduction and overview",
        "subsections": [
          {
            "title":"Why change communications matters more than everPreview",
            "time":"2:52",
            "url":"https://www.youtube.com/watch?v=7Rt8sgt7gNE&pp=ygVMV2h5IGNoYW5nZSBjb21tdW5pY2F0aW9ucyBtYXR0ZXJzIG1vcmUgdGhhbiBldmVyUHJldmlldyJjb21tdW5pY2F0aU9uIGNvdXJzZQ%3D%3D"
          }
          
        ]
      },
      {
        "title": "Phase 1: Hear it - the first phase of our staggered approach to change comms",
        "subsections": [
          {
            "title":"Cutting through the noise",
            "time":"04:46",
            "url":"https://www.youtube.com/watch?v=UkcxKXBWio0&pp=ygUuQ3V0dGluZyB0aHJvdWdoIHRoZSBub2lzZSBjb21tdW5pY2F0aU9uIGNvdXJzZdIHCQl-CQGHKiGM7w%3D%3D"
          }
         
          
        ]
      },
      {
        "title": "Feel it - the second phase of our staggered approach to change comms",
        "subsections": [
          {
            "title":"From head to haert",
            "time":"4:49",
            "url":"https://www.youtube.com/watch?v=QGeHS4jO0X0&pp=ygUnRnJvbSBoZWFkIHRvIGhhZXJ0IGNvbW11bmljYXRpb24gY291cnNl"
          }
          
          
        ]
      },
      {
        "title": "Understand it - the third phase of our staggered approach to change comms",
        "subsections": [
          {
            "title":"Building understanding through layered messaging",
            "time":"4:56",
            "url":"https://www.youtube.com/watch?v=Q8SFYo1nmrQ&pp=ygVFQnVpbGRpbmcgdW5kZXJzdGFuZGluZyB0aHJvdWdoIGxheWVyZWQgbWVzc2FnaW5nIGNvbW11bmljYXRpb24gY291cnNl"
          }
        ]
      },
      {
        "title": "Do it - the fourth phase of our staggered approach to change comms",
        "subsections": [
          {
            "title":"Turning communications into behaviour",
            "time":"4:40",
            "url":"https://www.youtube.com/watch?v=hAxCpAnV3-E&pp=ygU6VHVybmluZyBjb21tdW5pY2F0aW9ucyBpbnRvIGJlaGF2aW91ciBjb21tdW5pY2F0aW9uIGNvdXJzZQ%3D%3D"
          }
        ]
      },
      {
        "title": "Live it - the final phase of our staggered approach to change comms",
        "subsections": [
          {
            "title":"Sustaining the conversation",
            "time":"4:11",
            "url":"https://www.youtube.com/watch?v=0g1r7v2xX4E&pp=ygUjU3VzdGFpbmluZyB0aGUgY29udmVyc2F0aW9uIGNvbW11bmljYXRpb24gY291cnNl"
          }
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/6060307_5120.jpg",
    "category":"communications"
  },
  {
    "id":"92",
    "title": "Your Empowered Voice",
    "price": "Price not found",
    "description": "Are you tired of letting fear or anxiety hold you back from expressing yourself and speaking up in various situations? Whether it's conversations with peers, presentations at work, or public speaking engagements, fear can hinder your ability to communicate effectively. In the Empowered Voice course, you'll learn how to overcome your fear of speaking and discover your authentic voice, enabling you to feel secure and confident in any speaking scenario.Through a series of transformative exercises and practical techniques, this course will empower you to eliminate your fear of speaking and unlock your true potential as a communicator. You'll gain the necessary confidence to calmly navigate conversations, express your thoughts authentically, and break free from the limitations imposed by others. By the end of the course, you'll have the confidence to speak your truth instead of conforming to expectations.What Will I Learn?- Identify the root causes of your fear and learn strategies to overcome them- Develop techniques to boost your confidence in speaking situations- Discover your unique voice and learn to express yourself authentically- Learn how to overcome stage fright and perform with poise and presence- Practice techniques to manage anxiety and stress associated with speakingAnd More!This course combines theory, practical exercises, and real-life examples to provide you with a comprehensive learning experience. Each module offers step-by-step guidance, allowing you to develop your speaking abilities progressively.Your Empowered Voice: Learn How To Unleash Your Voice To Transform Your Life is designed for anyone who wishes to become a confident and impactful communicator. Whether you're an introvert looking to break free from fear or an experienced speaker seeking to refine your skills, this course will help you achieve your goals.Join us on this transformative journey to eliminate your fear of speaking and unlock your true voice. Gain the skills, confidence, and empowerment you need to speak up, be heard, and make a lasting impact in any situation. Enroll in Empowered Voice today and take control of your communication destiny!Note: This course is not intended to provide therapy or treatment for specific speech disorders or severe social anxiety. If you require professional assistance for such conditions, we recommend consulting a speech-language pathologist or mental health professional.",
    "instructor": "Nancy Bos",
    "requirements": [
      "No previous experience required. You will learn the foundations of overcoming fear of speaking - whether that is to a few key people or on the stage in front of hundreds of people."
    ],
    "whatYouWillLearn": [
      "Understand the sources of performance anxiety or stage fright",
      "Overcome your fear in order to start feeling secure and confident about speaking up",
      "Know how to overcome limitations put on you by others and discover your own voice",
      "Speak your truth authentically instead of saying what people expect you to say",
      "Unleash and free your voice"
    ],
    "content": [
      {
        "title": "Introduction",
        "subsections": [
          {
            "title": "Introduction",
            "time": "02:54",
            "url": "https://www.youtube.com/watch?v=962eYqe--Yc&pp=ygUzcHVibGljLXNwZWFraW5nLXNwZWFrLXRvLWluc3BpcmUtbGVhZC1hbmQtaW5mbHVlbmNl"
          }
            ]
      },
      {
        "title": "What is public speaking?",
        "subsections": [
          {
            "title": "What is public speaking?",
            "time": "13:17",
            "url": "https://www.youtube.com/watch?v=3G__0hU_hxI&pp=ygUYV2hhdCBpcyBwdWJsaWMgc3BlYWtpbmc_"
          }
        ]
      },
      {
        "title": "Secrets of public speaking",
        "subsections": [
          {
            "title":"Secrets of public speakingPreview",
            "time":"05:58",
            "url":"https://www.youtube.com/watch?v=-FOCpMAww28&pp=ygUaU2VjcmV0cyBvZiBwdWJsaWMgc3BlYWtpbmc%3D"
          }
        ]
      },
      {
        "title": "Preparing for public speaking",
        "subsections": [
          {
            "title":"Preparing for public speaking",
            "time":"11:23",
            "url":"https://www.youtube.com/watch?v=i5mYphUoOCs&pp=ygUdUHJlcGFyaW5nIGZvciBwdWJsaWMgc3BlYWtpbmc%3D"
          }
        ]
      },
      {
        "title": "How do you speak convincingly?",
        "subsections": [
          {
            "title":"How do you speak convincingly?",
            "time":"06:56",
            "url":"https://www.youtube.com/watch?v=vjdNewrG20E&pp=ygUdSG93IGRvIHlvdSBzcGVhayBjb252aW5jaW5nbHk%3D"
          }
        ]
      },
      {
        "title": "Сommon mistakes in preparation",
        "subsections": [
          {
            "title":"Сommon mistakes in preparation",
            "time":"07:28",
            "url":"https://www.youtube.com/shorts/S0Z0D3bMxuU"
          }
        ]
      },
      {
        "title": "Fighting fear",
        "subsections": [
          {
            "title":"Fighting fear",
            "time":"10:48",
            "url":"https://www.youtube.com/watch?v=-FyVetL1MEw&pp=ygUNRmlnaHRpbmcgZmVhcg%3D%3D"
          }
        ]
      },
      {
        "title": "Holding audience attention",
        "subsections": [
          {
            "title":"Holding audience attention",
            "time":"08:56",
            "url":"https://www.youtube.com/watch?v=cV6aHYx6E-E&pp=ygUaSG9sZGluZyBhdWRpZW5jZSBhdHRlbnRpb24%3D"
          }
        ]
      },
      {
        "title": "Top most common mistakes and harmful tips",
        "subsections": [
          {
            "title":"Top most common mistakes and harmful tips",
            "time":"05:45",
            "url":"https://www.youtube.com/watch?v=t0pC_TBeH-w&pp=ygU9VG9wIG1vc3QgY29tbW9uIG1pc3Rha2VzIGFuZCBoYXJtZnVsIHRpcHMgY29tbXVuaWNhdGluIGNvdXJzZQ%3D%3D"
          }
        ]
      },
      {
        "title": "Getting out of difficult situations",
        "subsections": [
          {
            "title":"Getting out of difficult situations",
            "time":"17:34",
            "url":"https://www.youtube.com/watch?v=ShXJM70bwU0&pp=ygU3R2V0dGluZyBvdXQgb2YgZGlmZmljdWx0IHNpdHVhdGlvbnMgY29tbXVuaWNhdGluIGNvdXJzZQ%3D%3D"
          }

          
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/5375816_fea2_3.jpg",
    "category":"communications"
  },
  {
    "id":"93",
    "title": "Create A Compelling And Authentic Brand Story",
    "price": "Current priceE£399.99",
    "description": "Do you want to build authentic relationships with your clients and customers? Would you like to share your story as a business instead of creating yet another advertisement? Do you need help crafting compelling stories that resonate with your stakeholders? If so, this is the course for you!In the modern business world, it’s no longer enough to focus on traditional advertising. Genuine storytelling can be a powerful way to share your messages, goals, and values with your audience. Advertisements can be found anywhere you look, but a business story is unique because it involves listeners in your journey. From television to novels, stories draw people in by making them feel something. Once you understand how to tell yours, you'll quickly see how forming an emotional connection can help you build trust, reach new markets and stand out from the competition. If we consider the fact that 52% of consumers state that they're more likely to support brands that work toward a greater purpose, we can see how imperative it is that we get our story across.Through six video-based lectures, we will provide you with all the tools you need to maximise your creativity and tell your story in a way that will resonate with your target audience. We'll also discuss how to incorporate sales pitches and blend the lines between storytelling and advertising. You will work through common obstacles to success and learn the best practices that have helped real-life companies use storytelling to drive sales and provide value to their customers. Additionally, you will be offered tips and advice for how you can build a strong and effective pitch in as little as 5 seconds! We're confident that upon completion of this course, you'll have all the necessary knowledge and skills to approach your storytelling goals with a new perspective. Instead of simply reciting some facts about your organisation, we'll show you how to create a compelling narrative to persuade, motivate and inspire your audience. Enrol now to learn more!",
    "instructor": "Expert Academy",
    "requirements": [
      "No specific requirements."
    ],
    "whatYouWillLearn": [
      "Understand the purpose of a business story.",
      "Learn to structure and deliver your brand story.",
      "Adopt strategies to motivate your employees through storytelling.",
      "Understand how to include a story in your sales pitch.",
      "Recognise the types of business pitches that work well with stories.",
      "Explore case studies for well-known brands that have used storytelling effectively."
    ],
    "content": [
      {
        "title": "Introduction",
        "subsections": [
          {
            "title":"Introduction To Business StorytellingPreview",
            "time":"05:47",
            "url":"https://www.youtube.com/watch?v=WKIZ0bicfFw&pp=ygUsSW50cm9kdWN0aW9uIFRvIEJ1c2luZXNzIFN0b3J5dGVsbGluZ1ByZXZpZXc%3D"
          }
          
        ]
      },
      {
        "title": "Storytelling For Business Marketing And Sales",
        "subsections": [
          {
            "title":"Successful Pitches",
            "time":" 04:24",
            "url":"https://www.youtube.com/watch?v=l0hVIH3EnlQ&pp=ygUSU3VjY2Vzc2Z1bCBQaXRjaGVz"
          } 
        ]
      },
      {
        "title": "Conclusion",
        "subsections": [
          {
            "title":"Conclusion",
            "time":"02:48",
            "url":""
          } 
          
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/5648468_cdc4.jpg",
    "category":"communications"
  },
  {
    "id":"94",
    "title": "Google Notebook LLM: Your AI-Powered Writing Companion",
    "price": "Current priceE£599.99",
    "description": "This course features and applications of Google NotebookLM, focusing on leveraging this generative AI tool for effective note-taking, organization, and knowledge management. Instructors should highlight practical use cases, best practices for integrating them into workflows, and techniques for maximizing productivity and collaboration through the tool’s capabilities.Are you ready to supercharge your writing with the power of AI? Whether you're a student, professional, content creator, or researcher, Google Notebook LLM is the ultimate tool for writing more intelligently, faster, and efficiently.This course will take you on an exciting journey to unlock the full potential of Google Notebook LLM—Google’s cutting-edge AI-powered writing assistant. You'll learn how to leverage this revolutionary tool to generate high-quality content, refine your writing, conduct research, and boost your productivity like never before.Seamless Writing & Research – Effortlessly draft articles, reports, emails, and more with AI assistance.Enhanced Productivity – Save time with AI-powered brainstorming, outlining, and summarization.Improved Writing Quality – Get instant grammar, style, and clarity suggestions.More intelligent Research Tools – Utilize AI to summarize, fact-check, and cite sources efficiently.AI Collaboration & Integration – Work seamlessly with Google Docs and other productivity tools.Optimized AI Prompts – Learn to give AI the proper instructions for precise, high-quality results.This course is designed for students, professionals, bloggers, researchers, educators, and AI enthusiasts who want to enhance their writing with Google Notebook LLM. No prior experience with AI tools is required—just a desire to write more competently and effectively!Why Enroll in This Course?Hands-on tutorials with real-world applications.Easy-to-follow lessons designed for all skill levels.Time-saving techniques to increase your efficiency.A future-proof skill that will keep you ahead in the AI-powered world.By the end of this course, you'll master Google Notebook LLM and transform how you write, research, and create content. Get ready to unlock the full power of AI and take your writing to the next level!I also include a Complete Course Notes Section to supplement your learning and act as a reference tool plus a quiz to test your knowledge.",
    "instructor": "Stuart Wesselby",
    "requirements": [
      "No experience of using Google LLM required"
    ],
    "whatYouWillLearn": [
      "Understand Google Notebook LLM",
      "Navigate the Interface",
      "Generate AI-Powered Content",
      "Enhance Research Capabilities",
      "Improve Writing Quality",
      "Boost Productivity",
      "Collaborate with AI",
      "Optimize AI Outputs"
    ],
    "content": [
      {
        "title": "Introduction",
        "subsections": [
          "Introduction To The CoursePreview03:32",
          "What is Google Notebook LLMPreview01:25",
          "Key Features and BenefitsPreview02:45",
          "Use Cases for Various ProfessionalsPreview03:24"
        ]
      },
      {
        "title": "GETTING STARTED WITH GOOGLE LLM",
        "subsections": [
          "Setting Up Your Account02:37",
          "Mastering the Google LLM Interface02:45",
          "Understanding the Dashboard02:28"
        ]
      },
      {
        "title": "CRAFTING EFFECTIVE PROMPTS",
        "subsections": [
          "Types of Prompts and Their Uses03:52",
          "Writing Clear and Concise Prompts03:05",
          "Examples of Effective Prompting03:14"
        ]
      },
      {
        "title": "EXPLORE THE WRITING MODES",
        "subsections": [
          "Overview of Different Writing Modes04:35",
          "Choosing the Right Mode for Your Task03:03",
          "Customising Writing Modes to Your Need03:02"
        ]
      },
      {
        "title": "LEVERAGING AI FOR RESEARCH",
        "subsections": [
          "Conducting Effective Research with LLM03:06",
          "Sourcing Reliable Information03:25",
          "Integrating External Sources03:43"
        ]
      },
      {
        "title": "EDITING AND REFINING YOUR CONTENT",
        "subsections": [
          "Tools for Editing within Google Notebook LLM02:49",
          "Best Practices for Content Refinement02:43",
          "Collaborating with Others on Edits03:58"
        ]
      },
      {
        "title": "ENHANCING CREATIVITY WITH GOOGLE NOTEBOOK LLM",
        "subsections": [
          "Brainstorming Ideas using LLM04:20",
          "Overcoming Writer's Block03:08",
          "Generating Unique Content03:33"
        ]
      },
      {
        "title": "FORMATTING AND STRUCTURING DOCUMENTS.",
        "subsections": [
          "Common Formatting Options03:27",
          "Organizing Your Content for Clarity03:23",
          "Advanced Structuring Techniques02:50"
        ]
      },
      {
        "title": "COLLABORATION & SHARING FEATURES",
        "subsections": [
          "Inviting Collaborators to Your Projects02:09",
          "Real-Time Collaboration Tools03:17",
          "Sharing Your Work with Others03:32"
        ]
      },
      {
        "title": "UNDERSTANDING AI ETHICS AND GUIDELINES",
        "subsections": [
          "Importance of Ethical AI Use03:16",
          "Understanding Privacy Concerns02:50",
          "Best Practices for Responsible Use03:00"
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/6425739_17a0.jpg",
    "category":"communications"
  },
  {
    "id":"95",
    "title": "Secrets to Fast Coaching Results: Solution-Focused Approach",
    "price": "Current priceE£599.99",
    "description": "Stop Wasting Time on Problems – Start Focusing on Solutions!Are you ready to stop dwelling on problems and start creating results? Whether you're leading a team, working as part of one, or striving for personal growth, the Solution-Focused Coaching Course is your ticket to achieving meaningful outcomes.Why Solution-Focused Coaching?With a head full of problems, you’ll never move forward. This course flips the script: Instead of endless analysis and the never-ending \"why,\" you'll learn how to shift straight into solution mode. It’s all about driving positive change – faster and more sustainably than you ever thought possible. Whether you want to motivate your team or achieve personal milestones, this course is the key.What You'll Gain:1. Practical Tools You Can Use ImmediatelyFrom day one, you’ll dive straight into hands-on techniques. Forget dry theory – this course is all about actionable steps that help you inspire others and deliver results.2. Proven Solution-Focused TechniquesMaster tools like the Miracle Question, Scaling Questions, and Resource Questions. These are more than buzzwords – they’re practical methods for steering conversations towards progress and bringing out the best in your team (or yourself).3. Hands-On Practice for Real-World ImpactTalking isn’t enough – you’ll practice! With realistic exercises you can apply directly to real-life situations, you’ll develop the skills to shine in every conversation. Whether it’s with colleagues, friends, or your team, your coaching abilities will hit the next level.Who Is This Course For?For Leaders:If you’re tired of endless problem-solving discussions and want to inspire your team with solution-focused conversations, this course is a must. You’ll learn how to drive real change in your meetings and workshops. Plus, your colleagues will follow your lead when they see the results you deliver.For Team Members:Are you ready to turn frustrating meetings into productive ones? Learn how to encourage participation and leave every session feeling like you’ve made progress. This course will help you strengthen your team dynamics and transform yourself into a valuable game-changer.Ready to Start Finding Solutions?Sign up now and take the first step toward achieving success, clarity, and real results!Don't just talk about problems – create solutions. Enroll today!",
    "instructor": "Matthias Breuel",
    "requirements": [
      "No prior experience required! This course is designed for anyone interested in learning Solution-Focused Coaching and the Techniques."
    ],
    "whatYouWillLearn": [
      "Master and apply the Solution-Focused Coaching approach to your practice",
      "Adopt a solution-oriented mindset instead of problem-focused thinking, and help others do the same",
      "Use targeted questioning techniques to find solutions more efficiently",
      "Structure and conduct effective coaching sessions according to best practices",
      "Properly define and establish desired outcomes for (coaching) conversations",
      "Apply the core principles of solution-focused coaching in practice",
      "Continuously improve questioning techniques in every coaching conversation"
    ],
    "content": [
      {
        "title": "Introduction to the Solution-Focused Approach",
        "subsections": [
          {
            "title":"Introduction - What you will learn in this coursePreview",
            "time":"00:58",
            "url":""
          }
        ]
      },
      {
        "title": "The art of the solution-focused conversation",
        "subsections": [
          {
            "title":"How to steer the conversation in the positive or negative direction...Preview",
            "time":"00:58",
            "url":"https://www.youtube.com/watch?v=iJztkfAupc0&pp=ygVNSG93IHRvIHN0ZWVyIHRoZSBjb252ZXJzYXRpb24gaW4gdGhlIHBvc2l0aXZlIG9yIG5lZ2F0aXZlIGRpcmVjdGlvbi4uLlByZXZpZXc%3D"
          }
        ]
      },
      {
        "title": "The basic principles of the Solution Focused approach",
        "subsections": [
          {
            "title":"The basic principles at a glancePreview",
            "time":"00:29",
            "url":"https://www.youtube.com/watch?v=f7uC1iNsfkg&pp=ygU4SW50cm9kdWN0aW9uIC0gV2hhdCB5b3Ugd2lsbCBsZWFybiBpbiB0aGlzIGNvdXJzZVByZXZpZXc%3D"
          }
        ]
      },
      {
        "title": "1. Techniques of the Solution-Focused Approach - Room 1: Ticket Shop",
        "subsections": [
          {
            "title":"The ticket shop: What is the desired result?",
            "time":"01:02",
            "url":"https://www.youtube.com/watch?v=oNPDH5sJhRQ&pp=ygUdOiBXaGF0IGlzIHRoZSBkZXNpcmVkIHJlc3VsdD8%3D"
          }
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/6338423_9e21_6.jpg",
    "category":"communications"
  },
  {
    "id":"96",
    "title": "Confident English: Use Proven Tactics for Great Success",
    "price": "Price not found",
    "description": "Want to stop worrying about how you talk? Ready to increase your confidence so you use the English language well? Imagine doing well in meetings, closing a sale, or even giving a speech! Learn the skills that course creator Tom Marcoux has taught for over 17 years to international students in at Stanford University, Sofia University and California State University - Chico. Tom Marcoux is known as the Communication Sage and Spoken Word Strategist. He has taught these skills from stages in Silicon Valley, CA, New York, Thailand, New Zealand, and more. Now is your time to shine. Learn how to:* Shine with your personal brand* Get people to easily say YES to you* Be assertive and get what you want* Eliminate fear because you know \"Recovery Methods\" that save conversations!* Create real connections that lead to real success and happinessThis course includes \"workshop\" sections that help you practice your new skills.This course is built on real-world experience, the book Confident English and 48 additional books authored by course creator Tom Marcoux.Discover how you can increase your personal power--and even develop a new sense of ease.You will learn skills that elevate your Confidence and Charisma.Enroll now in this life-changing course.",
    "instructor": "Tom Marcoux",
    "requirements": [
      "Paper and pen -- or device -- for your notes"
    ],
    "whatYouWillLearn": [
      "Stop worrying about how you talk",
      "Use English to Make Great Connections",
      "Get what you want through Persuasion Skills",
      "Shine at your best in Job Interviews",
      "Be Assertive and Effective",
      "Make Yourself Memorable and Attractive through Your Personal Brand",
      "Eliminate fear because you know \"Recovery Methods\" that save conversations!",
      "Create real connections that lead to real success and happiness"
    ],
    "content": [
      {
        "title": "Introduction",
        "subsections": [

          {
            "title": "Introduction",
            "time":"02:25",
            "url":"https://www.youtube.com/shorts/S0Z0D3bMxuU"
          }
        ]
      },
      {
        "title": "10 Best Practices for Email Deliverability",
        "subsections": [

            {
              "title":"SPAM Trigger Words",
              "time":"02:06",
              "url":"https://www.youtube.com/watch?v=wvAWyeqiql4&pp=ygUnU1BBTSBUcmlnZ2VyIFdvcmRzIGNvbW11bmljYXRpb24gY291cnNl"
            }
        ]
      },
      {
        "title": "13 Ways to Minimize SPAM Complaints",
        "subsections": [

          {
            "title":"Protecting Your IP Address",
            "time":"05:44",
            "url":"https://www.youtube.com/watch?v=--onbg-jHqQ&pp=ygUvUHJvdGVjdGluZyBZb3VyIElQIEFkZHJlc3MgY29tbXVuaWNhdGlvbiBjb3Vyc2U%3D"
          }
        ]
      },
      {
        "title": "Gowing Email Marketing",
        "subsections": [
          {
            "title":"Email Marketing",
            "time":"01:05",
            "url":"https://www.youtube.com/shorts/ReOyGeTHwfE"
          }
        ]
      },
      {
        "title": "Summary and Thank You!",
        "subsections": [

        {
          "title":"Summary and Thank you!",
          "time":"01:43",
          "url":"https://www.youtube.com/watch?v=--onbg-jHqQ&pp=ygUvUHJvdGVjdGluZyBZb3VyIElQIEFkZHJlc3MgY29tbXVuaWNhdGlvbiBjb3Vyc2U%3D"
        }
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/4929092_6b3c.jpg",
    "category":"communications"
  },
  {
    "id":"97",  
    "title": "Viva Connections Essentials",
    "price": "Current priceE£399.99",
    "description": "Learn how to use Microsoft Viva Connections to create a centralized hub where your employees can stay connected and access valuable organizational information and resources.In Viva Connections Essentials, Microsoft certified trainer Tim Blake demonstrates how to use the Viva Connections app to foster communication and engagement within your organization. He explains how the three main components of Viva Connections operate and shows how to create cards for the Dashboard, display Resources, and add Resource links.As Tim walks you through the steps, you’ll learn how to access and navigate Viva Connections and how to plan for and configure your site. Next, you’ll learn how to build a Dashboard and ways to influence the Feed. Finally, you’ll learn useful strategies for preparing to launch, including practices that can help your team adapt to using the app.Join us to learn how your organization can benefit from utilizing Viva Connections!Topics covered include:Accessing Viva Connections from TeamsDescribing the three main components and their functionsPlanning content based on a needs assessmentReviewing requirements and prerequisites for set upConfiguring the Viva Connections experienceCreating and modifying cards on the DashboardSetting up Resource linksBuilding Feed contentDeveloping a launch strategyMonitoring site usage metricsEnjoy high-quality HD content in the “Uniquely Engaging”TM Bigger Brains Teacher-Learner style!",
    "instructor": "Bigger Brains",
    "requirements": [
      "Anyone can learn this course"
    ],
    "whatYouWillLearn": [
      "Access Viva Connections from Teams",
      "Describe the three main components and their functions",
      "Plan content based on a needs assessment",
      "Review requirements and prerequisites for set up",
      "Configure the Viva Connections experience",
      "Create and modify cards on the Dashboard",
      "Set up Resource links",
      "Build Feed content",
      "Develop a launch strategy",
      "Monitor site usage metrics"
    ],
   "content": [
      {
        "title": "Module 1 - Introduction To The Course",
        "subsections": [
          {
            "title":"Course VideosPreview",
            "time":"1:30",
            "url":"https://www.youtube.com/watch?v=UGFfEchk7nc&pp=ygUyICBDb3Vyc2UgVmlkZW9zUHJldmlldyBjb21tdW5pY2F0aW9uIHNraWxscyBjb3Vyc2U%3D"
          }
        ]
      },
      {
        "title": "Module 2 - Mindset Adjustment",
        "subsections": [

          {
            "title":"Mindset AdjustmentPreview",
            "time":"1:57",
            "url":"https://www.youtube.com/watch?v=LI57EB_T38c&pp=ygU3ICBNaW5kc2V0IEFkanVzdG1lbnRQcmV2aWV3IGNvbW11bmljYXRpb24gc2tpbGxzIGNvdXJzZQ%3D%3D"
          }
        ]
      },
      {
        "title": "Module 3 - Key Power Influencers",
        "subsections": [
          {
           "title":"Power Influencers",
            "time": "04:09",
            "url":"https://www.youtube.com/watch?v=Fnt6P7Rnho8&pp=ygUvICBQb3dlciBJbmZsdWVuY2VycyBjb21tdW5pY2F0aW9uIHNraWxscyBjb3Vyc2U%3D"
          }
         
        ]
      },
      {
        "title": "Module 4 - The Power Of Appearance",
        "subsections": [
          {
            "title":"Power Of Appearance",
             "time": "01:23",
             "url":"https://www.youtube.com/watch?v=CrnF8YsXD_g&t=17s&pp=ygUWICBQb3dlciBPZiBBcHBlYXJhbmNlIA%3D%3D"
           }
        ]
      },
      {
        "title": "Module 5 - The Power Of Body Language",
        "subsections": [

          {
            "title":"Power Of Body Language",
             "time": "00:53",
             "url":"https://www.youtube.com/watch?v=ergJz5LUAGg&pp=ygUxICBQb3dlciBPZiBBcHBlYXJhbmNlIGNvbW11bmljYXRpb24gc2tpbGxzIGNvdXJzZQ%3D%3D"
           }
        ]
      },
      {
        "title": "Module 6 - The Power Of Words",
        "subsections": [
          {
            "title":"Power Of Words",
             "time": "01:56",
             "url":"https://www.youtube.com/watch?v=Iqq1roF4C8s&pp=ygUsICBQb3dlciBPZiBXb3JkcyBjb21tdW5pY2F0aW9uIHNraWxscyBjb3Vyc2U%3D"
           }
        ]
      },
      {
        "title": "Module 7 - The Art Of Contentment",
        "subsections": [

          {
            "title":"The Art Of Contentment",
             "time": "00:39",
             "url":"https://www.youtube.com/watch?v=wfIhGsoWgGw&pp=ygU0ICBUaGUgQXJ0IE9mIENvbnRlbnRtZW50IGNvbW11bmljYXRpb24gc2tpbGxzIGNvdXJzZQ%3D%3D"
           }
        ]
      },
      {
        "title": "Module 8 - The Art Of Charisma",
        "subsections": [
          {
            "title":"Art Of Charisma",
             "time": "01:16",
             "url":"https://www.youtube.com/watch?v=Ijcnk2OHrhc&pp=ygUSICBBcnQgT2YgQ2hhcmlzbWEg"
           }
        ]
      },
      {
        "title": "Other Important Considerations",
        "subsections": [

          {
            "title":"Art Of Giving Advice",
             "time": "08:57",
             "url":"https://www.youtube.com/watch?v=R4TY5LW3feM&pp=ygUXICBBcnQgT2YgR2l2aW5nIEFkdmljZSA%3D"
           }
        ]
      },
      {
        "title": "Module 10 - Roadmap To Success",
        "subsections": [
          {
            "title":"Conclusions",
             "time": "01:16",
             "url":"https://www.youtube.com/watch?v=Jm6EBTW1JVc&pp=ygUSUm9hZG1hcCBUbyBTdWNjZXNz"
           }
          
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/3910178_c173_2.jpg",
    "category":"communications"
  },
  {
    "id":"100",
    "title": "Learning to collaborate online",
    "price": "Current priceE£399.99",
    "description": "Today's world is about online or virtual collaboration, be it in the workplace, business, schools, or any such environment where people located at different places need to communicate and collaborate virtually. This transition to the online world can be little challenging for people who are not used to working in online mode. Based on our decades of corporate experience in the IT industry (where online collaboration is not new), we understand these challenges and as well as the importance to have effective and productive online collaboration. In this course, we cover aspects and types and modes of communication, need for effective online collaboration, guidelines to get ready for video calls, guidelines for having effective online team meeting (both as presenter as well as a participant), making better use of emails and guidelines for improving presentation skills. This comprehensive course will surely benefit all those who want to make use of the online platform for smooth and effective collaboration be it for business of personal use. To make the course interesting and fun, we have created couple of lessons as animated videos because we believe that learning should be fun as well. We hope you take benefit of this course and apply the learnings in your daily life.Wishing you good luck!",
    "instructor": "spruaa life coaching",
    "requirements": [
      "No prior experience of working online is needed. In fact, it's best if you don't have any, so that you will learn from scratch."
    ],
    "whatYouWillLearn": [
      "Need and importance of online collaboration",
      "Guidelines to prepare for video calls/ meetings",
      "Guidelines for effective team meetings",
      "Guidelines on email usage for effective collaboration",
      "Guidelines to improve presentation skills"
    ],
    "content": [
      {
        "title": "Introduction",
        "subsections": [
          {
            "title":"General Housekeeping",
            "time":"02:03",
            "url":"https://www.youtube.com/watch?v=aYEuRc0vk7U&pp=ygUUR2VuZXJhbCBIb3VzZWtlZXBpbmc%3D"
          }
          
        ]
      },
      {
        "title": "Building Your Career While Utilizing Internal and External Resources",
        "subsections": [
          {
            "title":"Learn about Constructive Criticism, Billing, and Staying ProductivePreview",
            "time":"03:58",
            "url":"https://www.youtube.com/shorts/68N8tyXylrU"
          }
        ]
      },
      {
        "title": "The Core Foundations of Communication",
        "subsections": [
          {
            "title":"Verbal CommunicationPreview",
            "time":"02:01",
            "url":"https://www.youtube.com/watch?v=4_5dayHDdBk&pp=ygUbVmVyYmFsIENvbW11bmljYXRpb25QcmV2aWV3"
          }
        ]
      },
      {
        "title": "Internal and External Resources and What to Expect as a New Lawyer",
        "subsections": [
          {
            "title":"Leveraging Social Media",
            "time":"01:37",
            "url":"https://www.youtube.com/watch?v=9AtpcZv--MA&pp=ygUXTGV2ZXJhZ2luZyBTb2NpYWwgTWVkaWE%3D"
          }
        ]
      },
      {
        "title": "The Basics on Negotiating",
        "subsections": [
          {
            "title":"Proper Negotiation Tactics For Clients",
            "time":"05:45",
            "url":"https://www.youtube.com/watch?v=z3U0FRb9yr4&pp=ygUmUHJvcGVyIE5lZ290aWF0aW9uIFRhY3RpY3MgRm9yIENsaWVudHM%3D"
          }
        ]
      },
      {
        "title": "Your One Year Mark",
        "subsections": [
          {
            "title":"Asking for a Raise",
            "time":"05:29",
            "url":"https://www.youtube.com/watch?v=vGqswpmICP8&pp=ygUSQXNraW5nIGZvciBhIFJhaXNl"
          }
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/4289902_1ef9_3.jpg",
    "category":"communications"
  },
  {
    "id":"101",
    "title": "SUCCESSFUL NEGOTIATION - GENERATE HIGH SALES & WIN,",
    "price": "Current priceE£599.99",
    "description": "Course Description: Mastering Negotiation Through Fun, Role-Play & Real-World Scenarios.Do you find it difficult to negotiate? perhaps in normal life situations or at work? This course will equip you with the planning of  negotiating in a calm, professional and strategic manner, whether it's a sales negotiation, a salary negotiation, buying a house, business contracts or purchasing.Negotiation is a skill that impacts nearly every aspect of life. Whether you're negotiating a salary, closing a business deal, handling a customer complaint, or even deciding where to go on vacation with family, your ability to communicate and persuade can make all the difference. Yet, many people shy away from negotiation, seeing it as intimidating or confrontational. Others rely on instinct, not realizing that strategic negotiation techniques can give them a significant advantage.This course is designed to remove the fear and uncertainty from negotiation and replace it with confidence, strategy, and skill. Unlike traditional courses that focus on dry lectures and complex theories, this program takes a hands-on, interactive approach that makes learning fun, engaging, and immediately useful. Through a mix of animated scenarios, role-playing exercises, and real-world examples, you’ll see firsthand how different negotiation techniques play out in various situations—and most importantly, how to use them to your advantage.Learn by Watching, Doing, and PracticingNegotiation is not a one-size-fits-all skill. Different situations require different approaches, and the key to success is knowing how to adjust your style based on the situation and the person you’re negotiating with. That’s why this course covers the five primary negotiation styles—Competitive, Collaborative, Accommodating, Avoidant, and Compromising—and teaches you when and how to use each effectively.Rather than just reading about these styles, you will see them in action through engaging story-driven animations that bring each strategy to life. You’ll watch animated characters make mistakes and learn from them, as well as see strong negotiation strategies executed successfully. Then, you’ll step into the negotiator’s shoes yourself through role-playing exercises that help you build confidence and refine your skills in a variety of scenarios, such as:Salary negotiations – Learn how to ask for more, handle objections, and confidently secure the compensation you deserve.Business deals – Discover how to create value, overcome resistance, and close agreements that benefit both sides.Customer service challenges – Master de-escalation techniques and learn how to turn conflicts into positive resolutions.Everyday interactions – From negotiating a better price to settling disputes with coworkers, you’ll gain skills that help in daily life.Business competitive negotiations - The hard sale and seeing through false contracts.Compassionate negotiations - When a fair win win is best for the business and customer.What You’ll Experience in This CourseRole-Playing Exercises – Engage in realistic negotiation scenarios where you will practice persuasion, confidence, and strategic thinking.Animated, Story-Based Examples – Watch entertaining and easy-to-follow animations that illustrate negotiation techniques and styles in action.Real-World Applications – Gain strategies you can immediately use in business negotiations, leadership roles, customer interactions, and personal situations.Flexible, Self-Paced Learning – This course is designed for individual learners, allowing you to develop skills through practical, hands-on exercises without group discussions or quizzes.Why This Course WorksMany people believe that negotiation is only for business executives or high-powered salespeople, but the truth is, negotiation is a life skill that benefits everyone. When you learn how to negotiate effectively, you can:Achieve better outcomes in both professional and personal situations.Gain confidence in high-pressure conversations.Read the other party’s style and adapt accordingly.Strengthen relationships by negotiating in a way that builds trust and respect.By the end of this course, you will no longer feel uncertain or unprepared when faced with a negotiation. Instead, you will understand the dynamics at play, recognize the best strategy to use, and confidently lead negotiations toward successful outcomes.This is not just another negotiation course—it’s a transformative, immersive learning experience designed to make you a stronger, more confident negotiator. Are you ready to develop one of the most valuable skills for success in business and life? Let’s get started..",
    "instructor": "Susan Stolworthy",
    "requirements": [
      "NO REQUIREMENTS"
    ],
    "whatYouWillLearn": [
      "INTRODUCTION AND  SALARY INCREASE NEGOTIATIONS",
      "QUIZ - SALARY NEGOTIATION QUIZ",
      "NEGOTIATION SALARY AT TIME OF JOB OFFER",
      "QUIZ - UNDERSTANDING THE BATNA QUIZ",
      "DISTRIBUTIVE & INTEGRATIVE NEGOTIATION",
      "QUIZ - DISTRIBUTIVE & INTERGRATIVE NEGOTIATION QUIZ",
      "COMPETITIVE NEGOTIATIONS",
      "QUIZ - COMPETTIVE NEGOTIATIONS QUIZ",
      "AVOIDANT & ACCOMMODATING NEGOTIATION",
      "QUIZ - AVOIDANT & ACCOMMODATING QUIZ",
      "ACTIVE LISTENING",
      "QUIZ - ACTIVE LISTENING QUIZ",
      "ASKING THE RIGHT QUESTIONS",
      "QUIZ - ASKING THE RIGHT QUESTIONS",
      "HOW TO SPOT LYING",
      "QUIZ - HOW TO SPOT A LIAR",
      "BUILDING RELATIONSHIPS",
      "QUIZ - BUILDING RAPPORT"
    ],
    "content": [
      {
        "title": "Introduction and overview",
        "subsections": [
          {
            "title":"Why change communications matters more than everPreview",
            "time":"2:52",
            "url":"https://www.youtube.com/watch?v=7Rt8sgt7gNE&pp=ygVMV2h5IGNoYW5nZSBjb21tdW5pY2F0aW9ucyBtYXR0ZXJzIG1vcmUgdGhhbiBldmVyUHJldmlldyJjb21tdW5pY2F0aU9uIGNvdXJzZQ%3D%3D"
          }
          
        ]
      },
      {
        "title": "Phase 1: Hear it - the first phase of our staggered approach to change comms",
        "subsections": [
          {
            "title":"Cutting through the noise",
            "time":"04:46",
            "url":"https://www.youtube.com/watch?v=UkcxKXBWio0&pp=ygUuQ3V0dGluZyB0aHJvdWdoIHRoZSBub2lzZSBjb21tdW5pY2F0aU9uIGNvdXJzZdIHCQl-CQGHKiGM7w%3D%3D"
          }
         
          
        ]
      },
      {
        "title": "Feel it - the second phase of our staggered approach to change comms",
        "subsections": [
          {
            "title":"From head to haert",
            "time":"4:49",
            "url":"https://www.youtube.com/watch?v=QGeHS4jO0X0&pp=ygUnRnJvbSBoZWFkIHRvIGhhZXJ0IGNvbW11bmljYXRpb24gY291cnNl"
          }
          
          
        ]
      },
      {
        "title": "Understand it - the third phase of our staggered approach to change comms",
        "subsections": [
          {
            "title":"Building understanding through layered messaging",
            "time":"4:56",
            "url":"https://www.youtube.com/watch?v=Q8SFYo1nmrQ&pp=ygVFQnVpbGRpbmcgdW5kZXJzdGFuZGluZyB0aHJvdWdoIGxheWVyZWQgbWVzc2FnaW5nIGNvbW11bmljYXRpb24gY291cnNl"
          }
        ]
      },
      {
        "title": "Do it - the fourth phase of our staggered approach to change comms",
        "subsections": [
          {
            "title":"Turning communications into behaviour",
            "time":"4:40",
            "url":"https://www.youtube.com/watch?v=hAxCpAnV3-E&pp=ygU6VHVybmluZyBjb21tdW5pY2F0aW9ucyBpbnRvIGJlaGF2aW91ciBjb21tdW5pY2F0aW9uIGNvdXJzZQ%3D%3D"
          }
        ]
      },
      {
        "title": "Live it - the final phase of our staggered approach to change comms",
        "subsections": [
          {
            "title":"Sustaining the conversation",
            "time":"4:11",
            "url":"https://www.youtube.com/watch?v=0g1r7v2xX4E&pp=ygUjU3VzdGFpbmluZyB0aGUgY29udmVyc2F0aW9uIGNvbW11bmljYXRpb24gY291cnNl"
          }
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/6372359_248f_7.jpg",
    "category":"communications"
  },
  {
    "id":"102",
    "title": "Giving and Receiving Feedback with Emotional Intelligence",
    "price": "Current priceE£599.99",
    "description": "Effective feedback is a vital component of personal and professional growth.  By understanding the importance of emotional intelligence and applying it to feedback interactions, you can build, grow and develop stronger relationships, enhance performance, and bring about positive change.This course was itself created from feedback received around my other emotional intelligence courses on Udemy!  Building on positive feedback, and incorporating learning from constructive criticism, I am delighted to be able to offer this full course focused on the art of giving and receiving feedback with emotional intelligence.In this course, you will learn to:Master the fundamentals of feedback: Explore the importance of feedback in personal and professional development, and understand the key components of effective feedback.Apply effective feedback techniques: Learn practical strategies for delivering constructive feedback, both positive and negative, in ways that are clear, specific, and actionable.Use the power of emotional intelligence: Discover how emotional intelligence can significantly impact the delivery and reception of feedback. Learn to identify and manage your own emotions, as well as empathise with others to support effective feedback leading to more satisfying interactions.Integrate emotional intelligence into feedback: Apply emotional intelligence principles to your feedback practices that supports a culture of open communication, trust, and mutual respect.Evaluate the impact of feedback: Assess the effectiveness of your feedback strategies and learn how to measure the outcomes and impact of your feedback efforts.By the end of this course, you will be equipped with the knowledge and skills to give and receive feedback with confidence, empathy, and effectiveness.In addition to the videos and quizzes, the course includes a practical activity around working with feedback and set of downloadable Lightbulb Moments resource cards. These cards are designed to be printed and used as a personal reference tool outside of the course.  They are an essential component that offer valuable reminders to enhance your learning experience.Enroll now to develop your emotional intelligence and enhance your feedback skills that will enhance your relationships and interactions in the workplace. All videos are recorded in High Definition 1080p.All PDFs can be completed online and are Section 508 / ADA Accessibility compliant.All videos have grammatically correct English captions.Latest update - April 2025",
    "instructor": "Robin Hills",
    "requirements": [
      "Anyone interested in learning more about emotional intelligence and how it applies to giving and receiving feedback.",
      "Anyone with a willingness to learn new perspectives and new approaches to feedback.",
      "Anyone with an interest in applying their intelligence to their emotion.",
      "Some basic understanding of your own emotions and how they influence your interactions with others will be beneficial.",
      "Anyone with a willingness to examine their own behaviour and identify areas for improvement."
    ],
    "whatYouWillLearn": [
      "Explain the importance of feedback in personal and professional development",
      "Apply effective feedback techniques in various interpersonal situations",
      "Analyse the impact of emotional intelligence on the delivery of feedback and how it is received",
      "Integrate emotional intelligence principles into feedback to effect positive change",
      "Evaluate the effectiveness of feedback strategies based on outcomes and impact"
    ],
    "content": [
      {
        "title": "Introduction",
        "subsections": [

          {
            "title": "Introduction",
            "time":"02:25",
            "url":"https://www.youtube.com/shorts/S0Z0D3bMxuU"
          }
        ]
      },
      {
        "title": "10 Best Practices for Email Deliverability",
        "subsections": [

            {
              "title":"SPAM Trigger Words",
              "time":"02:06",
              "url":"https://www.youtube.com/watch?v=wvAWyeqiql4&pp=ygUnU1BBTSBUcmlnZ2VyIFdvcmRzIGNvbW11bmljYXRpb24gY291cnNl"
            }
        ]
      },
      {
        "title": "13 Ways to Minimize SPAM Complaints",
        "subsections": [

          {
            "title":"Protecting Your IP Address",
            "time":"05:44",
            "url":"https://www.youtube.com/watch?v=--onbg-jHqQ&pp=ygUvUHJvdGVjdGluZyBZb3VyIElQIEFkZHJlc3MgY29tbXVuaWNhdGlvbiBjb3Vyc2U%3D"
          }
        ]
      },
      {
        "title": "Gowing Email Marketing",
        "subsections": [
          {
            "title":"Email Marketing",
            "time":"01:05",
            "url":"https://www.youtube.com/shorts/ReOyGeTHwfE"
          }
        ]
      },
      {
        "title": "Summary and Thank You!",
        "subsections": [

        {
          "title":"Summary and Thank you!",
          "time":"01:43",
          "url":"https://www.youtube.com/watch?v=--onbg-jHqQ&pp=ygUvUHJvdGVjdGluZyBZb3VyIElQIEFkZHJlc3MgY29tbXVuaWNhdGlvbiBjb3Vyc2U%3D"
        }
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/6252553_590e_3.jpg",
    "category":"communications"
  },
  {
    "id":"103",
    "title": "Communicating Effectively with Engineers",
    "price": "Current priceE£399.99",
    "description": "Research has shown that the #1 trait that distinguishes high performing teams is excellent communications.If you are someone who interacts regularly with engineering or technical teams – someone in marketing, sales, customer service, management, etc. - and you would like to understand a bit more about how engineers work and the most effective way to communicate and help them excel, this video series is for you!In this program, I’m going show you how you can create better communications with your engineering team and seamlessly work together to successfully complete your projects and build strong, productive, and hopefully enjoyable relationships.Experienced engineers are usually highly paid and in-demand staff members who are very likely critical to the success of your organization. Understanding what your technical team does, and how they like to work and communicate can help you help them be more effective, engaged, creative and happy.Watch this video series and you’ll learn:1) How to implement the communication styles of high performing teams2) How and when to involve your engineering team and other stakeholders in the project planning3) How to improve your Active Listening skills4) How to create and communicate requirements documents and the critical importance of the “M” in SMART goals5) How to modernize and run successful, effective brainstorming sessions6) How to use the 3 critical project variables to manage project changes and “scope creep”7) How to utilize effective status reports, meetings, and continuous improvement8) How to maximize engineering creativity and productivityAlthough the information in these videos is especially helpful for honing your communications with engineers and other technical staff, it will help you create effective communications and build successful professional relationships with just about anyone in any line of work.",
    "instructor": "Alfred Lee",
    "requirements": [
      "No previous experience needed, but intended for workplace environments"
    ],
    "whatYouWillLearn": [
      "Develop a communication style that maximizes engineering productivity",
      "Learn how and when to involve your engineering team in your project",
      "Learn how to effectively develop and communicate project requirements to streamline the development process",
      "Learn how to boost the creativity of your engineers and create a culture of continuous improvement"
    ],
    "content": [
      {
        "title": "Introduction",
        "subsections": [
          {
            "title":"Instructor Introduction and Course OverviewPreview",
            "time":"02:14",
            "url":"https://www.youtube.com/watch?v=KwSVPS_ugL0&pp=ygUySW5zdHJ1Y3RvciBJbnRyb2R1Y3Rpb24gYW5kIENvdXJzZSBPdmVydmlld1ByZXZpZXc%3D"
          }
        ]
      },
      {
        "title": "Communicating Effectively with Engineers",
        "subsections": [
          {
            "title":"Communications are CriticalPreview",
            "time":"04:47",
            "url":"https://www.youtube.com/watch?v=5m_u-GSvkPE&pp=ygUiQ29tbXVuaWNhdGlvbnMgYXJlIENyaXRpY2FsUHJldmlldw%3D%3D"
          }
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/5404224_9739.jpg",
    "category":"communications"
  },
  {
    "id":"104",
    "title": "Write That Novel!",
    "price": "Current priceE£399.99",
    "description": "In this Udemy course, Write That Novel!, learn secrets to construct a solid story.  Understand how to structure it, incorporate theme, and liven up the plot and characters. Bonus: learn how to present stories effectively. There’s no question, knowledge is power. And sometimes, the quickest way to your dream is actually easier than thought. But it's essential to have that information and learn well in the first place, to build a solid foundation instead of writing yourself  towards dead ends. You don't want to take months to write a first draft of a novel and discover it's riddled with inconsistencies, lack of vision, or plot holes. You want to do a good job the first time around. Theme is an essential factor when writing out a story, and something beginning writers tend to overlook or tack on at the end. This course shows you where and how to use it to your advantage. With valuable insights and inside information, it stops writer's block in its tracks by giving you shortcuts to unlock your mind and creative vision. Be inspired on your journey and open yourself up to the stories all around you. Invest in yourself, write out that story, and take action towards your goals. Become the main character of your life, and make your own dreams come true. Become a Story Plottr.",
    "instructor": "Story Plottr",
    "requirements": [
      "Openness to learn and have an open mind"
    ],
    "whatYouWillLearn": [
      "How to write a solid story",
      "How to structure a story",
      "How to research",
      "How to plan out your story (and life!)",
      "How to shift your mind towards more positive thinking",
      "Be inspired to beat writer's block",
      "6 super fun fillable worksheets that aid learning!"
    ],
    "content": [
      {
        "title": "When life imitates art",
        "subsections": [
          {
            "title":"The hero's journeyPreview",
            "time":"02:48",
            "url":""
          }
        ]
      },
      {
        "title": "Write that novel!",
        "subsections": [
          {
            "title":"Where to find storiesPreview",
            "time":"02:31",
            "url":"https://www.youtube.com/watch?v=yQkMl4Xrg68&pp=ygUcV2hlcmUgdG8gZmluZCBzdG9yaWVzUHJldmlldw%3D%3D"
          }
        ]
      },
      {
        "title": "Make your writing dreams come true!",
        "subsections": [
          {
            "title":"Be the writer of your own life!Preview",
            "time":"02:41",
            "url":"https://www.youtube.com/shorts/mMWDf3uNhno"
          }
        ]
      },
      {
        "title": "Bonus",
        "subsections": [
          {
            "title":"How to perform for an audience",
            "time":"02:25",
            "url":"https://www.youtube.com/watch?v=4IG-8P7refs&pp=ygUeSG93IHRvIHBlcmZvcm0gZm9yIGFuIGF1ZGllbmNl"
          }
          
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/5700502_0ae0.jpg",
    "category":"communications"
  },
  {
    "id":"105",
    "title": "Turning Japanese; Language, Culture & Biz tips - Beginner 2",
    "price": "Current priceE£399.99",
    "description": "I have been teaching this course in the corporate environment for the past 17 years, and students are always amazed by how intuitive, simple, and fun learning Japanese can be.  I borrow from the methods I learned from over 20 years ago when I was called as missionary to Japan for 2 years.  Since that time I have lived in Japan a total of 3 years, and have interacted with Japanese customers and colleague for 20+ years in global business. I keep my course fun, engaging, and \"sticky\"...so that the learnings build on each other and stay with you through fun methods. There is no prerequisite for prior Japanese experience, just a desire to have fun and work hard.  Although this is part 2 of a 3 course series, so the 1st course is recommended.  All of the course materials are built into the presentation slide deck. The course is designed for those who are new to Japanese or who would like to take a refresher course learning in an all new style of learning;Japanese language: move from beginner to intermediate by utilizing unique methods I call the Japanese study \"cheat code\".  In particular Japanese conjugation is made simple through a unique method rarely taught in other Japanese language courses.Japanese speaking: the class encourages learning Japanese systematically so that each student can build sentences on their own by the end of the course. Building sentences will feel much like building lego structures.Japanese Culture Training: Each section includes cultural keys to success and things to avoid from a Western perspective. I share many personal experiences which bring the culture tips to life.Japanese Biz tips: Pulling from 20+ working with Japanese customers in global business, I transfer this knowledge to each student.  Students will feel more confident and successful as they start to utilize these business secrets to success.Japanese “Headturners”: each section concludes with a high level, impressive Japanese phrases students can use to impress their Japanese friends.  These phrases include formal sayings, slang, and colloquial which can be used to turn heads from day 1.",
    "instructor": "David Owen",
    "requirements": [
      "Complete the Course 1 of the class; Turning Japanese; Language, Culture & Biz tips - Beginner 1",
      "Students looking to learn Japanese in a completely different way are welcome to join as well"
    ],
    "whatYouWillLearn": [
      "Japanese language: move from beginner to intermediate by utilizing unique methods I call the Japanese study \"cheat code\" (particular Japanese conjugation)",
      "Japanese speaking: the class encourages learning Japanese systematically so that each student can build sentences on their own by the end of the course.",
      "Japanese Culture Training: Each section includes cultural keys to success and things to avoid from a Western perspective.",
      "Japanese Biz tips: Pulling from 20+ years working with Japanese customers in global business, I transfer this knowledge to each student."
    ],
    "content": [
      {
        "title": "Introduction",
        "subsections": [
          "1. 1 Course IntroductionPreview02:23",
          "1.2 Culture & Biz Tips02:17",
          "1.3 Verb Formulas Review07:27",
          "1.4 \"Want to do\" Verb formula01:24",
          "1.5 Particle \"no\"01:37",
          "1.6 Summary & Headturner01:09"
        ]
      },
      {
        "title": "The Desu Box & \"Let's do\" formula",
        "subsections": [
          "2.1 IntroductionPreview00:27",
          "2.2 Culture & Biz TipPreview01:45",
          "2.3 Verb Formula use practicePreview03:27",
          "2.4 Particle \"de\"Preview01:25",
          "2.5 Desu Box04:34",
          "2.6 \"Let's do\" formula01:55",
          "2.7 Summary & Headturner01:04"
        ]
      },
      {
        "title": "\"When I do\" & \"Before I do\" Verb Formulas",
        "subsections": [
          {
            "title":" Particle \"mo\"",
            "time":"01:21",
            "url":"https://www.youtube.com/watch?v=T_PNna6BIDc&pp=ygUSQ3VsdHVyZSAmIEJpeiBUaXBz"
          }
        ]
      },
      {
        "title": "\"Hard to do\"/\"Easy to do\" Verb formulas",
        "subsections": [
          {
            "title":"Culture & Biz Tips",
            "time":"04:24",
            "url":"https://www.youtube.com/watch?v=T_PNna6BIDc&pp=ygUSQ3VsdHVyZSAmIEJpeiBUaXBz"
          }
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/5329890_9ef8_2.jpg",
    "category":"communications"
  },
  {
    "id":"106",
    "title": "Communication and Conflict Management Mastercourse",
    "price": "Price not found",
    "description": "Course SynopsisStruggling with tough conversations at work? Want to handle conflicts like a pro? This high-impact mastercourse—designed and delivered by expert mediators—gives you the ultimate toolkit to master communication and navigate workplace disputes with confidence. This mastercourse provides a deep dive into the essential soft skills needed to resolve high-stakes disputes with confidence and clarity. Harness emotional intelligence, empathy, creativity, and critical thinking to take control of any conversation, defuse tensions, and turn conflicts into opportunities. Whether you’re leading a team, managing clients, or handling high-stakes negotiations, this course will give you the edge you need to communicate with clarity, resolve disputes effectively, and build stronger professional relationships. As future modules are developed and added to this course, you will continually gain additional tools to supercharge your communication and conflict resolution skills, making you unstoppable in any workplace challenge.Learning ObjectivesBy the end of this mastercourse, you will be able to:Apply emotional intelligence to improve communication and decision-making.Use empathy to foster trust and defuse tense interactions.Develop creative and critical thinking strategies to navigate complex disputes.Build resilience to maintain composure in high-pressure negotiations.Strengthen active listening skills for deeper engagement and understanding.Implement professional mediation techniques to resolve conflicts effectively.TrainerThis mastercourse is designed and delivered by Peacemakers Consulting Services. Peacemakers consists of professional mediators with years of experience handling high-stakes disputes across industries. Our trainers have worked in corporate, legal, and organisational settings, guiding leaders, teams, and professionals through complex negotiations and workplace conflicts. They bring real-world expertise, proven conflict resolution strategies, and deep insights into human behaviour to help you master the art of communication. With a hands-on, practical approach, they’ll equip you with the skills to navigate difficult conversations, build trust, and resolve disputes with confidence and professionalism.Who should attend?Professionals looking to enhance their communication and conflict resolution skills.Mediators seeking advanced techniques to handle high-stakes disputes.Leaders, managers, and HR professionals navigating workplace conflicts.Lawyers, negotiators, and consultants involved in dispute resolution.Customer service and client-facing professionals managing difficult conversations.Anyone interested in mastering communication skills for personal and professional growth.Educational ApproachCombination of short but informative lectures and quizzes for review Use of real-world research data and case studiesPrerequisitesNo prior professional qualifications are required",
    "instructor": "Peacemakers Consulting Services",
    "requirements": [
      "No prior professional experience needed"
    ],
    "whatYouWillLearn": [
      "Apply emotional intelligence to improve communication and decision-making.",
      "Use empathy to foster trust and defuse tense interactions.",
      "Develop creative and critical thinking strategies to navigate complex disputes.",
      "Build resilience to maintain composure in high-pressure negotiations.",
      "Strengthen active listening skills for deeper engagement and understanding.",
      "Implement professional mediation techniques to resolve conflicts effectively."
    ],
    "content": [
      {
        "title": "Introduction to the Solution-Focused Approach",
        "subsections": [
          {
            "title":"Introduction - What you will learn in this coursePreview",
            "time":"00:58",
            "url":""
          }
        ]
      },
      {
        "title": "The art of the solution-focused conversation",
        "subsections": [
          {
            "title":"How to steer the conversation in the positive or negative direction...Preview",
            "time":"00:58",
            "url":"https://www.youtube.com/watch?v=iJztkfAupc0&pp=ygVNSG93IHRvIHN0ZWVyIHRoZSBjb252ZXJzYXRpb24gaW4gdGhlIHBvc2l0aXZlIG9yIG5lZ2F0aXZlIGRpcmVjdGlvbi4uLlByZXZpZXc%3D"
          }
        ]
      },
      {
        "title": "The basic principles of the Solution Focused approach",
        "subsections": [
          {
            "title":"The basic principles at a glancePreview",
            "time":"00:29",
            "url":"https://www.youtube.com/watch?v=f7uC1iNsfkg&pp=ygU4SW50cm9kdWN0aW9uIC0gV2hhdCB5b3Ugd2lsbCBsZWFybiBpbiB0aGlzIGNvdXJzZVByZXZpZXc%3D"
          }
        ]
      },
      {
        "title": "1. Techniques of the Solution-Focused Approach - Room 1: Ticket Shop",
        "subsections": [
          {
            "title":"The ticket shop: What is the desired result?",
            "time":"01:02",
            "url":"https://www.youtube.com/watch?v=oNPDH5sJhRQ&pp=ygUdOiBXaGF0IGlzIHRoZSBkZXNpcmVkIHJlc3VsdD8%3D"
          }
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/6515675_b2fc.jpg",
    "category":"communications"
  },
  {
    "id":"107",
    "title": "Unspoken Rules of Business Email to Boost Your Career",
    "price": "Current priceE£399.99",
    "description": "The nature of this course is to teach how to read the tone of a message and how to interpret between the lines like a native speaker would. WARNING: this is not a course where we only teach standard phrases but rather an advanced level course that will help you communicate more like a local, including but not limited to soften your tone when you try to reject a request, be diplomatic when it is a tricky situation and understand when people are challenging you and criticize you in a subtle way. Communication is not just to get the message across but to do so in a culturally appropriate and elegant manner. STOP using basic communication and boost your career by mastering the art of nuanced email communication just like how you do in your native language. Unlock the secrets to effective and sophisticated interactions that will set you apart in the ever more competitive professional world.Love them or hate them Emails are not going anywhereAs of 2023, it's estimated that over 300 billion emails are sent daily worldwide. (Source: Statista)In 2023, there were approximately 4.6 billion email users worldwide, a number expected to grow to over 4.9 billion by 2025. (Source: Statista)So we have to accept and embrace the technology that is here nowCommunication is Key to Success, Especially EmailEnglish is the dominant language of business communication globally, with approximately 1.75 billion people using English to communicate on a regular basis, including email. (Source: Harvard Business Review)The average office worker receives around 121 emails per day and sends about 40 business emails daily. (Source: Radicati Group)In a business context, professionals spend an average of 28% of their workweek managing email. (Source: McKinsey)With such a large amount of communication done over email it is worth spending time to master the craftThis is not Just Another Basic English CourseNot just another vocabulary and phrase training courseWe don’t teach you tricks to FAKE fluencyTeach the skills necessary to decode emails like a native speakerDon’t just communicate, express yourself and understand others as they intend",
    "instructor": "Nicholas Gilmore",
    "requirements": [
      "Desire to improve your English",
      "Ability to use English at a minimum of lower intermediate level",
      "Willingness to broaden your understanding of email culture in English speaking environments",
      "Willingness to embrace the complexities of English used in complex social environments"
    ],
    "whatYouWillLearn": [
      "Develop an advanced skill in understanding the tone of an email",
      "Learn to identify passive-aggressive behavior in emails",
      "Learn to understand  when and who to copy on an email",
      "Learn how to politely decline an email request",
      "Learn when to use email chains and when not to",
      "Learn how to craft the perfect subject line",
      "Learn how to avoid sounding overly defensive in email responses"
    ],
    "content": [
      {
        "title": "Introduction",
        "subsections": [

          {
            "title": "Introduction",
            "time":"02:25",
            "url":"https://www.youtube.com/shorts/S0Z0D3bMxuU"
          }
        ]
      },
      {
        "title": "10 Best Practices for Email Deliverability",
        "subsections": [

            {
              "title":"SPAM Trigger Words",
              "time":"02:06",
              "url":"https://www.youtube.com/watch?v=wvAWyeqiql4&pp=ygUnU1BBTSBUcmlnZ2VyIFdvcmRzIGNvbW11bmljYXRpb24gY291cnNl"
            }
        ]
      },
      {
        "title": "13 Ways to Minimize SPAM Complaints",
        "subsections": [

          {
            "title":"Protecting Your IP Address",
            "time":"05:44",
            "url":"https://www.youtube.com/watch?v=--onbg-jHqQ&pp=ygUvUHJvdGVjdGluZyBZb3VyIElQIEFkZHJlc3MgY29tbXVuaWNhdGlvbiBjb3Vyc2U%3D"
          }
        ]
      },
      {
        "title": "Gowing Email Marketing",
        "subsections": [
          {
            "title":"Email Marketing",
            "time":"01:05",
            "url":"https://www.youtube.com/shorts/ReOyGeTHwfE"
          }
        ]
      },
      {
        "title": "Summary and Thank You!",
        "subsections": [

        {
          "title":"Summary and Thank you!",
          "time":"01:43",
          "url":"https://www.youtube.com/watch?v=--onbg-jHqQ&pp=ygUvUHJvdGVjdGluZyBZb3VyIElQIEFkZHJlc3MgY29tbXVuaWNhdGlvbiBjb3Vyc2U%3D"
        }
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/5846928_1342_5.jpg",
    "category":"communications"
  },
  {
    "id":"108",
    "title": "Effective Communication Techniques for Business Growth",
    "price": "Current priceE£399.99",
    "description": "This course is designed to help you master the art of communication in the workplace, providing you with the skills and techniques needed to excel in any professional setting. You’ll start by learning the foundational elements of effective communication, such as clarity, tone, and active listening, which are essential for delivering understood and well-received messages. As you progress, you’ll explore how to tailor your communication to various audiences—whether speaking with team members, clients, or executives—ensuring that your message resonates and achieves the desired impact. The course also explores nonverbal communication, showing how body language, facial expressions, and eye contact play critical roles in reinforcing verbal messages. You'll gain practical strategies for handling tough conversations with confidence, ensuring that you can manage difficult situations while maintaining professionalism and composure. We’ll cover the importance of effective written communication, helping you craft emails, reports, and clear, concise, and persuasive proposals. In addition, the course will teach you how to resolve workplace conflicts through constructive dialogue, fostering stronger relationships and more collaborative teamwork. As you refine your communication skills, you’ll also learn to give and receive feedback effectively, helping you grow continuously and adapt your communication style to different business scenarios. The course also includes modules on delivering impactful presentations, using visual aids, and managing public speaking anxiety, ensuring you’re well-prepared for any professional speaking opportunity. By the end of this course, you’ll be ready to communicate with confidence and effectiveness, no matter the audience or situation.",
    "instructor": "David I. Soto",
    "requirements": [
      "Be willing to engage in hands-on exercises and apply feedback for growth."
    ],
    "whatYouWillLearn": [
      "How to communicate effectively in various workplace settings, including team meetings, presentations, and one-on-one conversations.",
      "Techniques for handling difficult conversations with confidence and composure.",
      "The art of crafting clear and persuasive written communication, such as emails and reports.",
      "How to tailor communication strategies to different audiences, including clients, colleagues, and executives.",
      "Methods for overcoming common communication barriers, such as misunderstandings, cultural differences, and language challenges.",
      "The importance of non-verbal communication and how to use body language to enhance your message.",
      "Strategies for resolving conflicts through empathetic and effective communication.",
      "How to continuously improve communication skills through feedback and practical application."
    ],
    "content": [
      {
        "title": "Introduction",
        "subsections": [
          "IntroductionPreview02:48"
        ]
      },
      {
        "title": "Foundations of Effective Workplace Communication",
        "subsections": [
          {
            "title":"Understanding Communication BasicsPreview",
            "time":"18:46",
            "url":"https://www.youtube.com/watch?v=MQlsTAAl5aA&pp=ygUpVW5kZXJzdGFuZGluZyBDb21tdW5pY2F0aW9uIEJhc2ljc1ByZXZpZXc%3D"
          }
        ]
      },
      {
        "title": "Audience-Centered Communication Strategies",
        "subsections": [
          {
            "title":"Audience Analysis Techniques",
            "time":"18:46",
            "url":"https://www.youtube.com/watch?v=Hfue7l-WuJ4&pp=ygUcQXVkaWVuY2UgQW5hbHlzaXMgVGVjaG5pcXVlcw%3D%3D"
          }
        ]
      },
      {
        "title": "Enhancing Team Communication and Collaboration",
        "subsections": [
          {
            "title":"Building Strong Team Dynamics and Tools for Effective Team Communication",
            "time":"22:22",
            "url":"https://www.youtube.com/watch?v=jPMr7gNTVPk&pp=ygVIQnVpbGRpbmcgU3Ryb25nIFRlYW0gRHluYW1pY3MgYW5kIFRvb2xzIGZvciBFZmZlY3RpdmUgVGVhbSBDb21tdW5pY2F0aW9u"
          }
        ]
      },
      {
        "title": "Crafting Effective Stakeholder Communication",
        "subsections": [
          {
            "title":"Understanding Stakeholder Needs & Balancing Transparency and Discretion",
            "time":"22:22",
            "url":"https://www.youtube.com/watch?v=UsnlvWcEI0s&pp=ygVHVW5kZXJzdGFuZGluZyBTdGFrZWhvbGRlciBOZWVkcyAmIEJhbGFuY2luZyBUcmFuc3BhcmVuY3kgYW5kIERpc2NyZXRpb24%3D"
          }
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/6219295_379e.jpg",
    "category":"communications"
  },
  {
    "id":"109",
    "title": "دورة تعليمية في كتابة الايميلات بالانجليزية",
    "price": "Current priceE£499.99",
    "description": "دورة كتابة الايميلات بالإنجليزية هي دورة متكاملة ستجعلك تعرف كيف تكتب ايميلات البيزنس في شغلك باحترافية شديدة باللغة الإنجليزية.هي دورة احترافية تساعدك علي التعرف عن اساسيات كتابة الايميلات وكيفية التعامل مع رؤسائك ومديرينك في العمل عند ارسال رسائل الكترونية لهم خاصة بالعمل.الدورة تساعدك علي التعرف بشكل اكبر علي كيفية الكتابة الخاصة بالبيزنس Business writing وتعلمك ايضا كيف يمكنك ارفاق الملفات الهامة والتقارير الخاصة بعملك داخل الرسالة الالكترونية E-Mail.الدورة ايضا تساعدك علي معرفة المناصب الادارية داخل بيئة العمل وايضا معرفة الاختصارات الهامة داخل الرسالة الالكترونية وما هي معانيها.كل ده من خلال نك هتتعلم التالي:1. - أساسيات كتابة الايميل في العمل.2. -ازاي تختار عنوان وجسم الموضوع والخاتمة وتكتبهم باحترافية شديدة..3. -هتتعلم كمان كيفية كتابة التواريخ باللغة بالإنجليزي بشكل صحيح.4. -إزاي إنك تقدر تستخدم الأزمة في اللغة الإنجليزية بشكل احترافي إن شاء الله..5. كل ده من خلال 10 امثلة مختارة باحترافية شديدة في مجالات عديدة زي ( خدمة العملاء - العمل الإداري - الانتاج... الخ)مستوي الانجليزي المطلوب: يفضل ان يكون متوسط.يفضل ان تكون علي دراية بكيفية كتابة الجمل بالانجليزية وان تمتلك بعضالمفردات الخاصة بمجال عملك بالانجليزية.يفضل مذاكرة الكورس بشكل مستمر .وفي نهاية الكورس ستجد نفسك قادرا علي كتابة الايميلات بشكل احترافي ان شاء الله.-------يمكنك التواصل مباشرة من خلال الرسائل مع المحاضر مهندس/احمد بكر",
    "instructor": "ِAhmed Bakr",
    "requirements": [
      "مستوي متوسط في اللغة الانجليزية"
    ],
    "whatYouWillLearn": [
      "أساسيات كتابة الايميل في العمل.",
      "ازاي تختار عنوان وجسم الموضوع والخاتمة وتكتبهم باحترافية شديدة..",
      "هتتعلم كمان كيفية كتابة التواريخ باللغة بالإنجليزي بشكل صحيح.",
      "زاي إنك تقدر تستخدم الأزمة في اللغة الإنجليزية بشكل احترافي إن شاء الله.."
    ],
    "content": [
      {
        "title": "Introduction",
        "subsections": [
          "المحاضرة الاولي : مقدمة عن اساسيات كتابة الايميلاتPreview31:59"
        ]
      },
      {
        "title": "المحاضرة الثانية",
        "subsections": [
          "المحاضرة الثانية24:24"
        ]
      },
      {
        "title": "المحاضرة الثالثة",
        "subsections": [
          "المحاضرة الثالثة18:56"
        ]
      },
      {
        "title": "المحاضرة الرابعة والاخيرة",
        "subsections": [
          "المحاضرة الاخيرة16:25"
        ]
      },
      {
        "title": "Presentation",
        "subsections": [
          "Presentation00:49"
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/4639824_8570_2.jpg",
    "category":"communications"
  },
  { 
    "id":"110",
    "title": "Storytelling Masterclass : A Communication Skill for Leaders",
    "price": "Current priceE£399.99",
    "description": "Course Title: Storytelling in BusinessCourse Description:In today's dynamic business landscape, effective communication is more critical than ever. This course is designed to equip students with the essential skills to harness the power of storytelling in the context of business. Through a combination of theory, case studies, and practical exercises, participants will learn how to craft compelling narratives that engage stakeholders, drive decision-making, and inspire action.Key topics covered in this course include:1. Understanding the Role of Storytelling in Business:   - Explore the fundamental principles of storytelling and its significance in the corporate world.   - Analyze successful business narratives to discern their key elements and strategies.2. Storytelling Vs Data:   - Learn how storytelling trumps data.    - How to wrap the data in story to appeal human brain3. Leveraging Storytelling Across Business Functions:   - Examine how storytelling can be applied in various business contexts, including marketing, sales, leadership, and organizational change.   - Discover the role of storytelling in branding, customer engagement, employee motivation, and cultural transformation.4. Proven Framework for Developing Compelling Narratives:   - Learn a step-by-step guide to developing story.    - Learn to use the given framework for any communication mode.5. Psychology of Storytelling:   - Learn how our brain and body reacts to story   - Discover the amazing power of story that changes your brain chemistry.By the end of this course, participants will have the tools and insights to become adept storytellers in the business context, capable of leveraging narrative techniques to inform, influence, and inspire within their organizations and beyond.",
    "instructor": "Naveed Anjum",
    "requirements": [
      "Anyone who is willing to improve his/her communication skills"
    ],
    "whatYouWillLearn": [
      "Identify storytelling as communication skill",
      "Use storytelling in presentation, public speaking, writing memos or letters",
      "Make persuasive conversation for maximum impact",
      "Communicate in all the spheres of life with confidence"
    ],
    "content": [
      {
        "title": "Introduction and overview",
        "subsections": [
          {
            "title":"Why change communications matters more than everPreview",
            "time":"2:52",
            "url":"https://www.youtube.com/watch?v=7Rt8sgt7gNE&pp=ygVMV2h5IGNoYW5nZSBjb21tdW5pY2F0aW9ucyBtYXR0ZXJzIG1vcmUgdGhhbiBldmVyUHJldmlldyJjb21tdW5pY2F0aU9uIGNvdXJzZQ%3D%3D"
          }
          
        ]
      },
      {
        "title": "Phase 1: Hear it - the first phase of our staggered approach to change comms",
        "subsections": [
          {
            "title":"Cutting through the noise",
            "time":"04:46",
            "url":"https://www.youtube.com/watch?v=UkcxKXBWio0&pp=ygUuQ3V0dGluZyB0aHJvdWdoIHRoZSBub2lzZSBjb21tdW5pY2F0aU9uIGNvdXJzZdIHCQl-CQGHKiGM7w%3D%3D"
          }
         
          
        ]
      },
      {
        "title": "Feel it - the second phase of our staggered approach to change comms",
        "subsections": [
          {
            "title":"From head to haert",
            "time":"4:49",
            "url":"https://www.youtube.com/watch?v=QGeHS4jO0X0&pp=ygUnRnJvbSBoZWFkIHRvIGhhZXJ0IGNvbW11bmljYXRpb24gY291cnNl"
          }
          
          
        ]
      },
      {
        "title": "Understand it - the third phase of our staggered approach to change comms",
        "subsections": [
          {
            "title":"Building understanding through layered messaging",
            "time":"4:56",
            "url":"https://www.youtube.com/watch?v=Q8SFYo1nmrQ&pp=ygVFQnVpbGRpbmcgdW5kZXJzdGFuZGluZyB0aHJvdWdoIGxheWVyZWQgbWVzc2FnaW5nIGNvbW11bmljYXRpb24gY291cnNl"
          }
        ]
      },
      {
        "title": "Do it - the fourth phase of our staggered approach to change comms",
        "subsections": [
          {
            "title":"Turning communications into behaviour",
            "time":"4:40",
            "url":"https://www.youtube.com/watch?v=hAxCpAnV3-E&pp=ygU6VHVybmluZyBjb21tdW5pY2F0aW9ucyBpbnRvIGJlaGF2aW91ciBjb21tdW5pY2F0aW9uIGNvdXJzZQ%3D%3D"
          }
        ]
      },
      {
        "title": "Live it - the final phase of our staggered approach to change comms",
        "subsections": [
          {
            "title":"Sustaining the conversation",
            "time":"4:11",
            "url":"https://www.youtube.com/watch?v=0g1r7v2xX4E&pp=ygUjU3VzdGFpbmluZyB0aGUgY29udmVyc2F0aW9uIGNvbW11bmljYXRpb24gY291cnNl"
          }
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/5997528_6d4a_6.jpg",
    "category":"communications"
  },
  {
    "id":"111",
    "title": "The Complete Non-verbal Communication Skills Master for life",
    "price": "Current priceE£599.99",
    "description": "Communication isn’t just about words; it’s about the message you convey through your actions, posture, and expressions. This course is meticulously designed for leaders, IT professionals, executives, and engineers to help you understand and harness the power of non-verbal communication to excel in your roles.Non-verbal cues such as body language, facial expressions, tone of voice, and gestures account for a significant portion of the impact you have in professional interactions. Whether you’re presenting an idea, leading a team, or managing client relationships, your ability to communicate effectively beyond words can make or break your success.This course will empower you with skills to:Enhance your executive presence and project confidence in meetings, presentations, and negotiations.Decode subtle non-verbal signals to understand the unspoken needs and concerns of your colleagues, clients, and team members.Build stronger, more authentic connections with others by aligning your verbal and non-verbal communication.Improve collaboration by fostering trust and understanding through effective body language.Manage challenging conversations with poise and empathy.Through interactive workshops, practical exercises, and real-world case studies, you’ll learn how to use non-verbal communication to command attention, inspire trust, and leave a lasting impression. This course goes beyond theory, providing you with actionable strategies to apply in your daily professional life, whether you’re solving technical problems, leading innovation, or driving organizational change.By the end of this program, you’ll not only feel more confident but also more equipped to navigate complex professional scenarios with ease, building a reputation as a leader who communicates with clarity and impact. Transform the way you engage with others and elevate your career through the art of non-verbal communication!",
    "instructor": "Sid Sriram",
    "requirements": [
      "Basic Communication Skills,Openness to Learning,No Prior Experience Needed"
    ],
    "whatYouWillLearn": [
      "Job Seekers and Career Changers",
      "Students and Young Adults",
      "Public Speakers and Presenters",
      "Professionals and Executives"
    ],
    "content": [
      {
        "title": "Introduction",
        "subsections": [
          "IntroductionPreview08:56",
          "Reading and Using Body Language in Negotiations07:39",
          "Leading Change: The Nonverbal Key to Effective Change Management16:29",
          "The Power of CollaborationPreview11:41",
          "Communication Virtual and Face-to-Face11:23",
          "He Leads, She Leads: Gender and the Body Language of Leaders12:36",
          "Working with Global Teams: Body Language in a Multicultural World14:24",
          "International Body Language: A Guide for Business Professionals13:36"
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/6382293_a3d9.jpg",
    "category":"communications"
  },
  {
    "id":"112",
    "title": "Level 1: An Introduction to Negotiation",
    "price": "Price not found",
    "description": "Our mission is simple: to help you master negotiation and gain one of life’s most valuable skills.This Negotiation eLearning training is based on our popular Master Negotiator Learning journey, which has been proven in the commercial world. Now, for the first time, this new eLearning course is available to the general public.Feeling out of control is a theme we often hear from our commercial clients. You are ‘here’, so you want to take control too. This introduction is where you will take your first steps in understanding the principles of better communication and the art of negotiation. Whether you negotiate internally with stakeholders or externally, and manage commercial relationships, Everybody starts here. The first step to taking control. A journey around the Kahvay Negotiation Compass from The Haggler to The Diplomat. You will take control of;Your emotions, behaviours, your body and words. To strengthen your position;The process. Control the outcomes. Learn how to plan, craft and close deals;‘Them’. Understand and influence how they think, feel and behave.What's included:Self-paced modules you can access anytime, anywhere.Practical, scenario-based exercises to apply learning instantly.Proven frameworks and tools for real-world success.Actionable strategies you can implement right now.Whether you're an individual looking to upskill, a business owner looking to improve profitability, or you are a large company employee needing to make a change, our Level 1 Negotiator: An Introduction course is the place to start.",
    "instructor": "Giles Morgan",
    "requirements": [
      "There are no formal requirements required to take this course, however you will need a desire and commitment to improve your negotiation skills at your own pace.",
      "Internet connected device",
      "Active listening and learning",
      "A growth Mindset",
      "A notebook or digital notebook software is recommended"
    ],
    "whatYouWillLearn": [
      "Learn how to be in control, prepare and act like a master negotiator",
      "Enhanced self-awareness and emotional control, particularly in negotiations and conflict situations",
      "Build a practical awareness of negotiation in your day-to-day life, and learn to handle conflict more effectively",
      "Explore the different negotiation styles with the Kahvay Negotiation Compass. The Haggler, The Dealer, The Engineer and the Diplomat",
      "Using game principles to enhance your skills and strategies. By examining the Zone of Potential Agreement (Z.O.P.A.) model",
      "Recognise why and when to STOP selling and START negotiating.",
      "The essential skills of asking the right questions and truly listening to the responses."
    ],
   "content": [
      {
        "title": "Module 1 - Introduction To The Course",
        "subsections": [
          {
            "title":"Course VideosPreview",
            "time":"1:30",
            "url":"https://www.youtube.com/watch?v=l0hVIH3EnlQ&pp=ygUSU3VjY2Vzc2Z1bCBQaXRjaGVz"
          }
        ]
      },
      {
        "title": "Module 2 - Mindset Adjustment",
        "subsections": [

          {
            "title":"Mindset AdjustmentPreview",
            "time":"1:57",
            "url":"https://www.youtube.com/watch?v=iYSulLpqcyg&pp=ygUZTWluZHNldCBBZGp1c3RtZW50UHJldmlldw%3D%3D"
          }
        ]
      },
      {
        "title": "Module 3 - Key Power Influencers",
        "subsections": [
          {
           "title":"Power Influencers",
            "time": "04:09",
            "url":""
          }
         
        ]
      },
      {
        "title": "Module 4 - The Power Of Appearance",
        "subsections": [
          {
            "title":"Power Of Appearance",
             "time": "01:23",
             "url":""
           }
        ]
      },
      {
        "title": "Module 5 - The Power Of Body Language",
        "subsections": [

          {
            "title":"Power Of Body Language",
             "time": "00:53",
             "url":""
           }
        ]
      },
      {
        "title": "Module 6 - The Power Of Words",
        "subsections": [
          {
            "title":"Power Of Words",
             "time": "01:56",
             "url":""
           }
        ]
      },
      {
        "title": "Module 7 - The Art Of Contentment",
        "subsections": [

          {
            "title":"The Art Of Contentment",
             "time": "00:39",
             "url":""
           }
        ]
      },
      {
        "title": "Module 8 - The Art Of Charisma",
        "subsections": [
          {
            "title":"Art Of Charisma",
             "time": "01:16",
             "url":""
           }
        ]
      },
      {
        "title": "Other Important Considerations",
        "subsections": [

          {
            "title":"Art Of Giving Advice",
             "time": "08:57",
             "url":""
           }
        ]
      },
      {
        "title": "Module 10 - Roadmap To Success",
        "subsections": [
          {
            "title":"Conclusions",
             "time": "01:16",
             "url":""
           }
          
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/4699618_7631_8.jpg",
    "category":"communications"
  },
  {
    "id":"113",
    "title": "Assertiveness : Master Assertive Communication",
    "price": "Current priceE£599.99",
    "description": "Complete Program on Assertiveness and Self-ConfidenceIn this training, you will learn the fundamentals of assertiveness, leadership, assertive body language, and self-confidence. You will discover how to communicate assertively and become more confident.Here are some testimonials from participants in my courses:\"I’m glad to be able to listen to people like Jamal. It’s practical, straight to the point, with real sharing, precise insights, and, most importantly, you can feel that he knows what he’s talking about with great preparation beforehand. I can only recommend this training because it’s clearly an investment worth making!\" – Salahddine\"Pleasantly surprised by this course, I learned so much. A big wake-up call that came at the perfect time in my life. Very motivating!\" – Nicolas\"Thank you for the practical approach, clarity, and concise explanations!\" – Lyne________________________________________Why Join This Assertiveness Training?Assertiveness is a fundamental skill to express yourself clearly and confidently while respecting the opinions and needs of others.Whether in a professional or personal setting, assertiveness helps you communicate better, reduce conflicts, and build healthier, more balanced relationships.It allows you to find the crucial balance between passivity and aggressiveness. If you’re too passive, you may feel ignored, frustrated, or disrespected. If you’re too aggressive, you risk creating tension and damaging relationships.It’s no coincidence that companies are increasingly valuing this key skill.Would you like to communicate more assertively?Would you like to boost your charisma?Or would you like to learn how to handle difficult people without creating conflict?Then this training is designed for you!Regardless of the environment—professional or personal—assertiveness will help you improve communication, reduce conflicts, and build stronger relationships.You don’t need to guess—here are just some of the skills you’ll gain by the end of this training:Identify your communication styleDevelop your charismaLearn to express your opinions and say “no” without guiltManage conflicts with confidenceGain self-confidence and self-esteemImprove your relationships through assertive communicationDevelop your leadership skillsGive constructive feedbackMaster assertive body languageNegotiate more effectivelyManage your emotions and stress in difficult conversationsAnd much more!This is not just a theoretical course—I share techniques you can apply immediately. Throughout the training, you’ll find practical exercises to help you implement what you learn right away.What are you waiting for?Click on \"Buy Now\" and join me inside the training!",
    "instructor": "Jamal Lazaar",
    "requirements": [
      "Open to learn and ready to take action."
    ],
    "whatYouWillLearn": [
      "Identify your communication style",
      "Develop your charisma",
      "Learn to express your opinions and say \"no\" confidently",
      "Manage conflicts with confidence and calmness",
      "Build self-esteem and confidence",
      "Improve your relationships through assertive communication",
      "Strengthen your leadership skills",
      "Give constructive feedback",
      "Master assertive body language",
      "Negotiate more effectivel",
      "Manage emotions and stress during difficult conversations"
    ],
    "content": [
      {
        "title": "Introduction",
        "subsections": [

          {
            "title": "Introduction",
            "time":"02:25",
            "url":"https://www.youtube.com/shorts/S0Z0D3bMxuU"
          }
        ]
      },
      {
        "title": "10 Best Practices for Email Deliverability",
        "subsections": [

            {
              "title":"SPAM Trigger Words",
              "time":"02:06",
              "url":"https://www.youtube.com/watch?v=wvAWyeqiql4&pp=ygUnU1BBTSBUcmlnZ2VyIFdvcmRzIGNvbW11bmljYXRpb24gY291cnNl"
            }
        ]
      },
      {
        "title": "13 Ways to Minimize SPAM Complaints",
        "subsections": [

          {
            "title":"Protecting Your IP Address",
            "time":"05:44",
            "url":"https://www.youtube.com/watch?v=--onbg-jHqQ&pp=ygUvUHJvdGVjdGluZyBZb3VyIElQIEFkZHJlc3MgY29tbXVuaWNhdGlvbiBjb3Vyc2U%3D"
          }
        ]
      },
      {
        "title": "Gowing Email Marketing",
        "subsections": [
          {
            "title":"Email Marketing",
            "time":"01:05",
            "url":"https://www.youtube.com/shorts/ReOyGeTHwfE"
          }
        ]
      },
      {
        "title": "Summary and Thank You!",
        "subsections": [

        {
          "title":"Summary and Thank you!",
          "time":"01:43",
          "url":"https://www.youtube.com/watch?v=--onbg-jHqQ&pp=ygUvUHJvdGVjdGluZyBZb3VyIElQIEFkZHJlc3MgY29tbXVuaWNhdGlvbiBjb3Vyc2U%3D"
        }
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/6516569_6f0a.jpg",
    "category":"communications"
  },
  {
    "id":"114",
    "title": "Cold Emails: Master Personalised First Line Writing",
    "price": "Current priceE£399.99",
    "description": "Are you struggling to write persuasive cold emails that get responses? Are you tired of starting your emails with the same generic first line?This course will help you improve your cold email game. You will learn how to write customized first lines that grab your reader's attention and make them want to keep reading. You will master how to craft icebreakers that make prospects want to read the rest of your cold email and take on your offer in a heartbeat.By using different templates, you will be crafting tailored icebreakers for your cold emails and increasing your chances of securing new clients, partners, or collaborations.In this course, you will learn how to use templates to write personalized first lines for the following:AWARDS AND NOMINATIONSSERVICEJOB OPENINGSCHARITY AND PHILANTHROPYBRAND STORYCASE STUDIESYEARS OF EXPERIENCEMILESTONESINSIGHTS FROM ARTICLESMAGAZINE FEATURESRECOMMENDATION AND REVIEWSBy the end of this course, you'll have the skills and knowledge to write effective cold email first lines that stand out from the competition. Enroll now and learn how to conduct research, find common ground, and personalize your first lines for maximum impact. Take the first step towards improving your cold email outreach and achieving your goals.",
    "instructor": "Babatope J. Adebiyi",
    "requirements": [
      "No writing experience is required.",
      "Willingness to Perform Research.",
      "Internet service and Mobile Device or PC"
    ],
    "whatYouWillLearn": [
      "Learn How to Write Personalized First Lines with Templates",
      "Simple Tips to Write Highly Effective Personalized First Lines.",
      "Common Mistakes When Writing Personalized First Lines",
      "Learn How to Research  Personal Information to Write Aboit",
      "Learn Step by Step Process to Sell Your Writing Skill for Profit"
    ],
    "content": [
      {
        "title": "Introduction",
        "subsections": [
          "IntroductionPreview02:38"
        ]
      },
      {
        "title": "THE PROCESS OF WRITING PERSONALIZED FIRST LINES",
        "subsections": [
          {
            "title":"The Steps involved in Writing Personalized First Lines",
            "time":"04:00",
            "url":"https://www.youtube.com/watch?v=QuUQRcqndws&pp=ygU2VGhlIFN0ZXBzIGludm9sdmVkIGluIFdyaXRpbmcgUGVyc29uYWxpemVkIEZpcnN0IExpbmVz0gcJCX4JAYcqIYzv"
          }
        ]
      },
      {
        "title": "HOW TO WRITE PERSONALIZED EMAIL FIRST LINES USING TEMPLATES",
        "subsections": [
          {
            "title":"How to Write about Awards and Nominations",
            "time":"04:31",
            "url":"https://www.youtube.com/watch?v=_QH4JTnOAcg&pp=ygUpSG93IHRvIFdyaXRlIGFib3V0IEF3YXJkcyBhbmQgTm9taW5hdGlvbnM%3D"
          }
        ]
      },
      {
        "title": "HOW TO TURN YOUR WRITING SKILL INTO CASH",
        "subsections": [
          {
            "title":"How to Turn Your Writing Skill into Profits",
            "time":"02:41",
            "url":"https://www.youtube.com/watch?v=pUKFGYK-ZnE&pp=ygUrSG93IHRvIFR1cm4gWW91ciBXcml0aW5nIFNraWxsIGludG8gUHJvZml0cw%3D%3D"
          }
        ]
      },
      {
        "title": "Conclusion",
        "subsections": [
          "How to Get the Best Out of This Course01:48"
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/5023308_5021.jpg",
    "category":"communications"
  },
  {
    "id":"115",
    "title": "Data Communication: Analysis, Visualisations & Presentation",
    "price": "Current priceE£599.99",
    "description": "Too often, excellent data analysis gets lost when communicated with others. This course shows you how to communicate your analysis with clarity, class and impact.Learn how to create beautiful visualisations that guide your audience's attention and tell a compelling data-driven story. Weave these into a narrative that takes your audience on a journey of understanding that culminates with them grasping the key messages you want them to take away from your presentation.What's in the Course?The course is structured in 4 parts - each an essential component of perfect data communication.Understanding Your Audience. Knowing who you are presentating to dramatically affects how your present your findings and what to include. This sections shows you how to set scene in a way that ensures your presentation includes everything your audience needs and doesn't waste their time.Choosing the Right Visualisation. Too often people select the wrong visualisation for the data they are sharing. This sections shows you the do's and don't's for the most common visualisations, and explores alternatives, such as text and tables.Crafting the Perfect Visualisation. This sections introduces a two-step process for creating a stunning graphic. First, I show you how to strip a visualisation down to its bare essentials, so that it is clutter-free and sitraction-free. Next, I show you how to use colour, contrast, size and more to guide your audience's attention to the key message.Telling a Data-Driven Story. Even the most compelling visualisations need to be embedded in a good narrative to capture your audience's attention and enthusiasm. Here, we explore ideas of narrative structure and presentation skills  so that your analysis really speaks to your audience.As well as video lessons, the course also has activities and assignments for you to put what you have learned into practice.How Can This Course Help You?The world of business and data is full of bad visualisations and communication. Stand out from the crowd by knowing how to present analysis properly.Make data clear and impactful: Learn how to transform complex data into clear, visually engaging stories that captivate your audience.Boost your professional skills: Develop data communication techniques that are highly valued across industries, from business and education to research and marketing.Tell compelling stories with data: Master the art of weaving data and narrative together to influence decisions and convey key insights effectively.Elevate your presentations: Design charts, graphs, and visuals that not only look professional but also drive your message home.Enhance your Excel know-how: Gain hands-on experience creating and customizing impactful visualizations using standard Excel tools.Communicate with confidence: Apply best practices to simplify your data visuals, highlight important points, and ensure your audience understands your message clearly.A Little About Me...I'm a data analyst, statistician and teacher based in London. I work with business professionals who use statistics and data analysis in their work, as well as teaching students learning Mathematics and Statistics. I've helped 10s of thousands of business professionals and students understand statistics, visualisations and data analysis. Here's what I offer:Individual Support. As with all my courses, I answer all my students' questions myself, so if you ever have questions or comments, I'm here to help!Highly Rated Intructor. I'm one of the highest rated instructors. Please do check out my reviews from this and other courses. My students value my personable approach, subject knowledge, friendly delivery and clarity.Satisfaction Guarantee. If you're not completely satisfied with the course, you can get a full refund within 30 days of purchase. Woody",
    "instructor": "Woody Lewenstein",
    "requirements": [
      "Some basic knowledge of data analysis is useful but not required."
    ],
    "whatYouWillLearn": [
      "Data Communication: Learn how to present your data analysis to others with clarity and focus.",
      "Visualisations: Learn how to create visualisations that guide your audience's attention to the message you want to communicate.",
      "Presentation Design: Learn how to embed your visualisations and commentary into a presentation that takes your audience on a journey.",
      "Data-Driven Storytelling: Learn how to construct a narrative framework that makes your analysis memorable and compelling.",
      "Presentation Skills: Learn how to use tone, body language and emotion to engage your audience.",
      "Design Principles: Learn how to use colour, contrast and size to ensure your audience is drawn to the key message.",
      "Excel Skills: Learn how to create the most common visualisations in Excel, and how to turn Excel defaults into beautiful, clear visuals.",
      "Powerpoint Skills: Learn how to embed visualisations into Powerpoint Presentations to create seamless, professional presentation slides"
    ],
    "content": [
      {
        "title": "Setting the Scene",
        "subsections": [
          {
            "title":"Defining a Purpose",
            "time":"02:38",
            "url":"https://www.youtube.com/watch?v=ZFsXLyey-sM&t=124s&pp=ygUSRGVmaW5pbmcgYSBQdXJwb3Nl"
          }
        ]
      },
      {
        "title": "Types of Visualisation",
        "subsections": [
          {
            "title":"Bar Charts",
            "time":"02:38",
            "url":"https://www.youtube.com/watch?v=WTVdncVCvKo&pp=ygUKQmFyIENoYXJ0c9IHCQl-CQGHKiGM7w%3D%3D"
          }
        ]
      },
      {
        "title": "Guiding Attention",
        "subsections": [
          {
            "title":"Creating a Perfect Visualisation",
            "time":"02:38",
            "url":"https://www.youtube.com/watch?v=NoqEPY2fQyY&pp=ygUgQ3JlYXRpbmcgYSBQZXJmZWN0IFZpc3VhbGlzYXRpb24%3D"
          }
        ]
      },
      {
        "title": "Telling a Story",
        "subsections": [
          {
            "title":"Telling a Data-Driven Story",
            "time":"08:27",
            "url":"https://www.youtube.com/watch?v=r5_34YnCmMY&pp=ygUbVGVsbGluZyBhIERhdGEtRHJpdmVuIFN0b3J5"
          }
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/6324555_3d02_3.jpg",
    "category":"communications"
  },
  {
    "id":"116",
    "title": "Legal Communication Skills: Strategies for New Lawyers",
    "price": "Current priceE£399.99",
    "description": "Are you ready to excel in your legal career by mastering communication and career-building strategies?\"Legal Communication Skills: Strategies for New Lawyers\" is a comprehensive course designed to help you develop essential skills for success in your early years of practice. From effective communication and negotiation to overcoming procrastination, this course equips you with the tools to thrive.Join over 99,000 students in 127 countries who trust Pursuing Wisdom Academy for life-changing learning experiences.What You’ll Learn:Effective Communication Mastery:Develop clear and concise communication skills essential for successful legal practice.Procrastination-Busting Techniques:Learn strategies to overcome procrastination and boost productivity in your career.Conflict Resolution Expertise:Acquire techniques to resolve conflicts efficiently and build trust with clients and colleagues.Networking Excellence:Enhance your networking skills to grow your professional connections and opportunities.Negotiation Tactics:Master the art of negotiation to excel in client interactions and career advancement.Career Advancement Strategies:Navigate your first year in practice, ask for raises, and position yourself for long-term success.Who Should Take This Course?This course is perfect for:New Lawyers: Develop skills to excel in your early years of legal practice.Recent Graduates: Transition seamlessly from law school to a thriving legal career.Legal Professionals Seeking Growth: Hone communication and productivity skills to advance in the field.Career Changers: Build a strong foundation in legal communication and career-building strategies.Whether you’re starting fresh or seeking to refine your skills, this course is tailored to help you succeed in the competitive legal field.Why Choose This Course?Comprehensive Skill Development: Master communication, conflict resolution, and productivity for legal success.Career-Focused Strategies: Learn practical steps to navigate challenges and advance your legal career.Proven Success: Join over 99,000 students worldwide who trust Pursuing Wisdom Academy.Flexible Learning: Lifetime access ensures you can revisit lessons whenever needed.Risk-Free Enrollment: Backed by Udemy’s 30-day money-back guarantee, there’s no risk—only growth.Take control of your legal career today!Enroll now in Legal Communication Skills: Strategies for New Lawyers to master communication, boost productivity, and advance your career with confidence.Join over 99,000 students worldwide and unlock your legal potential today!Click \"Enroll Now\" and take the first step toward career success today.",
    "instructor": "Crystal Hutchinson (f/k/a) Tummala",
    "requirements": [
      "laptop or smartphone and internet connection"
    ],
    "whatYouWillLearn": [
      "Effective Communication Mastery: Develop the art of clear and concise communication, a critical skill for successful legal practice.",
      "Procrastination-Busting Techniques: Say goodbye to procrastination and embrace productivity to stay ahead in your legal career.",
      "Conflict Resolution Expertise: Acquire the ability to resolve conflicts efficiently, a valuable asset in the legal profession.",
      "Networking Excellence: Enhance your networking skills, both internally and externally, to expand your professional circle.",
      "Negotiation Tactics: Master the art of negotiation, crucial when dealing with clients and in your career development.",
      "Career Advancement Strategies: Learn how to navigate your one-year mark, ask for a raise, and make the most of your legal career."
    ],
    "content": [
      {
        "title": "Introduction",
        "subsections": [
          {
            "title":"General Housekeeping",
            "time":"02:03",
            "url":"https://www.youtube.com/watch?v=aYEuRc0vk7U&pp=ygUUR2VuZXJhbCBIb3VzZWtlZXBpbmc%3D"
          }
          
        ]
      },
      {
        "title": "Building Your Career While Utilizing Internal and External Resources",
        "subsections": [
          {
            "title":"Learn about Constructive Criticism, Billing, and Staying ProductivePreview",
            "time":"03:58",
            "url":"https://www.youtube.com/shorts/68N8tyXylrU"
          }
        ]
      },
      {
        "title": "The Core Foundations of Communication",
        "subsections": [
          {
            "title":"Verbal CommunicationPreview",
            "time":"02:01",
            "url":"https://www.youtube.com/watch?v=4_5dayHDdBk&pp=ygUbVmVyYmFsIENvbW11bmljYXRpb25QcmV2aWV3"
          }
        ]
      },
      {
        "title": "Internal and External Resources and What to Expect as a New Lawyer",
        "subsections": [
          {
            "title":"Leveraging Social Media",
            "time":"01:37",
            "url":"https://www.youtube.com/watch?v=9AtpcZv--MA&pp=ygUXTGV2ZXJhZ2luZyBTb2NpYWwgTWVkaWE%3D"
          }
        ]
      },
      {
        "title": "The Basics on Negotiating",
        "subsections": [
          {
            "title":"Proper Negotiation Tactics For Clients",
            "time":"05:45",
            "url":"https://www.youtube.com/watch?v=z3U0FRb9yr4&pp=ygUmUHJvcGVyIE5lZ290aWF0aW9uIFRhY3RpY3MgRm9yIENsaWVudHM%3D"
          }
        ]
      },
      {
        "title": "Your One Year Mark",
        "subsections": [
          {
            "title":"Asking for a Raise",
            "time":"05:29",
            "url":"https://www.youtube.com/watch?v=vGqswpmICP8&pp=ygUSQXNraW5nIGZvciBhIFJhaXNl"
          }
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/5237650_4ce1.jpg",
    "category":"communications"
  },
  {
    "id":"117",
    "title": "Workplace Communication Skills Part 2",
    "price": "Current priceE£599.99",
    "description": "In today’s dynamic work environment, strong business communication skills are essential. This advanced course builds on interpersonal communication basics, diving deeper into the specific competencies required to succeed in a business setting. Designed for professionals at all levels, this course covers the comprehensive scope of business communication: from interacting with clients to managing teams and resolving crises effectively.You will explore team communication strategies that promote efficiency and collaboration, whether in person or within virtual teams. Techniques for effective customer relations - including handling difficult clients and navigating complaints - will be covered, equipping you to communicate with professionalism and empathy in every interaction. Ethical communication, a pillar of modern business, is another focus area; you’ll learn about privacy, confidentiality, and branding while maintaining high ethical standards.For those in or aspiring to leadership roles, this course delves into advanced communication techniques to inspire and motivate teams. Each module provides actionable insights, preparing you to address real-world challenges with confidence and competence.What is primarily taught in this course?Team communication and collaborative decision-making.Customer service and client relations management.Ethical and professional business communication.Remote team communication and virtual management strategies.Crisis communication.Leadership communication for inspiring and motivating teams.By the end of this course will understand how to communicate clearly during complex situations, ensuring that your leadership builds trust and cohesion.",
    "instructor": "Hains Academy",
    "requirements": [
      "This course has no specific prerequisites, making it accessible to learners at all professional levels. A background in basic workplace communication is helpful but not required, as this course provides foundational knowledge in business communication and related skills for both beginners and experienced professionals."
    ],
    "whatYouWillLearn": [
      "Communicate effectively as part of a team, using strategies that enhance collaboration.",
      "Implement skills for managing client and customer interactions, including handling complaints and resolving conflicts.",
      "Conduct business communication that upholds ethical and professional standards.",
      "Navigate the challenges of virtual team management, using tools and techniques for effective remote communication.",
      "Build skills in leadership communication to inspire and motivate teams.",
      "Manage crises effectively through clear, composed, and strategic communication."
    ],
    "content": [
      {
        "title": "Introduction",
        "subsections": [
          "IntroductionPreview01:17"
        ]
      },
      {
        "title": "Section 1 – Team communication",
        "subsections": [
          "Section 1 introduction – Team communicationPreview01:05",
          "1.1 – Effective communication within teams and across departmentsPreview03:56",
          "1.2 – Strategies for collaborative decision-makingPreview04:13",
          "1.3 – Managing virtual teams and remote communication07:13",
          "1.4 – Enhancing team communication through technology03:11",
          "1.5 - Facilitating effective meetings and presentations07:07",
          "Section 1 conclusion01:12",
          "Section 1 quiz6 questions"
        ]
      },
      {
        "title": "Section 2 – Communicating with customers and clients",
        "subsections": [
          "Section 2 introduction – Communicating with customers and clients01:06",
          "2.1 – Customer service communication skills05:56",
          "2.2 - Handling difficult customers and resolving complaints02:44",
          "2.3 - Effective sales and marketing communication02:44",
          "2.4 - Managing communication in a global business context04:41",
          "2.5 - The role of communication in a crisis01:44",
          "Section 2 conclusion01:36",
          "Section 2 quiz6 questions"
        ]
      },
      {
        "title": "Section 3 - Ethical and professional communication",
        "subsections": [
          "Section 3 introduction - Ethical and professional communication01:36",
          "3.1 - Communicating with integrity and professionalism02:15",
          "3.2 - Ethical considerations in business communication02:57",
          "3.3 - Maintaining confidentiality and privacy03:20",
          "3.4 - Ethical branding and online presence02:55",
          "Section 3 conclusion01:42",
          "Section 3 quiz6 questions"
        ]
      },
      {
        "title": "Section 4 - Communication skills for leadership",
        "subsections": [
          "Section 4 introduction - Communication skills for leadership01:21",
          "4.1 - Communication challenges and opportunities for leaders06:40",
          "4.2 - Empathy and active listening as leadership communication skills02:51",
          "4.3 - Inspiring and motivating teams through effective communication03:51",
          "Section 4 conclusion01:02",
          "Section 4 quiz6 questions"
        ]
      },
      {
        "title": "Course conclusion",
        "subsections": [
          "Course conclusion03:10"
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/6254161_db97.jpg",
    "category":"communications"
  },
  {
    "id":"118",
    "title": "Business Etiquette: Workplace Communication & Behavior",
    "price": "Current priceE£599.99",
    "description": "In today’s fast-paced business world, knowing how to conduct yourself professionally is just as important as the skills you bring to the table. Business etiquette is not just about using the right fork at a formal dinner—it’s about communicating effectively, building strong professional relationships, and understanding workplace expectations. Whether you’re in an office, attending a corporate event, or engaging in online interactions, your behavior and communication style can influence your career trajectory.This course covers all aspects of workplace communication and behavior, equipping you with the skills needed to navigate professional settings with confidence. You will learn how to make positive first impressions, interact with colleagues and clients, and maintain professional conduct in meetings, networking events, and even virtual spaces. Business etiquette is more than a set of rigid rules—it’s about fostering respect, enhancing collaboration, and demonstrating professionalism in every situation.Did You Know?74% of employers say strong business etiquette and communication skills make candidates more competitive in the job market (Forbes)85% of job success comes from soft skills, including business etiquette and professional behavior (Harvard Business Review)92% of professionals believe effective business etiquette improves workplace relationships and job performance (LinkedIn)By understanding international business etiquette, workplace behavior, and digital professionalism, you will be better equipped to handle professional scenarios with ease. This course is essential for anyone who wants to stand out in a competitive job market, improve workplace relationships, and enhance their personal brand in professional environments.",
    "instructor": "Edukite Online",
    "requirements": [
      "No prior knowledge or experience needed. This course is open for anyone who is interested in the topic."
    ],
    "whatYouWillLearn": [
      "Develop strong workplace communication skills to interact effectively with colleagues and clients",
      "Understand professional etiquette in meetings, conferences, and networking events",
      "Build lasting professional relationships through proper business networking strategies",
      "Master dining etiquette for business meals and formal events",
      "Learn workplace behavior expectations and how to foster a respectful work environment",
      "Gain insights into international business etiquette and cultural awareness",
      "Maintain a professional and positive online presence through proper social media conduct",
      "Apply business etiquette principles to boost confidence and career growth"
    ],
    "content": [
      {
        "title": "Introduction and overview",
        "subsections": [
          {
            "title":"Why change communications matters more than everPreview",
            "time":"2:52",
            "url":"https://www.youtube.com/watch?v=7Rt8sgt7gNE&pp=ygVMV2h5IGNoYW5nZSBjb21tdW5pY2F0aW9ucyBtYXR0ZXJzIG1vcmUgdGhhbiBldmVyUHJldmlldyJjb21tdW5pY2F0aU9uIGNvdXJzZQ%3D%3D"
          }
          
        ]
      },
      {
        "title": "Phase 1: Hear it - the first phase of our staggered approach to change comms",
        "subsections": [
          {
            "title":"Cutting through the noise",
            "time":"04:46",
            "url":"https://www.youtube.com/watch?v=UkcxKXBWio0&pp=ygUuQ3V0dGluZyB0aHJvdWdoIHRoZSBub2lzZSBjb21tdW5pY2F0aU9uIGNvdXJzZdIHCQl-CQGHKiGM7w%3D%3D"
          }
         
          
        ]
      },
      {
        "title": "Feel it - the second phase of our staggered approach to change comms",
        "subsections": [
          {
            "title":"From head to haert",
            "time":"4:49",
            "url":"https://www.youtube.com/watch?v=QGeHS4jO0X0&pp=ygUnRnJvbSBoZWFkIHRvIGhhZXJ0IGNvbW11bmljYXRpb24gY291cnNl"
          }
          
          
        ]
      },
      {
        "title": "Understand it - the third phase of our staggered approach to change comms",
        "subsections": [
          {
            "title":"Building understanding through layered messaging",
            "time":"4:56",
            "url":"https://www.youtube.com/watch?v=Q8SFYo1nmrQ&pp=ygVFQnVpbGRpbmcgdW5kZXJzdGFuZGluZyB0aHJvdWdoIGxheWVyZWQgbWVzc2FnaW5nIGNvbW11bmljYXRpb24gY291cnNl"
          }
        ]
      },
      {
        "title": "Do it - the fourth phase of our staggered approach to change comms",
        "subsections": [
          {
            "title":"Turning communications into behaviour",
            "time":"4:40",
            "url":"https://www.youtube.com/watch?v=hAxCpAnV3-E&pp=ygU6VHVybmluZyBjb21tdW5pY2F0aW9ucyBpbnRvIGJlaGF2aW91ciBjb21tdW5pY2F0aW9uIGNvdXJzZQ%3D%3D"
          }
        ]
      },
      {
        "title": "Live it - the final phase of our staggered approach to change comms",
        "subsections": [
          {
            "title":"Sustaining the conversation",
            "time":"4:11",
            "url":"https://www.youtube.com/watch?v=0g1r7v2xX4E&pp=ygUjU3VzdGFpbmluZyB0aGUgY29udmVyc2F0aW9uIGNvbW11bmljYXRpb24gY291cnNl"
          }
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/6515819_77e0_2.jpg",
    "category":"communications"
  },
  {
    "id":"119",
    "title": "From Zero to Substack Hero for Freelance Writers: Level 3",
    "price": "Current priceE£599.99",
    "description": "Dear Freelance Writers and Content Entrepreneurs, Welcome to Level 3 of the course \"From Zero to Substack Hero for Freelance Writers.\" This course was designed using the content of the third and last portion of my best-selling Substack Mastery book. I, Dr Mehmet Yildiz, the owner of the content, and my protege Aiden, a YouTuber, restructure and narrate it for you.  Aiden is a professional media consultant, filmmaker, and experienced educator who has created the lessons from my Substack Mastery book into an actionable and engaging learning experience.This course is more than just a guide to Substack. What you learn from it can also be applied to other platforms like Medium, Behiiv, Convertkit, MailChimp, Ghost, or others.  This course was designed as part of the Substack Mastery Boost Pilot program, which currently supports 35,000 freelance writers and 200,000+ readers on Medium and Substack. It will be your clear roadmap to mastering content creation, content strategy marketing, audience building, and effective monetization while keeping the process enjoyable, educational, and motivating. Who Is This Course For?Freelance writers and content entrepreneurs are looking to grow their audience and income.Bloggers, creators, and storytellers ready to expand their impact.Beginners who are curious about starting a Substack or refining their current newsletter strategy.Experienced writers seeking fresh ideas and tools to elevate their content development and marketing game.Aspiring content entrepreneurs who want to scale their writing business and earn more income. What You Will Learn at Level 3In this more advanced course, you will explore practical strategies and tools to elevate your Substack journey and create long-term success. Here’s what you’ll gain:Master the Essentials Beyond Substack:Understand the core principles freelance writers need to thrive across platforms and evolve as content entrepreneurs.Learn about Interactive Educational Programs:Learn how to design and add interactive workshops, courses, and webinars to your Substack to engage readers and grow your audience.Integrate Substack with Patreon:Discover strategies for combining Substack and Patreon to maximize growth, engagement, and income.Use Polls  and Surveys Effectively:Leverage polls to spark conversations, gather reader insights, and keep your audience engaged. Explore how to use surveys to gather detailed feedback, understand your audience better, and refine your content strategy.Work on a Book Based on Your Substack Content:Learn how to leverage tools like Reedsy to transform your best newsletters into a published book and expand your reach as an author.Enhance Your Substack with Advanced Tools and Strategies:Master 14 powerful tools and tactics to elevate your writing, marketing, and overall platform performance.Sustain Your Substack for Long-Term Success:Build resilience, maintain consistency, and future-proof your Substack for continued growth and impact.Why This Course Stands Out:Comprehensive Learning:This course is based on my best-selling Substack Mastery book, a practical and highly rated guide for writers enhanced by Aiden’s unique media skills, editing/curation insights, and teaching expertise.Engaging Format:Aiden blends actionable tips, thought-provoking questions, and lighthearted humor with videos, embedded PowePoint presentations, audio chapters of the Substack Mastery book, quizzes, and assignments to make learning enjoyable.Multi-Sensory Experience:This course combines video lessons, audiobook chapters, and interactive exercises to cater to different learning styles and keep you engaged.Step-by-Step Guidance:Starting from basics like understanding Substack Notes to crafting excellent newsletters that convert, each section builds your confidence and skills and helps you to grow your audience with loyal community support. Course Includes:Exclusive access to professionally edited and narrated audiobook chapters from the Substack Mastery book.2+ hours of audio content with PowerPoint Slides, course material in the curriculum, and relevant links.Downloadable resources to support your learning journey.Links to free resources in the Substack Mastery community blogs.Once you complete this course, we will give you access to our 15 publications on Medium if you are interested. Upon completion, you will also be part of our Substack Mastery Boost Pilot program. Why Learn with Aiden?Aiden’s expertise in media consulting, filmmaking, and audience engagement, with a good sense of humor, makes him the ideal instructor to guide you through this transformative journey. With his approachable teaching style and real-world examples, you’ll feel empowered to take action and achieve your goals.Start Your Journey Today!If you are a freelance writer, blogger, content marketing expert, seasoned book author, content entrepreneur, or just starting online writing, this course will equip you with the tools, strategies, and confidence to succeed. Join us now and take the first step toward mastering your writing, engaging your audience, and earning sustainably—without losing your mind! Thank you for taking the course and being part of the Substack Mastery community on multiple platforms. Aiden and I will be happy to answer your questions and guide you in your writing journey. Dr Mehmet YildizLeader of ILLUMINATION writing/reading community on Medium and Substack",
    "instructor": "Dr Mehmet Yildiz",
    "requirements": [
      "There are no prerequisites for this course. However, completing Level 1 and Level 2 can enhance your understanding and make it easier to complete this Level 3 course.",
      "Joining a writing community during or after completing this course can be helpful to reinforce your learning and practice what you learned."
    ],
    "whatYouWillLearn": [
      "Understand the core principles freelance writers need to thrive across platforms and evolve as content entrepreneurs.",
      "Learn how to design and add interactive workshops, courses, and webinars to your Substack to engage readers and grow your audience.",
      "Integrate Substack with Patreon: Discover strategies for combining Substack and Patreon to maximize growth, engagement, and income.",
      "Use Polls  and Surveys Effectively:Leverage polls to spark conversations, gather reader insights, and keep your audience engaged. Explore how to use surveys.",
      "Work on a Book Based on Your Substack Content:Learn how to leverage tools like Reedsy to transform your best newsletters into a published book.",
      "Enhance Your Substack with Advanced Tools and Strategies:Master 14 powerful tools and tactics to elevate your writing, marketing, and platform performance.",
      "Sustain Your Substack for Long-Term Success:Build resilience, maintain consistency, and future-proof your Substack for continued growth and impact."
    ],
    "content": [
      {
        "title": "Introduction",
        "subsections": [
          {
            "title":"The Key Takeaway from L1 and L2 of From Zero to Substack Hereo1 question",
            "time":"13:07",
            "url":""
          }
        ]
      },
      {
        "title": "Lesson 1: Essential Principles for Freelance Writers Beyond Substack",
        "subsections": [
          {
            "title":"Explanation  of 30 Principles",
            "time":"16:43",
            "url":"https://www.youtube.com/watch?v=EAynHZE-lK4&pp=ygUdRXhwbGFuYXRpb24gIG9mIDMwIFByaW5jaXBsZXM%3D"
          }
        ]
      },
      {
        "title": "Lesson 2: Using Interactive Educational Programs on Substack",
        "subsections": [
          {
            "title":"Video and Audio interaction for Interactive Educational Programs",
            "time":"23:12",
            "url":"https://www.youtube.com/watch?v=O1KuDETLqVw&pp=ygVAVmlkZW8gYW5kIEF1ZGlvIGludGVyYWN0aW9uIGZvciBJbnRlcmFjdGl2ZSBFZHVjYXRpb25hbCBQcm9ncmFtc9IHCQl-CQGHKiGM7w%3D%3D"
          }
        ]
      },
      {
        "title": "Lesson 3: Integrating Substack with Patreon for Growth and Engagement",
        "subsections": [
          {
            "title":"Why and How to Integrate Substack with Patreon",
            "time":"29:49",
            "url":"https://www.youtube.com/watch?v=hncVNvgoz10&pp=ygUuV2h5IGFuZCBIb3cgdG8gSW50ZWdyYXRlIFN1YnN0YWNrIHdpdGggUGF0cmVvbg%3D%3D"
          }
        ]
      },
      {
        "title": "Lesson 4: Effective Use of Polls in Substack Newsletters",
        "subsections": [
          {
            "title":"How to Use Polls in Substack Newsletters, Emails, and Articles",
            "time":"15:57",
            "url":"https://www.youtube.com/watch?v=KXytwTJuBjA&pp=ygU-SG93IHRvIFVzZSBQb2xscyBpbiBTdWJzdGFjayBOZXdzbGV0dGVycywgRW1haWxzLCBhbmQgQXJ0aWNsZXM%3D"
          }
        ]
      },
      {
        "title": "Lesson 5: Why and How to Add Surveys to Substack",
        "subsections": [
          {
            "title":"Importance of Survey on Substack and How to Develop Them",
            "time":"14:35",
            "url":"https://www.youtube.com/watch?v=PkTDmw1cvaU&pp=ygU4SW1wb3J0YW5jZSBvZiBTdXJ2ZXkgb24gU3Vic3RhY2sgYW5kIEhvdyB0byBEZXZlbG9wIFRoZW0%3D"
          }
        ]
      },
      {
        "title": "Lesson 6: How Substack Writers Can Leverage Reedsy to Become Published Authors",
        "subsections": [
          {
            "title":"An introduction to Reedsy Platform with Examples",
            "time":"22:17",
            "url":"https://www.youtube.com/watch?v=ZHkJkPwG8-o&pp=ygUwQW4gaW50cm9kdWN0aW9uIHRvIFJlZWRzeSBQbGF0Zm9ybSB3aXRoIEV4YW1wbGVz"
          }
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/6386189_844a.jpg",
    "category":"communications"
  },
  {
    "id":"120",
    "title": "Marketer's Blueprint: Email Deliverability Optimization",
    "price": "Current priceE£399.99",
    "description": "Embark on a journey through the intricate world of email marketing with this definitive course, “Email Marketing Optimization”. This comprehensive program is crafted to empower marketers, entrepreneurs, and businesses to navigate through the complexities of email deliverability, ensuring that your carefully crafted emails reliably reach your audience's inbox.Delve into the multifaceted aspects of email marketing, exploring essential topics such as sender reputation, IP warming, email authentication, and engagement tracking. Digital marketing veteran Spider Graham will guide you in decoding the algorithms and filters of various email service providers (ESPs), enhancing your understanding of spam traps, blocklists, and the pivotal metrics that influence delivery rates.This course opens up a universe where emails are not merely sent but significantly acknowledged, read, and acted upon. Learn to strategize your campaigns by adapting to subscriber behaviors, optimizing content, and meticulously segmenting your lists. Gain a robust comprehension of compliance with regulations like the CAN-SPAM Act and GDPR, ensuring your email campaigns are not only effective but also legally compliant.Explore real-world case studies that illustrate triumphs and pitfalls in email marketing campaigns, equipping you with pragmatic insights and actionable strategies to elevate your email marketing endeavors. Participants will engage in hands-on exercises, allowing them to implement learned strategies, evaluate outcomes, and refine their approach for enhanced deliverability and engagement.As email remains a potent channel for digital communication, ensuring your message effectively navigates through the bustling digital landscape is paramount. Whether you’re a seasoned marketing professional or a burgeoning entrepreneur, this course is designed to sharpen your skills, offering you a strategic edge in constructing and deploying exceptionally deliverable email campaigns.Join us in mastering the art and science of email deliverability and propel your messages beyond the spam folder, straight into the receptive inboxes of your engaged subscribers!",
    "instructor": "Spider Graham",
    "requirements": [
      "An interest in Email Marketing"
    ],
    "whatYouWillLearn": [
      "Understanding Email Deliverability",
      "Understanding CAN-SPAM Compliance law",
      "Ways to Minimize SPAM Complaints",
      "A Brief History of Email Marketing",
      "Techniques for Growing Your Email Marketing",
      "Data Collection Best Practices"
    ],
    "content": [
      {
        "title": "Introduction",
        "subsections": [

          {
            "title": "Introduction",
            "time":"02:25",
            "url":"https://www.youtube.com/shorts/S0Z0D3bMxuU"
          }
        ]
      },
      {
        "title": "10 Best Practices for Email Deliverability",
        "subsections": [

            {
              "title":"SPAM Trigger Words",
              "time":"02:06",
              "url":"https://www.youtube.com/watch?v=wvAWyeqiql4&pp=ygUnU1BBTSBUcmlnZ2VyIFdvcmRzIGNvbW11bmljYXRpb24gY291cnNl"
            }
        ]
      },
      {
        "title": "13 Ways to Minimize SPAM Complaints",
        "subsections": [

          {
            "title":"Protecting Your IP Address",
            "time":"05:44",
            "url":"https://www.youtube.com/watch?v=--onbg-jHqQ&pp=ygUvUHJvdGVjdGluZyBZb3VyIElQIEFkZHJlc3MgY29tbXVuaWNhdGlvbiBjb3Vyc2U%3D"
          }
        ]
      },
      {
        "title": "Gowing Email Marketing",
        "subsections": [
          {
            "title":"Email Marketing",
            "time":"01:05",
            "url":"https://www.youtube.com/shorts/ReOyGeTHwfE"
          }
        ]
      },
      {
        "title": "Summary and Thank You!",
        "subsections": [

        {
          "title":"Summary and Thank you!",
          "time":"01:43",
          "url":"https://www.youtube.com/watch?v=--onbg-jHqQ&pp=ygUvUHJvdGVjdGluZyBZb3VyIElQIEFkZHJlc3MgY29tbXVuaWNhdGlvbiBjb3Vyc2U%3D"
        }
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/5608382_a8a2.jpg",
    "category":"communications"
  }
]