[
  {
    "id":"1",
    "title": "The PMI- PMOCP Exam Simulations",
    "price": "Current priceE£1,399.99",
    "description": "This course is built around questions for the five-stage model that reflects the Full PMO Value Ring and PMO FlywheelExploration – Learn how to identify, engage, and understand your internal customers. Discover how to explore their needs and prepare them to recognize the value your PMO can offer.Design – Develop a compelling value proposition for your PMO and translate it into a well-defined portfolio of services that aligns with your organization’s strategic goals.Deployment – Turn strategy into action. Learn how to roll out services, onboard stakeholders, and start delivering value from day one.Enhancement – Monitor performance, identify gaps, and continuously improve your services and your team’s capabilities to meet evolving organizational needs.Realization – Measure and communicate the real value your PMO delivers. Understand the impact your work is creating and use it to strengthen your PMO’s role and future strategy.Course Coverage: PMI-PMOCP Exam Domains Organizational Development and Alignment (16%)Learn how to align PMO objectives with business strategy, ensuring value delivery and long-term success. PMO Strategic Elements (18%)Understand how to define and implement key PMO strategies that support governance, project selection, and portfolio management.PMO Design and Structuring (18%)Master the different PMO structures, functions, and implementation frameworks to optimize performance.PMO Operation and Performance (15%)Develop key performance indicators (KPIs) and governance models to track PMO effectiveness and project outcomes.PMO Enhancement and Effectiveness (18%)Evaluate PMO maturity, implement continuous improvement strategies, and measure return on investment (ROI).People (15%)Focus on stakeholder engagement, leadership, communication strategies, and team competency development within a PMO.The Most Practical and Widely Adopted PMO Methodology in the World.Project Managers who want to expand their understanding of PMO functions and align projects with organizational strategy.Directors looking to establish or refine the PMO’s role within their business.Portfolio, Program, and Project Office Managers who aim to standardize project practices and improve project success rates.Project or Program Office Support Staff and Project Managers seeking to enhance their skills in PMO operations.PMO Heads, Managers, Directors, and Staff responsible for managing or working within the PMO.Professionals developing or planning to develop a PMO as a means of delivering strategic value.Anyone looking to build a career in the Project Management Office, gaining skills that are highly valued in project-driven organizations.This course equips learners with the tools to implement the PMO Value Ring methodology effectively and enhances their career prospects in project management and PMO roles.",
    "instructor": "Mohamed Abdelsatar. MBA, PMP®, RMP®, PMI-PBA®, PMO-CP™",
    "requirements": [],
    "whatYouWillLearn": [],
    "content": [
      {
        "title": "Practice Tests",
        "subsections": [
          "PMI-PMOCP Practice Test 1120 questions",
          "PMI-PMOCP Practice Test 2120 questions",
          "PMI-PMOCP Practice Test 3120 questions",
          "PMI-PMOCP Practice Test 4120 questions"
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/6537869_3374.jpg",
    "category":"management"
  },
  { 
    "id":"2",
    "title": "ISO 37001 Lead Auditor Practice Exams",
    "price": "Current priceE£599.99",
    "description": "This course is designed for professionals preparing for the ISO 37001 Lead Auditor certification. It provides comprehensive practice exams to help learners test their knowledge, improve their understanding of anti-bribery management systems, and build confidence before taking the actual certification exam.ISO 37001 is the internationally recognized standard for Anti-Bribery Management Systems (ABMS). Organizations worldwide are increasingly adopting ISO 37001 to strengthen compliance and ethical business practices. Becoming a certified lead auditor in ISO 37001 enhances career opportunities and allows professionals to conduct audits, assess compliance, and ensure that organizations meet anti-bribery requirements.This course includes realistic exam-style questions that cover all key ISO 37001 concepts, including bribery risk assessments, due diligence, internal audits, audit planning, and reporting. Each question is accompanied by a detailed explanation to reinforce learning and clarify complex topics.What You Will Gain from This Course:Full-length practice exams that simulate real test conditionsScenario-based questions to improve problem-solving skillsDetailed explanations for each answer to strengthen understandingInsights into audit best practices and risk assessment techniquesA structured approach to preparing for the ISO 37001 Lead Auditor examWho Should Enroll?Professionals preparing for the ISO 37001 Lead Auditor certificationCompliance officers and risk managers responsible for anti-bribery frameworksAuditors and consultants working in anti-bribery complianceBusiness leaders and legal professionals interested in ethical governanceThis course is designed to help professionals master the ISO 37001 framework, pass the certification exam, and apply best practices in real-world auditing scenarios. Enroll today to take the next step in your career.",
    "instructor": "Dr. Amar Massoud",
    "requirements": [],
    "whatYouWillLearn": [],
    "content": [
      {
        "title": "Practice Tests",
        "subsections": [
          "Practice Test 150 questions",
          "Practice Test 250 questions",
          "Practice Test 350 questions",
          "Practice Test 450 questions",
          "Practice Test 550 questions",
          "Practice Test 650 questions"
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/6438465_3812_2.jpg",
    "category":"management"
  },
  {
    "id":"3",
    "title": "Digital Leadership and Management in 2025",
    "price": "Current priceE£399.99",
    "description": "Course Description: Digital Leadership and Management in 2023The Digital Leadership and Management course in 2023 is designed to equip aspiring leaders with the essential skills and knowledge to navigate the complexities of the digital age. Traditional leadership qualities alone are insufficient in today's rapidly evolving business landscape. Leaders must possess unique traditional and digital skills to lead their organizations and teams toward success effectively.This course will delve into the core competencies required for successful leadership in the digital era. Participants will learn to adapt to ever-changing business environments, harness emerging technologies, and leverage data-driven insights to make informed decisions. They will also develop a deep understanding of the importance of emotional intelligence in building strong relationships and fostering a positive work culture.The course will explore various aspects of digital leadership, including effectively communicating and collaborating in virtual teams, managing remote employees, and leveraging digital platforms for strategic planning and execution. Participants will also gain insights into digital leadership's ethical implications and challenges, such as cybersecurity and privacy concerns.By the end of the course, participants will have acquired the knowledge and skills necessary to lead in a rapidly changing digital world. They will be equipped to build high-performing teams, drive innovation, and achieve organizational objectives in 2023 and beyond.",
    "instructor": "Michael Goedeker",
    "requirements": [
      "Be interested in Management and Leadership",
      "Want to understand Leadership and Management"
    ],
    "whatYouWillLearn": [
      "Understanding the definitions of Management and Leadership",
      "Understanding what is Effective Leadership and Management",
      "Understand different Styles of Leadership",
      "Key Management and Leadership Principles and Practices"
    ],
    "content": [
      {
        "title": "Introduction",
        "subsections": [
          "Chapter 1: Introduction to Leadership and ManagementPreview29:58",
          "Chapter 2: Building Strong Leadership Foundations26:00",
          "Chapter 3: Key Management Principles and Practices33:46",
          "Chapter 4: Leading and Motivating Teams28:31",
          "Chapter 5: Effective Decision Making and Problem Solving26:37",
          "Chapter 6: Leading Change and Innovation23:05",
          "Chapter 7: Developing High-Performing Teams26:26",
          "Chapter 8: Strategic Leadership and Organizational Development18:17",
          "Chapter 9: Ethical Leadership and Corporate Social Responsibility14:11",
          "Chapter 10: Leadership in the Digital Age26:02",
          "Chapter 11: Matching Leadership Styles to Team Types28:16",
          "Chapter 12: Successful Leadership Traits in 202328:23",
          "Understanding Leadership1 question"
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/5583024_a783.jpg",
    "category":"management"
  },
  
  {
    "id":"4",
    "title": "Master Assignment Problem Algorithm",
    "price": "Current priceE£399.99",
    "description": "The basic tools of Operations Research (OR). OR is a bunch of mathematical tools to solve business-related problems. (For other tools like Linear Programming, Critical Path Method, Sequencing Problem, Game theory, Transportation Problem, see other courses by the instructor)The manual method to solve (AP) will be discussed and demonstrated with several examplesThese problems are typically to maximize or minimize the value of a certain parameter given a situation that the resources and their uses are matched one-on-one basis in case of an Assignment Problem.The manual method also known as Hungarian Assignment Problem is demonstrated manually by solving problems that could be upto 6x6 size. The Hungarian Assignment Problem is a very simple but effective algorithm in solving a 'resources to use' type of problem, such as assigning workers to jobs, or salesmen to different territories, or assigning rooms to managers or assigning incoming flight route to outgoing flight route etc. The key  in solving a problem is drawing the minimum number of vertical or horizontal lines through Hungarian Matrix, which will cancel out all zeros. To achieve this, a very simple procedure is enumerated in the course, with enough practice so that the student can do it on her own.",
    "instructor": "Madhusudan Sohani",
    "requirements": [
      "Nothing is required as a pre-requisite, except internet connectivity and availability of either a phone or a laptop"
    ],
    "whatYouWillLearn": [
      "Students will learn to solve problems needing application of the Hungarian Assignment Problem",
      "They will learn to solve maximisation problems and minimisation problems using the algorithm",
      "They will be able to solve unbalanced problems also",
      "Thwy will be able to apply the algorithm to several situations which need the assignment problem technique"
    ],
    "content": [
      {
        "title": "Introduction",
        "subsections": [
          "IntroductionPreview48:36",
          "Lecture 0248:31",
          "Lecture 0301:47:49",
          "Lecture 0423:40",
          "Lecture 0500:36"
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/5365528_7f76_2.jpg",
    "category":"management"
  },
  {
    "id":"5",
    "title": "ISO 19011:2018 - Exam for Internal & Supplier Audit Course",
    "price": "Price not found",
    "description": "ISO 19011:2018 Auditor Preparation Practice ExamIf you decided to work as an auditor, a new university life is starting for you. It will require many updates of standards, so many training, exams, and interviews. The first training begins with learning that even asking the right questions is require a training.The ISO 19011 Internal auditor and supplier audit course, which you will see in the courses we have published, is the first course of becoming an auditor. You will see homework and practical exams in the course. If you want to become an external auditor and work with certification firms, you should take the lead auditor course. It is important to review what you have learned in the auditor course in order to undergo lead auditor courses.If you say that you have received the auditor training before, you just want to refresh and consolidate your knowledge,If you want to prepare for the lead auditor training,If you want to validate your knowledge of auditors with exam success,you are in the right place.Online exam usually preferable because the learning objectives and self assessment.You can look at the ISO 19011: 2018 standard exam and review for the questions you have been confusion with. The book is an open exam. The case questions to be asked will measure your interpretation skills. If you get confusion here, you can get help from your friends who work as an auditors, or you can take our auditor course.",
    "instructor": "Fatma İnceoğlu",
    "requirements": [],
    "whatYouWillLearn": [],
    "content": [],
    "image": "https://img-c.udemycdn.com/course/240x135/4014716_9942_3.jpg",
    "category":"management"
  },
  {
    "id":"6",
    "title": "Digital Strategy - Experiential Learning",
    "price": "Price not found",
    "description": "This is a course for working professionals or students interested in the domain of digital strategy. This course will give an overview of the Digital Strategy, key roles available in the market and some of the key concepts which will help you on the job. It is not a factual training, it is my experiential learning and hope is helpful for you as well on your journey on the Digital strategy career path. This course will also include topics around product management, customer experience, enterprise architecture and many more topics which are core as well as adjacent to digital strategy and transformation in a way. This course will give you a head start on your next career switch or the new job after your college. I will also include sample case studies, deliverables etc. which will help you understand the deliverables that are critical in this domain and will give you an idea for the same  I also have an Instagram Page where I put free content, you can follow me there for more free content. I also take one on one consultations for free of charge for students. Just reach out to me, and I will set sometime up for you to talk and discuss your queries and doubts.",
    "instructor": "Astha Rungta",
    "requirements": [
      "Nothing"
    ],
    "whatYouWillLearn": [
      "Quick concepts around digital strategy",
      "Quick concepts around product management",
      "Quick concepts around consumer insights",
      "Quick concepts around digital transformation"
    ],
    "content": [],
    "image": "https://img-c.udemycdn.com/course/240x135/5474662_21bc_3.jpg",
    "category":"management"
  },
  {
    "id":"7",
    "title": "CFM Practice Exam combined Set A and Set B (Randomly)",
    "price": "Current priceE£1,699.99",
    "description": "Those who hold the CFM certification can be assured that they have the necessary level of competence and understanding in the field of facility management because it is widely acknowledged as the gold standard. At this time, professional groups are the ones driving most of the initiatives for credentialing. The Certified Facility Manager (CFM) designation was the industry's first and is still the only accreditation that is acknowledged on a global scale. The candidate's proven knowledge, skills, and abilities across 11 fundamental facets of facility management are evaluated for the CFM Exam. Since the program's establishment in 1992, over 6,000 plant managers from 38 different countries have successfully completed the requirements necessary to obtain this distinction.Prepare yourself, make sure an application is submitted, do your best in the exam, and continue doing an excellent job in order to be acknowledged. The Certified Facility Manager (CFM) credential is often regarded as the highest possible level of professional achievement that can be attained in the field of facility management.Advantages:Develop your reputation as a credible professional within your network.Demonstrate that you have an understanding of each of the 11 fundamental competencies.Develop your skills as an intellectual leader in facilities management.Be proud to become a member of this esteemed community of FM specialists.",
    "instructor": "Marvin Arinuelo",
    "requirements": [],
    "whatYouWillLearn": [],
    "content": [
      {
        "title": "Practice Tests",
        "subsections": [
          "Random CFM Exam (11 Competency)160 questions",
          "Random CFM Exam (11 Competency)161 questions",
          "Random CFM Exam (11 Competency)160 questions",
          "Random CFM Exam (11 Competency)160 questions",
          "Random CFM Exam (11 Competency)158 questions"
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/5208100_8382.jpg",
    "category":"management"
  },
  {
    "id":"8",
    "title": "eSports Mentorship Program",
    "price": "Current priceE£399.99",
    "description": "This course is used as the official mentorship program of Jakob \"VXVX\" Johnson, owner of LAGr Gaming and Decal Branding. In this program I will be covering a handful of key areas in the scene and how I have decided to approach them in my adventures in the scene. I will also be covering the basics of event hosting and organizing which I have done since the age of 15.",
    "instructor": "Jakob Johnson",
    "requirements": [
      "Must have access to a computer able to run all videos and other materials in the course."
    ],
    "whatYouWillLearn": [
      "eSports Basics",
      "Sponsorship Proposals",
      "Gaming contracts",
      "Branding",
      "Event Organizing"
    ],
    "content": [
      {
        "title": "Introduction",
        "subsections": [
          "Introduction00:43",
          "Meet the InstructorPreview02:53"
        ]
      },
      {
        "title": "Course Materials",
        "subsections": [
          "Part 1 - eSports BasicsPreview04:32",
          "101 Quiz3 questions",
          "Part 2 - BrandingPreview07:19",
          "Branding Article - Forbes01:15",
          "Part 3 - Sponsorship Proposals03:37",
          "Part 4 - Gaming Contracts03:51",
          "Gaming Contract Article - Insider05:11"
        ]
      },
      {
        "title": "Event Organizing + Wrap Up",
        "subsections": [
          "Part 5 - Event Organizing07:22",
          "End of Course Wrap Up01:47"
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/3307202_920d_2.jpg",
    "category":"management"
  },
  {
    "id":"9",
    "title": "Modern Logistics and Multimodal Transport",
    "price": "Price not found",
    "description": "This course Modern Logistics and Multimodal Transport aim to provide a comprehensive exploration of contemporary logistics and the integration of various transportation modes. The course is designed to equip students with the knowledge and skills needed to excel in the dynamic field of logistics and supply chain management.Throughout the course, we will explore the fundamental principles of modern logistics, examining key components such as warehousing, inventory management, distribution, and customer service. Emphasis will be placed on understanding the strategic importance of logistics within the broader supply chain context and how effective logistics management can drive competitive advantage.A significant focus of this course is on multimodal transport, which involves the seamless integration of different transportation modes (road, rail, air, and sea) to optimise efficiency and reduce costs. We will explore the operational, legal, and documentation aspects of multimodal transport, supported by real-world practical examples.Technological advancements in logistics, including the use of IoT, blockchain, artificial intelligence, and autonomous systems, will be covered. There will be learning on how these technologies are transforming logistics operations and enabling smarter, more efficient supply chains.Sustainability is a crucial theme throughout the course. There will be examination of sustainable logistics practices, strategies to minimize environmental impact, and the importance of corporate social responsibility in the logistics sector.Risk management and security in logistics are also important components of the curriculum. As a student, you will learn to identify potential risks, develop mitigation strategies, and implement robust security measures to protect against disruptions.By the end of this course, you will become familiar with the principles and practices of modern logistics and multimodal transport, and will be prepared to tackle challenges and innovate within the global supply chain landscape.",
    "instructor": "Ayoola Ponle, Brightsea Resources",
    "requirements": [
      "No experience required. You stand to learn a lot about logistics and transport."
    ],
    "whatYouWillLearn": [
      "Understand the fundamentals of logistics and supply chain management.",
      "Understand the role of multimodal transport in modern supply chain management.",
      "Analyse the role of technology in modern logistics.",
      "Explore various transportation modes and their integration.",
      "Develop skills to design and manage efficient logistics systems.",
      "Examine global logistics and the impact of regulations and policies."
    ],
    "content": [],
    "image": "https://img-c.udemycdn.com/course/240x135/6026950_58e0_2.jpg",
    "category":"management"
  },
  {
    "id":"10",
    "title": "Vigilant Leadership: Navigating Uncertainty With Foresight",
    "price": "Current priceE£599.99",
    "description": "Welcome to our comprehensive course on Vigilant Leadership - an essential skillset for navigating the complexities of the modern business landscape with foresight and adaptability. In a world characterized by rapid change, uncertainty, and global challenges, the role of a vigilant leader has never been more criticalAs our world continues to evolve at an unprecedented pace, the ability to anticipate, adapt, and lead proactively has become a key differentiator for successful organizations and leaders. In this course, we will guide you through a deep dive into the principles, practices, and significance of Vigilant Leadership in today's dynamic environmentGuided by a team of experienced professionals with a wealth of knowledge in leadership development, we are passionate about empowering aspiring leaders like you to thrive in an ever-changing world. Our course is designed to equip you with the skills, tools, and mindset necessary to lead with vigilance and drive sustainable success in your organizationThroughout this course, you will embark on a transformative journey that will elevate your leadership capabilities and strategic foresight. By delving into topics such as understanding the VUCA world, adapting to global trends, fostering organizational resilience, and harnessing the power of data and technology, you will gain a comprehensive understanding of how vigilant leadership can drive innovation, growth, and long-term successWe understand that in today's competitive landscape, the ability to anticipate market shifts, identify emerging threats, and capitalize on opportunities is paramount. Therefore, our course is meticulously curated to provide you with actionable strategies, real-world case studies, and practical tools to enhance your vigilance and decision-making skillsThrough a blend of theoretical frameworks, hands-on exercises, and interactive discussions, you will learn how to develop a vigilant mindset, cultivate adaptive leadership practices, and build a culture of preparedness within your team. Additionally, you will have the opportunity to explore the intricacies of crisis management, ethical leadership, and sustainability to ensure holistic and responsible leadership practicesBy the end of this course, you will emerge as a proactive, resilient, and visionary leader capable of driving organizational excellence and seizing opportunities in today's volatile business landscape. Join us on this transformative journey and unlock your potential to lead with vigilance, foresight, and impact in an ever-changing worldEnroll now and embark on a learning experience that will not only elevate your leadership skills but also equip you with the tools to navigate the complexities of the future with confidence and agility. Your journey to becoming a vigilant leader starts here. Let's shape the future together!",
    "instructor": "Peter Alkema",
    "requirements": [
      "There are no requirements or pre-requisites for this course, but the items listed below are a guide to useful background knowledge which will increase the value and benefits of this course.",
      "Basic understanding of leadership and management principles.",
      "Familiarity with current global business trends and challenges.",
      "Interest in developing strategic thinking and foresight abilities."
    ],
    "whatYouWillLearn": [
      "Explain the concept of vigilant leadership and its relevance in today's VUCA world.",
      "Analyze historical leadership models to understand the evolution towards vigilant leadership.",
      "Evaluate the role of transformational leadership in inspiring organizational change and innovation.",
      "Apply the principles of servant leadership to improve team performance and engagement.",
      "Adapt your leadership style using contingency and situational leadership theories to suit different contexts.",
      "Utilize big data and AI to enhance decision-making processes within vigilant leadership frameworks.",
      "Integrate a global perspective into leadership strategies to navigate the complexities of globalization.",
      "Develop and implement ethical vigilance strategies to foster sustainability and ethical practices within your organization.",
      "Compare and contrast vigilant leadership with reactive leadership, emphasizing the benefits of a proactive approach.",
      "Assess the impact of technological advancements and globalization on leadership practices.",
      "Apply the core traits of vigilant leaders—awareness, adaptability, and anticipation—to real-world scenarios.",
      "Enhance emotional intelligence and humility to strengthen your vigilant leadership approach.",
      "Balance long-term vision with short-term operational demands to achieve strategic objectives.",
      "Incorporate ethical and moral considerations into your decision-making process to uphold integrity and ethical standards.",
      "Differentiate between vigilant leadership and transformational or transactional leadership models through comparative analysis.",
      "Develop contingency strategies for crisis management, leveraging vigilant and servant leadership principles.",
      "Create innovation and growth strategies by applying practical examples of vigilant leadership from leading companies like Amazon and Netflix.",
      "Build a culture of vigilance within your organization to ensure resilience and adaptability to change.",
      "Implement techniques for industry-specific threat assessment and opportunity identification to maintain a competitive edge.",
      "Foster a continuous learning culture within your organization to adapt to industry trends and maintain long-term success."
    ],
    "content": [
      {
        "title": "Understanding Vigilant Leadership and Its Critical Importance Today",
        "subsections": [
          "Introduction to the Concept and Its RelevancePreview01:59",
          "Download The *Amazing* +100 Page Workbook For this Course01:00",
          "Get This Course In Audio Format: Download All Audio Files From This Lecture00:39",
          "Introduce Yourself And Tell Us Your Awesome Goals With This Course00:27",
          "Adaptability: Thriving Amidst ChangePreview01:38",
          "The Role of Vigilant Leadership in Navigating Uncertainty01:44",
          "Why Vigilant Leadership Matters Today- The Accelerating Pace of ChangePreview01:46",
          "Conclusion: The Imperative for Vigilant Leadership00:47"
        ]
      },
      {
        "title": "Early Leadership Models: Command-and-Control Structures",
        "subsections": [
          "The Roots of Leadership02:13"
        ]
      },
      {
        "title": "Transformational Leadership:",
        "subsections": [
          "Inspiring Change and Innovation- Emergence in the Late 20th Century:01:04"
        ]
      },
      {
        "title": "Servant Leadership: Leading by Serving Others",
        "subsections": [
          "A Countercultural Approach:00:57"
        ]
      },
      {
        "title": "Contingency and Situational Leadership: Adapting to Context",
        "subsections": [
          "The Need for Flexibility:00:58"
        ]
      },
      {
        "title": "The Rise of Vigilant Leadership: A Response to Modern Complexities",
        "subsections": [
          "Contextual Drivers:00:57",
          "The Impact of Big Data and AI:00:50"
        ]
      },
      {
        "title": "Globalization and the Need for a Global Perspective",
        "subsections": [
          "Navigating a Globalized World:00:47"
        ]
      },
      {
        "title": "Sustainability and Ethical Vigilance",
        "subsections": [
          "The Rise of Ethical Leadership:00:48"
        ]
      },
      {
        "title": "The Future of Leadership: Vigilance as a Core Competency",
        "subsections": [
          "Why Vigilance is Critical:01:44"
        ]
      },
      {
        "title": "Key Differences Between Vigilant and Reactive Leadership",
        "subsections": [
          "Proactivity vs. Reactivity: Anticipating vs. Responding02:05",
          "Decision-Making Process: Strategic vs. Tactical02:44"
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/6195127_a472.jpg",
    "category":"management"
  },
  {
    "id":"11",
    "title": "Advancing Leadership Skills in Association Management",
    "price": "Current priceE£399.99",
    "description": "This course is designed to equip students with the skills and knowledge required to effectively manage associations. Upon completion of the course, students will have developed attributes such as industry awareness, strategic thinking, value proposition development, volunteer management, board and team management, organizational culture, financial management, brand development, effective communication, and problem-solving.Throughout the course, students will learn about the association management industry, including current trends and challenges. They will also learn how to develop and implement strategic plans for success in their association. Students will learn how to create effective value propositions for their association's members, and how to effectively recruit and recognize volunteers, creating a culture of volunteerism within their association.The course will also focus on the importance of a high-functioning board, executive, and staff team, and how to lead and manage them effectively. Students will learn how to develop a strong organizational culture, including team effectiveness and conflict management.Financial management will be a key component of the course, as students will gain an understanding of financial reporting and analysis, and the ability to balance commercial and member services for long-term sustainability.In addition, students will learn how to drive the brand experience of their association, utilizing technology platforms, creating a strong web experience, communicating effectively with members and stakeholders, developing business opportunities, and establishing strategic partnerships. Effective communication skills will also be developed to promote engagement and a sense of community within the association.Finally, students will learn how to identify and solve problems within their association, utilizing critical thinking and analytical skills.By the end of the course, graduates will have the knowledge and skills required to effectively manage associations and contribute to the long-term success of their association.",
    "instructor": "James Fitzpatrick",
    "requirements": [
      "There are no prerequisites and beginners are welcome.",
      "Some experience in working or volunteering in an association is desirable",
      "Students must be open minded to explore and unpack content that will transform their association once implemented"
    ],
    "whatYouWillLearn": [
      "Industry Awareness: Graduates will have an understanding of the landscape of the association management industry, including current trends and challenges.",
      "Strategic Thinking: Graduates will be able to develop and implement strategic plans for success in their association.",
      "Value Proposition Development: Graduates will be able to develop effective value propositions for their association's members.",
      "Volunteer Management: Graduates will have the skills and knowledge to effectively recruit and recognize volunteers, creating a culture of volunteerism",
      "Board and Team Management: Graduates will understand the importance of a high-functioning board, executive, and staff team, and be able to lead and manage them",
      "Organizational Culture: Graduates will be able to develop a strong organizational culture, including team effectiveness and conflict management.",
      "Financial Management: Graduates will have an understanding of financial reporting and analysis, and the ability to balance commercial and member services",
      "Brand Development: Graduates will be able to drive the brand experience of their association, utilizing technology platforms, creating a strong web experience,",
      "Effective Communication: Graduates will be able to communicate effectively with stakeholders and members of their association, in order to promote engagement",
      "Problem-Solving: Graduates will be able to identify and solve problems within their association, utilizing critical thinking and analytical skills."
    ],
    "content": [
      {
        "title": "Introduction",
        "subsections": [
          "Introduction from James FitzpatrickPreview06:12",
          "Introduction02:37"
        ]
      },
      {
        "title": "Chapter One: Foundation Landscape and Developing a Strategic Plan",
        "subsections": [
          "Association Landscape01:50",
          "Developing a Strategic Plan01:26",
          "Strategic Planning Lecture08:28",
          "Chapter One Quiz6 questions"
        ]
      },
      {
        "title": "Chapter Two: Membership – the value proposition",
        "subsections": [
          "Member Service Development06:02",
          "Membership Value Lecture05:55",
          "Membership Recruitment and Retention01:57",
          "Membership Recruitment Video05:32",
          "Membership Innovation and Growth03:36",
          "Chapter Two Quiz24 questions"
        ]
      },
      {
        "title": "Chapter Three: The Heart of Associations - Volunteer Management",
        "subsections": [
          "Volunteer Recruitment and Recognition03:14",
          "Volunteer Recruitment Video06:46",
          "High Functioning Boards and Operational Excellence03:28",
          "Board and Management Roles Video02:24",
          "Chapter Three Quiz11 questions"
        ]
      },
      {
        "title": "Chapter Four: Developing Culture and Values",
        "subsections": [
          "Leading Teams06:36",
          "Leading Teams Video06:20",
          "Conflict Management04:52",
          "Conflict Management Video04:18",
          "Chapter Four Quiz4 questions"
        ]
      },
      {
        "title": "Chapter Five: Finance and a Sustainable Future",
        "subsections": [
          "Financial Reporting05:49",
          "Commercial versus Member Services02:22",
          "Commercial Services Video04:17",
          "Chapter Five Quiz6 questions"
        ]
      },
      {
        "title": "Chapter Six : Driving the Brand experience",
        "subsections": [
          "Technology Platforms01:41",
          "Web Experience and Communications04:07",
          "Technology to Enhance Membership Performance Video05:57",
          "Business Development and Strategic Partnerships03:27",
          "Chapter Six Quiz5 questions"
        ]
      },
      {
        "title": "Case Study Ocean Breeze Yacht Club",
        "subsections": [
          "Background01:53",
          "Proposed Solutions02:20",
          "Ocean Breeze Video05:35"
        ]
      },
      {
        "title": "Conclusion",
        "subsections": [
          "Conclusion VideoPreview04:05"
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/5314394_8b97_2.jpg",
    "category":"management"
  },
  {
    "id":"12",
    "title": "Problem Solving: Generating Alternatives",
    "price": "Current priceE£399.99",
    "description": "The Problem Solving: Generating Alternatives course  is the third course of the Decision-making and Problem-solving for Business series and focuses on the following topics:Getting into the flowSay, as a farmer, you're having troubles optimizing your crop yield. If you don't have an effective solution-generating mind-set, your entire operation will likely get plowed under.Being rationalTo tackle your yield problem, you'll need to put rational problem-solving techniques to use. You'll have to think about your alternatives in a realistic, down-to-earth way.Being creativeAt the same time, some farming problems require creative thinking. For example, bugs and pests don't give up easily. Have you ever thought about the world from a critter's point of view? That's what creative agricultural scientists do all the time.Breaking out of rutsLastly, thin harvests translate into acres and acres of stress. Unless you take measures to reduce that frustration, you may wind up losing the problem-solving farm.You're about to discover how to imagine and manifest far-reaching solutions to your business problems. There's nothing ephemeral about the ideas contained here. To the contrary, the techniques you'll explore are deeply rooted in tangible reality--and in results.In this course, you'll learn how to effectively generate alternative solutions by: getting into the flow, taking rational approaches, using creative approaches, and getting out of problem-solving ruts.That’s it! Now, go ahead and push that “Take this course” button and see you on the inside!",
    "instructor": "Sorin Dumitrascu",
    "requirements": [
      "No special requirements or prerequisites"
    ],
    "whatYouWillLearn": [
      "Getting into the Flow",
      "Taking Rational Approaches",
      "Using Creative Approaches",
      "Getting Out of a Rut"
    ],
    "content": [
      {
        "title": "Problem Solving: Generating Alternatives",
        "subsections": [
          "Course OverviewPreview04:00",
          "Effective Learning07:04",
          "Course Choice, Skill Development and Prior Knowledge3 questions",
          "FAQs01:03",
          "Getting into the FlowPreview04:34",
          "Achieving the Right Mind-setPreview05:20",
          "Brainstorming07:00",
          "Taking Rational Approaches03:35",
          "The Science of Better Learning05:14",
          "Pros and Cons- The BEST Model 106:25",
          "Pros and Cons- The BEST Model 205:01",
          "Thinking like the Customer07:07",
          "Using Creative Approaches04:20",
          "Analogies 108:53",
          "Analogies 206:48",
          "Idea Nets 105:46",
          "Idea Nets 205:39",
          "Mind-mapping09:32",
          "Getting Out of a Rut04:03",
          "Using Creative Visualization09:25",
          "Concepts, Insights and Inquiries3 questions",
          "Handling Problem Overload08:10",
          "Job Aid - The Right Mind-set00:18",
          "Job Aid - BEST Alternatives00:10",
          "Job Aid - Mind-map00:42",
          "Achieving an Effective Mind-set02:38",
          "Principles of Brainstorming02:27",
          "BEST Model for Measuring Pros and Cons04:24",
          "Reading Your Customers' Minds02:26",
          "Using Analogies to Generate Ideas03:19",
          "Using Idea Nets02:40",
          "Making Mind-maps03:19",
          "Using Creative Visualization03:11",
          "Keeping Problems in Perspective02:28",
          "Learning Aid - Brian's Analogies00:49",
          "Learning Aid - Jessica's Analogies00:47",
          "Learning aid - Ian's Analogies00:49",
          "Problem Solving - Generating Alternatives03:13",
          "Practical Activity: Creative Alternatives3 questions",
          "Problem Solving - Generating Alternatives5 questions",
          "Problem Solving: Generating Alternatives3 questions",
          "The Power of Professional Development17:51",
          "Takeaways, Practical Applications and Endorsements3 questions",
          "Don’t Just Learn—Do!08:48"
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/4882080_45b3.jpg",
    "category":"management"
  },
  {
    "id":"13",
    "title": "Unlock Risk Measurement & Risk Assessment for Effective Work",
    "price": "Current priceE£1,199.99",
    "description": "|| Unofficial Course ||Risk measurement is the process of identifying, quantifying, and assessing the potential impact of uncertain events or conditions that could negatively affect an individual, organization, or system. It provides a structured way to evaluate the likelihood and severity of adverse outcomes, helping stakeholders make informed decisions, allocate resources efficiently, and comply with regulatory requirements.This comprehensive course offers a deep dive into the principles, methodologies, and evolving practices of risk measurement across financial and non-financial contexts. Designed for students, professionals, and decision-makers seeking a solid foundation in risk analysis, the course begins with a broad exploration of risk—covering strategic, operational, financial, and compliance risks—and highlights why understanding risk is essential for effective management in any industry.As the course progresses, learners will uncover how accurate risk measurement supports better decision-making, improves risk control mechanisms, and ensures regulatory compliance. Foundational concepts such as volatility, probability distributions, exposure, and confidence intervals are introduced to build a strong vocabulary and analytical mindset for evaluating risk.Participants will gain a thorough understanding of major risk types, including market risk, credit risk, operational risk, and liquidity risk. Each topic emphasizes not just definitions, but also the real-world challenges in measuring and managing these risks. The course delves into the statistical tools that underpin risk modeling, from basic probability theory to key statistical measures like mean, variance, and standard deviation, and examines how risks interact and aggregate through concepts like correlation and diversification.Building on this foundation, the course explores widely used risk measurement models, including Value at Risk (VaR), Conditional VaR, stress testing, and risk-adjusted return metrics such as RAROC and the Sharpe Ratio. Learners will also explore how these tools are used differently across sectors, with in-depth discussions on banking, insurance, and industrial corporations, linking theory to sector-specific practices and regulatory demands.An important component of the course is its focus on regulatory and governance frameworks such as Basel III and ISO 31000, providing a clear view of how standards shape the way organizations assess and manage risk. Concepts such as risk appetite, tolerance, and limit-setting are discussed as critical components of enterprise risk policies.The course concludes with a forward-looking perspective on emerging areas of risk measurement. Topics include systemic risk and macroprudential oversight, behavioral influences on risk perception, and the rising importance of quantifying climate-related and cyber risks.Key aspects of risk measurement include:Identifying exposure: Understanding what is at risk (e.g., assets, operations, reputation).Estimating probability: Gauging how likely an adverse event is to occur.Measuring potential loss: Quantifying the financial or strategic consequences if the risk materializes.Using metrics and models: Applying tools like standard deviation, Value at Risk (VaR), expected shortfall, and scenario analysis to quantify risk. Throughout the course, equipping learners with a holistic and adaptable approach to understanding and applying risk measurement in today’s complex and dynamic world.Thank you",
    "instructor": "Muhammad Hakeem",
    "requirements": [
      "Willingness or Interest to learn about Risk Measurement for Success."
    ],
    "whatYouWillLearn": [
      "Understand risk in both financial and non-financial settings, including strategic, operational, market, credit, liquidity, and compliance risks.",
      "Discover how quantifying risk supports better decisions, regulatory compliance, and stronger organizational resilience.",
      "Build a strong foundation with key terms like volatility, exposure, probability distribution, loss, and confidence intervals.",
      "Learn how statistical measures such as mean, variance, standard deviation, and correlation help in modeling and aggregating risk.",
      "Explore the Value at Risk (VaR), Conditional VaR, stress testing, and scenario analysis—focusing on theory and application without complex calculations.",
      "Examine how different industries—including banking, insurance, and manufacturing—apply risk measurement frameworks and adapt to regulatory demands.",
      "Understand the role of frameworks like Basel III and ISO 31000 in shaping how risk is measured and managed at the organizational level.",
      "Dive into modern challenges like systemic risk, behavioral biases in risk perception, climate-related financial risks, & evolving landscape of cyber risk."
    ],
    "content": [
      {
        "title": "Introduction to Risk and Its Measurement",
        "subsections": [
          "Understanding Risk in Financial and Non-Financial ContextsPreview05:03",
          "The Role of Risk Measurement in Risk Management04:14",
          "Key Principles and Terminologies in Risk Measurement04:17"
        ]
      },
      {
        "title": "Risk Typologies and Measurement Foundations",
        "subsections": [
          "Market Risk and Its Components05:50",
          "Credit Risk and Exposure AssessmentPreview04:57",
          "Operational Risk and Non-Quantifiable Factors05:07",
          "Liquidity Risk: Challenges in Measurement05:42"
        ]
      },
      {
        "title": "Probability and Statistics in Risk Measurement",
        "subsections": [
          "Introduction to Probability Distributions in Risk05:24",
          "Statistical Measures for Risk: Mean, Variance, and Standard Deviation03:47",
          "Correlation and Its Role in Risk Aggregation04:26"
        ]
      },
      {
        "title": "Risk Measurement Techniques and Models",
        "subsections": [
          "Value at Risk (VaR): Concepts and Limitations05:40",
          "Conditional VaR and Expected Shortfall05:40",
          "Stress Testing and Scenario Analysis07:02",
          "Risk-Adjusted Return Measures (RAROC, Sharpe Ratio)06:41"
        ]
      },
      {
        "title": "Risk Measurement in Different Sectors",
        "subsections": [
          "Risk Measurement in Banking and Financial Services07:34",
          "Risk Measurement in Insurance06:45",
          "Corporate Risk Measurement in Industrial Sectors05:31"
        ]
      },
      {
        "title": "Regulatory Frameworks and Risk Standards",
        "subsections": [
          "Basel III and Its Impact on Risk Measurement05:43",
          "ISO 31000 and Enterprise Risk Management (ERM)05:50",
          "Risk Appetite, Tolerance, and Limits05:10"
        ]
      },
      {
        "title": "Advanced and Emerging Topics in Risk Measurement",
        "subsections": [
          "Systemic Risk and Macroprudential Metrics06:32",
          "Behavioral Aspects of Risk Perception06:29",
          "Risk Measurement in Climate and Environmental Risk07:08",
          "Cyber Risk Measurement Frameworks05:54"
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/6564103_69c5.jpg",
    "category":"management"
  },
  {
    "id":"14",
    "title": "ITIL 4 Foundation Certification Preparation - 6 Exams 2024",
    "price": "Current priceE£799.99",
    "description": "Our Ninjas' approach to mastering the foundation of ITIL4 is truly unique, setting us apart from the rest. We've carefully crafted a series of preparation questions, each one designed to guide you on a disciplined path, much like a ninja refining their skills. These 6 example exams are not just about passing a test. They embody a spirit of continuous improvement and lifelong learning, just like a ninja's rigorous training and education.Continuous Learning: At the heart of our program is continuous learning. Just as ninjas are known for their adaptability and constant learning, in Service Management, technologies and best practices evolve rapidly. Engaging with our ITIL4 example questions isn't just about preparation for an exam—it's about embracing a mindset of ongoing growth and development. Each question is crafted to challenge your understanding and push you to think critically about ITIL best practices, preparing you for undoubted success in passing your ITIL4 Foundation Certification exam.Skill Enhancement: Our Program is not just about passing an exam. It's about equipping you with the skills and knowledge to handle real-world IT service management challenges. Like a ninja, our diverse range of example questions covers all facets of the ITIL4 framework, ensuring you develop a robust and comprehensive skill set. This approach provides you with not only exam-ready but also ready to excel in your professional life, instilling in you a sense of confidence and preparedness.Education and Mastery: For ninjas, mastery is a lifelong pursuit. Each of our example questions extends even further than the previous ones, extending your knowledge and understanding of the ITIL framework. By progressing through these questions, you engage with materials that develop your expertise gradually and effectively, mirroring how a ninja masters different techniques over time.Contribution to Success: The example questions are not just a tool for passing the ITIL4 Foundation exam but a cornerstone of your learning experience. They allow you to test your knowledge, identify areas for improvement, and gain confidence in your abilities. Just as a ninja's training prepares them for any battle, these questions prepare you to confidently tackle the certification exam, ensuring you have the knowledge and skills to succeed.Leadership and Mastery: Learn from our highly trained and experienced Service Management Ninja Master. His diverse experience, long years of different training and education, and passion for innovation will enable you to become a better professional and skilled ITIL Ninja.The ITIL Ninja journey is not just about achieving certification—it's about transforming into a skilled professional who can navigate the complexities of Service Management with agility and insight. Embrace the path of the ITIL Ninja: continue to learn, evolve, and achieve mastery. Your dedication to continual learning and skill enhancement through our preparation for the certification questions is your secret weapon for passing the certification exam and excelling in your career.",
    "instructor": "Dr. Plamen Ivanov (Service Management Ninja Master)",
    "requirements": [],
    "whatYouWillLearn": [],
    "content": [
      {
        "title": "Practice Tests",
        "subsections": [
          "ITIL® 4 Foundation (Practice Exam 1)40 questions",
          "ITIL® 4 Foundation (Practice Exam 2)40 questions",
          "ITIL® 4 Foundation (Practice Exam 3)40 questions",
          "ITIL® 4 Foundation (Practice Exam 4)40 questions",
          "ITIL® 4 Foundation (Practice Exam 5)40 questions",
          "ITIL® 4 Foundation (Practice Exam 6)40 questions"
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/5966424_7ff0_5.jpg",
    "category":"management"
  },
  {
    "id":"15",
    "title": "Cloud-First Project Management",
    "price": "Current priceE£599.99",
    "description": "The rapid evolution of cloud computing has transformed the way businesses manage projects. Cloud-first project management is no longer just an option—it’s a necessity for organizations looking to enhance efficiency, collaboration, and scalability. This course provides an in-depth understanding of cloud-first project management, offering learners the knowledge and tools needed to implement cloud-based strategies successfully.Throughout this course, you will explore the principles, benefits, challenges, and best practices of cloud-first project management. You will also get hands-on insights into leading cloud-based project management tools and real-world use cases. By the end of the course, you’ll be equipped to lead projects with a cloud-first mindset, leveraging automation, AI, and cutting-edge cloud technologies to drive success.Course Modules & Learning OutcomesModule 1: IntroductionWhat is Cloud-First Project Management?Learn what cloud-first project management entails and how it differs from traditional project management approaches.Understand the fundamental shift towards cloud-based tools and platforms.Evolution of Project Management to the CloudExplore the history of project management and how cloud computing has revolutionized workflows, team collaboration, and automation.Why Businesses are Adopting Cloud-Based Project ManagementDiscover the key reasons organizations are making the switch, including cost savings, remote accessibility, enhanced security, and real-time collaboration.Module 2: Core Principles of Cloud-First Project ManagementAccessibility & Remote CollaborationUnderstand how cloud-based platforms enable seamless teamwork, regardless of location, fostering global collaboration.Scalability & FlexibilityLearn how businesses can scale their project management processes without the need for heavy IT investments.Security & Data ProtectionGain insights into cloud security best practices and how to safeguard project data from threats.Automation & IntegrationExplore the power of automation in streamlining repetitive tasks, reducing errors, and enhancing efficiency.Cost EfficiencyAnalyze the financial benefits of cloud-based project management and how it reduces infrastructure costs.Module 3: Benefits of Cloud-First Project ManagementReal-Time Collaboration & CommunicationLearn how cloud-based tools enable instant communication and team collaboration, ensuring project success.Improved Productivity & EfficiencyDiscover how workflow automation and cloud-based solutions improve productivity and reduce delays.Seamless Workflow AutomationUnderstand how to integrate automation tools to streamline project management processes.Enhanced Data-Driven Decision MakingLeverage data analytics to make informed decisions and drive project success.Reduced IT Infrastructure CostsExplore how organizations can cut down on hardware, software, and maintenance costs by shifting to cloud solutions.Module 4: Key Cloud-Based Project Management ToolsTask & Workflow Management:Learn how to use Asana, Trello, and Jira to organize tasks and track progress.Collaboration & Communication:Discover how Slack, Microsoft Teams, and Zoom facilitate real-time discussions and meetings.File Storage & Sharing:Explore Google Drive, Dropbox, and OneDrive for seamless document management and sharing.Automation & Integration:Learn how Zapier and Make (formerly Integromat) enhance workflow automation.Analytics & Reporting:Understand how tools like Tableau, Power BI, and Google Data Studio provide valuable project insights.Module 5: Use Cases & Real-World ExamplesSoftware Development Teams (GitHub)See how development teams use cloud-based tools for version control, collaboration, and issue tracking.Digital Marketing Teams (Google Workspace)Explore how marketing teams utilize cloud platforms for content planning, campaign tracking, and real-time collaboration.Construction Project Management (Procore + Autodesk BIM 360)Understand how construction firms leverage cloud technology for project planning and execution.Online Course Creation (Kajabi + Canva)Learn how educators and content creators streamline course development and management using cloud-based solutions.HR & Recruitment (BambooHR)Discover how HR teams optimize recruitment, employee engagement, and performance tracking with cloud HR platforms.Module 6: Challenges & Solutions in Cloud-First Project ManagementSecurity & Data Privacy Concerns → Implementing Strong Access ControlsLearn strategies to protect sensitive data and manage user access effectively.Internet Dependency → Offline Functionality & Backup StrategiesExplore solutions for ensuring productivity even when internet access is limited.Change Management → Training Teams for Cloud AdoptionUnderstand how to successfully transition teams to a cloud-first approach through training and support.Tool Overload → Choosing the Right Stack for EfficiencyLearn how to select and integrate the right tools to avoid inefficiencies and redundancies.Module 7: Best Practices for Implementing Cloud-First Project ManagementSelecting the Right Cloud-Based ToolsUnderstand key factors in choosing the best cloud-based project management tools for your team.Establishing Clear Collaboration GuidelinesLearn how to set expectations and guidelines for effective communication and collaboration.Ensuring Strong Cybersecurity MeasuresDiscover best practices for securing cloud-based project management environments.Automating Repetitive Tasks for EfficiencyExplore how automation can save time and improve project outcomes.Regularly Reviewing & Optimizing Cloud WorkflowsLearn how to continuously improve and optimize cloud-based project management processes.Module 8: Future of Cloud-First Project ManagementAI & Machine Learning in Project ManagementExplore how artificial intelligence is transforming project management through predictive analytics and automation.Blockchain for Secure Project Data ManagementUnderstand how blockchain technology enhances security and transparency in project management.Hybrid & Multi-Cloud ApproachesLearn about the emerging trend of using multiple cloud providers for enhanced flexibility and security.Module 9: ConclusionSummary of Key TakeawaysReview the most important concepts covered in the course and how they apply to real-world project management.This course equips professionals, project managers, and teams with the expertise needed to effectively implement cloud-first project management strategies. By adopting cloud-based tools, automation, and security best practices, learners will be prepared to lead projects with greater agility, efficiency, and success in today’s digital-first world.",
    "instructor": "Justin Bateh, PhD, PMP",
    "requirements": [
      "Basic understanding of cloud first project management concepts",
      "Experience with collaboration and productivity tools (e.g., Google Workspace, Microsoft 365).",
      "Willingness to adapt to cloud-based workflows and technologie",
      "Familiarity with cloud computing fundamentals."
    ],
    "whatYouWillLearn": [
      "What is Cloud-First Project Management",
      "Core Principles of Cloud-First Project Management",
      "Benefits of Cloud-First Project Management",
      "Key Cloud-Based Project Management Tools",
      "Use Cases & Real-World Examples",
      "Challenges & Solutions in Cloud-First Project Management",
      "Best Practices for Implementing Cloud-First Project Management",
      "Future of Cloud-First Project Management"
    ],
    "content": [
      {
        "title": "Introduction",
        "subsections": [
          "Introduction to This CoursePreview02:33",
          "Who's This Course For?Preview01:57"
        ]
      },
      {
        "title": "Introduction to Cloud First Project Management",
        "subsections": [
          "What is Cloud-First Project Management?Preview03:38",
          "Evolution of Project Management to the CloudPreview02:56",
          "Why Businesses are Adopting Cloud-Based Project Management03:48",
          "Objectives5 questions"
        ]
      },
      {
        "title": "Core Principles of Cloud-First Project Management",
        "subsections": [
          "Accessibility & Remote Collaboration02:50",
          "Scalability & Flexibility02:42",
          "Security & Data Protection02:45",
          "Automation & Integration01:36",
          "Cost Efficiency02:04",
          "Objectives5 questions"
        ]
      },
      {
        "title": "Benefits of Cloud-First Project Management",
        "subsections": [
          "Real-Time Collaboration & Communication01:09",
          "Improved Productivity & Efficiency01:26",
          "Seamless Workflow Automation01:45",
          "Enhanced Data-Driven Decision Making02:24",
          "Reduced IT Infrastructure Costs02:04",
          "Objectives5 questions"
        ]
      },
      {
        "title": "Key Cloud-Based Project Management Tools",
        "subsections": [
          "Task & Workflow Management: Asana, Trello, Monday.com, Jira06:17",
          "Collaboration & Communication: Slack, Microsoft Teams, Zoom03:46",
          "File Storage & Sharing: Google Drive, Dropbox, OneDrive05:00",
          "Automation & Integration: Zapier, Make (formerly Integromat)01:17",
          "Analytics & Reporting: Tableau, Power BI, Google Data Studio02:37",
          "Objectives5 questions"
        ]
      },
      {
        "title": "Use Cases & Real-World Examples",
        "subsections": [
          "Software Development Teams (GitHub)04:13",
          "Digital Marketing Teams (Google Workspace)04:07",
          "Procore: Transforming Construction Project Management05:22",
          "Online Course Creation (Kajabi + Canva)04:55",
          "HR & Recruitment (BambooHR)03:04",
          "Objectives5 questions"
        ]
      },
      {
        "title": "Challenges & Solutions in Cloud-First Project Management",
        "subsections": [
          "Security & Data Privacy Concerns → Implementing Strong Access Controls01:36",
          "Internet Dependency → Offline Functionality & Backup Strategies01:39",
          "Change Management → Training Teams for Cloud Adoption02:20",
          "Tool Overload → Choosing the Right Stack for Efficiency02:15",
          "Objectives5 questions"
        ]
      },
      {
        "title": "Best Practices for Implementing Cloud-First Project Management",
        "subsections": [
          "Selecting the Right Cloud-Based Tools02:28",
          "Establishing Clear Collaboration Guidelines01:52",
          "Ensuring Strong Cybersecurity Measures02:10",
          "Automating Repetitive Tasks for Efficiency01:52",
          "Regularly Reviewing & Optimizing Cloud Workflows01:21",
          "Objectives5 questions"
        ]
      },
      {
        "title": "Future of Cloud-First Project Management",
        "subsections": [
          "AI & Machine Learning in Project Management01:27",
          "Blockchain for Secure Project Data Management01:28",
          "Hybrid & Multi-Cloud Approaches01:22",
          "Objectives5 questions"
        ]
      },
      {
        "title": "Conclusion",
        "subsections": [
          "Conclusion02:31"
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/6488841_3c5d_2.jpg",
    "category":"management"
  },
  {
    "id":"16",
    "title": "Change Management Theory for Proposal Managers",
    "price": "Current priceE£549.99",
    "description": "How many times have you tried to change a process, and your coworkers resist and complain so much that you just give up? Change is seriously hard work, but you can make it easier by using scientific models to persuade and support. Stop tearing your hair out, and develop a stronger approach with the help of these proven public health and community-building strategies. Join me as we make change easier, longer-lasting and ultimately more beneficial for your business!In this course, you will learn conversational skills that will help your stakeholders transition from \"no\" to \"maybe,\" and finally to \"yes, we're doing this!\"These conversational topics will build empathy for members of your organization, accelerate your emotional intelligence, and ultimately develop your proposal team into the change agents they were meant to be. No more order-taking, no more churning at the bottom of the organizational chart. You're empowered to drive the transformations that are required to get your job done the right way!This methodology is the proven scientific approach that has solved dozens of public health and social problems, from smoking cessation to cancer screenings, addiction recovery, and beyond. If it can work for such high-stakes change efforts, it can work for driving software adoption and having difficult conversations within your sales organization.",
    "instructor": "Kathryn Bennett",
    "requirements": [
      "No prerequisites for taking this course, you will learn everything you need to know"
    ],
    "whatYouWillLearn": [
      "Define change management challenges",
      "Apply the Transtheoretical Model for organizational change management",
      "Use scripts to support change management in interpersonal conversation",
      "Build internal coalitions to support change management"
    ],
    "content": [
      {
        "title": "Change Management Theories and Principles for Proposal Managers",
        "subsections": [
          "Defining the Problem of Change ManagementPreview17:20",
          "Supporting Precontemplators and Contemplators10:49",
          "Supporting Preparation and Action09:06",
          "Promoting an Environment for Maintenance06:39",
          "Community Building for Sustained Change12:18"
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/4563020_3cdc.jpg",
    "category":"management"
  },
  {
    "id":"17",
    "title": "Customer Success Basics by Practical CSM",
    "price": "Current priceE£1,199.99",
    "description": "New to customer success management (CSM)? This course can help you get up to speed with the fundamentals. This course address what CSM is and why it's important; what types of situations CSM applies to; and how CSM can help increase a company’s sales revenues and profitability. The course then reviews the 14 tenets (or guiding principles) of customer success. Collectively, these tenets outline the role of the CSM in ensuring that customer success occurs and that its benefits are realized by both the CSM's own company and its customers. This course can be taken on its own as an introduction to the topic, or as one in a series of courses from Practical CSM that build upon each other to cover the entirety of customer success management best practices in greater detail.In the Customer Success Fundamentals section, you will explore the key concepts that define Customer Success Management. This section answers essential questions, such as:What is Customer Success, and why is it important?Who is Customer Success important to?What is Customer Success Management?What types of sales situations does Customer Success Management apply to?How can Customer Success Management help to increase a company’s sales revenues?",
    "instructor": "Marek Malinowski",
    "requirements": [
      "There are no specific prerequisites for this course. It is designed for beginners and professionals alike. All you need is a keen interest in customer success and a willingness to learn. A basic understanding of business principles and familiarity with common business tools will be beneficial but not necessary."
    ],
    "whatYouWillLearn": [
      "Understand the fundamentals and importance of Customer Success and its management.",
      "Learn to develop and execute effective Customer Success strategies and measure outcomes.",
      "Master the role of a Customer Success Manager and their impact on retention and churn.",
      "Gain skills in customer advocacy, stakeholder engagement, and internal evangelization.",
      "Equip yourself with practical abilities that are critical to the Customer Success role."
    ],
    "content": [
      {
        "title": "Customer Success Fundamentals",
        "subsections": [
          "OverviewPreview02:34",
          "What is Customer Success ManagementPreview06:41",
          "How Does Customer Success Work?Preview04:59",
          "Customer Success and Different Business Types05:01",
          "Land and Expand Sales Motions04:30",
          "Customer Success and Customer Lifetime Value (CLV)03:36",
          "Customer Success and Customer Advocacy01:58",
          "Tenets of Customer Success - Part 1 of 506:50",
          "Tenets of Customer Success - Part 2 of 506:04",
          "Tenets of Customer Success - Part 3 of 505:39",
          "Tenets of Customer Success - Part 4 of 505:35",
          "Tenets of Customer Success - Part 5 of 504:47"
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/6491035_a3f6.jpg",
    "category":"management"
  },
  {
    "id":"18",
    "title": "Changing Employee Behaviours for Organizational Success",
    "price": "Current priceE£399.99",
    "description": "In the current highly competitive business landscape, businesses must prioritize various strategies to gain an edge. Among these strategies, focusing on employee behavior stands out as crucial. The behavior exhibited by employees directly affects the overall functioning and success of the company. Poor or unprofessional behaviours, such as being rude, disruptive, or lazy, can lead to decreased productivity, increased stress, and a negative public image.By prioritizing professional behaviors, such as respect, cooperation, and productivity, organizations can foster increased collaboration, elevated morale, and a favorable public image. As a result, employee behavior significantly influences the performance of the organization. This comprehensive and practical  course is designed to equip you with the essential strategies and tools needed to drive positive changes in employee behaviors, ultimately leading to improved organizational outcomes.In this course, you will learn how to:● Identify the importance of employee behaviours in organizational success.● Identify the key behaviours that contribute to organizational success.● Develop leadership strategies for monitoring and changing employee behaviours. ● Create a culture of positive behaviours in your organization.This course is designed for managers, leaders, and anyone who wants to enhance their ability to motivate others and drive success. The overview of this course:Identify ways that employees interact with each other, customers, and work.Identify ways that employees show up to work.Identify ways employees handle their responsibilities. Motivate and inspire others to achieve their best.Learn effective communication techniques.Learn motivational theories.Discuss practical strategies to engage and empower individuals and teams. Course Features1. Actionable Strategies: Practical techniques for real-world scenarios.2. Clear and Concise Breakdown: Well-structured, easy-to-follow course.3. Software Recommendations: Productivity tools recommended for enhanced learning.4. Additional Materials: Supporting resources like notes accompanying videos and assessments for targeted recall of key terms and concepts.5. Cultivating a growth mindset:  Empathy and effective leadership techniques.Software RecommendationsProductivity tools recommended for enhanced learning; such as learning calendar, diary, and others. RequirementsNo prior knowledge is required.Examples from leadership experiences would be helpful to draw on.If you're interested in learning more about leadership is crucial to changing employee behaviours and how it can impact organizational performance, I encourage you to join this course. Let's get started!",
    "instructor": "Modern Executive Development Centre",
    "requirements": [
      "No leadership experience required. You will learn the essential skills in this course."
    ],
    "whatYouWillLearn": [
      "Define employee behavior and explain its importance in organizational success",
      "Identify the key behaviors that contribute to organizational success",
      "Develop strategies for monitoring and changing employee behavior",
      "Create a culture of positive behavior in your organization"
    ],
    "content": [
      {
        "title": "Introduction",
        "subsections": [
          "IntroductionPreview02:08"
        ]
      },
      {
        "title": "Learning Outcomes",
        "subsections": [
          "Learning outcomesPreview00:57"
        ]
      },
      {
        "title": "Employee Behaviours",
        "subsections": [
          "Importance of Employee Behaviours in Organizational SuccessPreview03:05",
          "Importance of Leadership and Employee Behaviours For Organizational Success4 questions",
          "Identify Key BehavioursPreview03:38",
          "Key Behaviours that Contribute to Organizational SuccessPreview06:12",
          "Identify the Key Employee Behaviours that Contribute to Organizational Success3 questions",
          "Key Behaviours that Contribute to Organizational Success3 questions",
          "Examples of  that have Implemented Key Behaviours for Organizational Success01:28"
        ]
      },
      {
        "title": "Leadership Strategies to Manage and Monitor Key Behaviors",
        "subsections": [
          "Strategies for monitoring and changing employee behavior08:51",
          "Leadership Strategies to Manage and Monitor Key Behaviors5 questions"
        ]
      },
      {
        "title": "Culture of Positive Employee Behaviours",
        "subsections": [
          "Creating a culture of positive employee behaviours07:38",
          "Culture of Positive Employee Behaviours3 questions"
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/5408842_bead_4.jpg",
    "category":"management"
  },
  {
    "id":"19",
    "title": "Mastering Risk Management: Enterprise Risk & ERM Essentials",
    "price": "Current priceE£599.99",
    "description": "In today’s rapidly changing business environment, managing risk effectively is essential for sustainable success. This course, \"Mastering Risk Management: Enterprise Risk & ERM Essentials\", is designed to equip you with a deep understanding of risk management principles and Enterprise Risk Management (ERM) techniques. Whether you’re a beginner or an experienced professional, this course will teach you how to identify, assess, mitigate, and monitor risks in a structured, effective way.Through real-world examples, in-depth modules, and engaging case studies, you’ll learn to implement proven strategies for risk assessment, risk mitigation, and continuous improvement. By the end of this course, you’ll have the skills to contribute to your organization’s resilience and adaptability, positioning you as a valuable asset in today's competitive landscape. We will dive into the essentials of risk management and then progress into advanced techniques to manage risks comprehensively at the enterprise level.Why enrol in this course? By the end of the training, you’ll be able to identify and analyze various risks, implement mitigation strategies, and establish a continuous monitoring process that keeps your organization ahead of potential disruptions. This course is informative and practical, designed with exercises and real-life scenarios to reinforce each concept. Gain the confidence to apply risk management strategies to safeguard and enhance your organization’s performance.Enroll today and become a skilled risk management professional who can make strategic, risk-aware decisions that create value and sustain growth.\"",
    "instructor": "Course Konnect",
    "requirements": [
      "Basic Business Knowledge: A general understanding of business operations and functions is helpful but not mandatory.",
      "Interest in Risk Management: No prior experience needed, but an interest in understanding and managing business risks will be beneficial.",
      "Open to All Skill Levels: This course is designed for beginners and professionals looking to enhance their knowledge of enterprise risk management.",
      "No Special Tools Required: Learners only need a device (laptop, tablet, or smartphone) with internet access to access the course materials.",
      "Willingness to Learn: A proactive mindset and a willingness to engage with case studies and practical exercises."
    ],
    "whatYouWillLearn": [
      "Identify business risks: Learn to identify & differentiate strategic, operational, financial, and compliance risks, & their impacts on organizational stability",
      "Apply risk assessment techniques: Master risk assessment method like SWOT analysis & risk matrix to analyze risk impact & probability for better prioritization",
      "Develop mitigation strategies: Design effective risk mitigation plans using avoidance, reduction, sharing, and acceptance strategies in real-world scenarios.",
      "Utilize ERM frameworks: Implement and integrate enterprise risk management frameworks like COSO into organizational structures for a comprehensive approach.",
      "Monitor risk processes: Establish continuous monitoring and feedback loops for risk management to ensure consistent improvement and adaptability over time.",
      "Analyze case studies: Review real-world case studies to connect course concepts to practical applications and understand how successful businesses manage risk."
    ],
    "content": [
      {
        "title": "About the Course",
        "subsections": [
          "Know about your coursePreview12:44"
        ]
      },
      {
        "title": "About the topic",
        "subsections": [
          "All about the Risk Management21:56"
        ]
      },
      {
        "title": "The Spectrum of Risks in Business",
        "subsections": [
          "Types of Risks for Businesses18:41",
          "Self-Assessment Assignment: Identifying and Analyzing Business Risks2 questions"
        ]
      },
      {
        "title": "Is Risk Assessment crucial ??",
        "subsections": [
          "Risk Assessment and Analysis Techniques17:42"
        ]
      },
      {
        "title": "Turning Assessment into Action",
        "subsections": [
          "Strategies to Mitigate the Risk15:40"
        ]
      },
      {
        "title": "Need for Ongoing Risk Management",
        "subsections": [
          "Monitioring and Continous Improvment21:45"
        ]
      },
      {
        "title": "ERM to RM",
        "subsections": [
          "Connecting Enterprise RM to Traditional RM10:39"
        ]
      },
      {
        "title": "Finalization",
        "subsections": [
          "Key Takeaways14:48"
        ]
      },
      {
        "title": "Brainstorming Session",
        "subsections": [
          "Its time to Brainstorming!!29 questions"
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/6262023_853c_3.jpg",
    "category":"management"
  },
  {
    "id":"20",
    "title": "PMO-CP exam questions | PMO Practice mock tests 2025",
    "price": "Current priceE£599.99",
    "description": "PMO-CP Certification Exam Prep: Your Complete Guide to SuccessAre you ready to take your Project Management Office career to the next level? These comprehensive PMO-CP certification preparation exam questions are designed to help you master the concepts, methodologies, and best practices needed to excel in your certification exam.What You'll Learn from these mock questions:Our carefully structured questions cover all essential PMO-CP domains through eight focused modules:Module 1: Collecting Stakeholders' ExpectationsMaster the art of stakeholder analysis, engagement strategies, and requirements gathering. Learn to identify, prioritize, and manage stakeholder needs effectively while ensuring alignment with organizational objectives.Module 2: Defining and Balancing the PMO Mix of FunctionsExplore the various PMO functions and learn how to create the optimal mix for your organization. Understand how to balance strategic, tactical, and operational responsibilities while maximizing value delivery.Module 3 & 4: Establishing the PMO ProcessDive deep into PMO process design, implementation, and optimization. Learn best practices for creating standardized processes, governance frameworks, and methodology development that drive project success.Module 5: Defining the PMO Headcount and CompetenciesMaster resource planning and team development strategies. Learn to assess, define, and acquire the right mix of skills and competencies needed for a high-performing PMO.Module 6: Assessing the PMO Maturity and Planning its EvolutionUnderstand maturity models and assessment techniques. Develop strategies for continuous improvement and learn how to create effective PMO evolution roadmaps.Module 7: Calculating the PMO ROI (Return on Investment)Master the techniques for measuring and demonstrating PMO value. Learn to calculate, track, and communicate ROI metrics that justify PMO investments and showcase business impact.Module 8: Establishing the PMO Balanced ScorecardLearn to develop and implement comprehensive performance measurement systems. Create effective KPIs and balanced scorecards that align with organizational objectives.Course Features:Realistic practice questions aligned with the latest PMI exam content outlineDetailed explanations for all answers to reinforce learningPerformance analytics to track your progress and identify areas for improvementTime management techniques and exam strategiesInteractive quizzes and knowledge checks after each moduleReal-world examples and case studiesWho Should Take This Course:PMO professionals preparing for the PMO-CP certification examProject managers looking to transition into PMO rolesCurrent PMO staff seeking to validate their expertiseOrganizations wanting to upskill their PMO teamsJoin thousands of successful professionals who have used our courses to advance their careers. Start your journey toward PMO-CP certification today!",
    "instructor": "Master Course",
    "requirements": [],
    "whatYouWillLearn": [],
    "content": [
      {
        "title": "Practice Tests",
        "subsections": [
          "Teste 140 questions",
          "Teste 240 questions",
          "Teste 340 questions",
          "Teste 440 questions"
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/6424643_c604.jpg",
    "category":"management"
  },
  {
    "id":"21",
    "title": "Certified Medical Device Auditor (CMDA) Practice Test",
    "price": "Price not found",
    "description": "Hello Learners,Welcome to our course on \"Certified Medical Device Auditor (CMDA) Practice Test\".This practice test course is designed to help you prepare for passing the CMDA certification exam, conducted by the American Society for Quality (ASQ). This course includes two exam sets, each containing 135 unique questions—the same number of exam-style questions that will appear on the CMDA exam. Simulate the CMDA exam experience with a timed test. You’ll receive a score at the end, and have the option to review the questions to see how you did. This will help to assess your knowledge and build your confidence as you prepare for the exam. You can re-take each set of questions an unlimited number of times. The questions are created by me based on my knowledge and experience on the topic. This course also includes detailed explanations and rationales for each question. This will help you understand the underlying concepts and principles behind each question and enable you to learn from your mistakes and improve your performance on future tests. The Certified Medical Device Auditor (CMDA) is a professional who understands the principles of standards, regulations, directives, and guidance for auditing a medical device system while using various tools and techniques to examine, question, evaluate, and report on that system’s adequacy and deficiencies. A medical device auditor analyzes all elements of the system and reports on how well it adheres to the criteria for management and control of process safety.NOTE: ASQ is the registered trademark of the American Society for Quality.We are an independent training providing agency. We are neither associated nor affiliated with the certification organization(s) mentioned in our courses. The name and title of the certification exam mentioned in this course are the trademarks of the respective certification organization. We mention these names and/or the relevant terminologies only to describe the relevant exam processes and knowledge (i.e. Fair Use).The questions in this practice tests are not actual exam questions. Your performance on the these practice tests is for study purposes only, and may or may not reflect performance on an actual certification exam.DO YOUR BEST! Enjoy the course.Thanks & Best Regards,Seetharam Kandarpa, PMP, ASQ ConnEx Expert, ASQ CMQ/OE, ASQ CQA, ASQ CMDA, ASQ CSQE, ASQ CPGP, ASQ CSSGB, RAC Drugs, RAC DevicesFounder & Director- Shaarkview Consultancy",
    "instructor": "Seetharam Kandarpa",
    "requirements": [],
    "whatYouWillLearn": [],
    "content": [],
    "image": "https://img-c.udemycdn.com/course/240x135/5972144_8f79_2.jpg",
    "category":"management"
  },
  {
    "id":"22",
    "title": "Delivering Impact at Your Nonprofit through Accountability",
    "price": "Price not found",
    "description": "About this course...Delivering impact requires the accountability that will ensure your nonprofit truly delivers on its promises. It’s about being able to measure and demonstrate that your organization is making a real difference in the community and achieving the outcomes you set out to accomplish.What You Will LearnWhat impact accountability is, and how we define impact, accountability, and outcomes.A four-step accountability framework that can be applied across your entire organization.The difference between managing our performance-related outputs and our impact-related outcomes.How we define \"pressing social needs\" and their related impact data points.How to use an \"accountability manifesto\" to set organizational goals.The differences--and similarities--between motivation and accountability.Three nonprofit impact measurement frameworks: Five Dimensions of Impact, logic modeling, and Theory of Change, plus the concept of \"downward accountability.\"The 19 universal standards surrounding impact management, and a simple self-assessment to activate accountability.Who is this course for?This course is great for anyone in the nonprofit who wants to connect their work to the larger picture of impact that your organization seeks to make. With lots of work through models, reflections, and exercises, this series will help you think differently about your own role in being accountable for your mission and its outcomes.This learning path explores the following Korn Ferry competencies:Managing AmbiguityDirects WorkDriving Vision and PurposeBeing ResilientSituational Adaptability",
    "instructor": "Dr. Emilie Socash",
    "requirements": [
      "No prerequisites needed!"
    ],
    "whatYouWillLearn": [
      "What impact accountability is, and how we define impact, accountability, and outcomes.",
      "The difference between managing our performance-related outputs and our impact-related outcomes.",
      "How to use an \"accountability manifesto\" to set organizational goals.",
      "Three nonprofit impact measurement frameworks: Five Dimensions of Impact, logic modeling, and Theory of Change, plus the concept of \"downward accountability.\"",
      "A four-step accountability framework that can be applied across your entire organization.",
      "How we define \"pressing social needs\" and their related impact data points.",
      "The differences--and similarities--between motivation and accountability.",
      "The 19 universal standards surrounding impact management, and a simple self-assessment to activate accountability."
    ],
    "content": [],
    "image": "https://img-c.udemycdn.com/course/240x135/6113369_60dd.jpg",
    "category":"management"
  },
  {
    "id":"23",
    "title": "Managing the Service Environment",
    "price": "Current priceE£399.99",
    "description": "ARE YOU INTERESTED IN KNOWING HOW A SMALL ELEMENT CAN IMPACT YOUR BUSINESS?  DO YOU WANT TO GET RID OF THESE BAD ELEMENTS AND BRING POSITIVITY IN YOUR BUSINESS AND PULL IN MORE CUSTOMERS? JOIN THIS COURSE AND GAIN GOOD KNOWLEDGE ABOUT MANAGING THE SERVICE ENVIRONMENT.Who Should Enrol in this course?Anyone who is working in service sectors, Entrepreneurs, Super Market owners, Students, Graduates, Freshers and Working Professionals can join this course and develop this skill.Why Should You Enrol in this course?This course gives you in-depth knowledge about the Service Environment, How the interior designing, lighting, colors and elements can impact the business and customers.What you will learn from this course?You will learn the following from this course:-•Explain What is meant by Service Environment•Explain Roles of the Servicescape•List the Characteristics of Good Service Environment Design•Explain Types of Organizations Based on Servicescape•Explain Components of the Service Environment•Explain Types of Spatial Layouts & Functionality•Describe Aspects of Service Environment Design•Explain Interior Design as an Element of Servicescape•Explain Lighting as an Element of Servicescape•Explain Colors as an Element of Servicescape•Describe Role of Employees as Part of Service Environment•Describe Role of Manager as Part of Service Environment•Explain Russell Model of Affect of Consumer Behavior•Explain Factors of Servicescape that Affect Customers•List Tips for Servicescape to Affect Customer’s ExperienceHow is this course structured?The entire course is divided into 15+ modules all in video formats. The course begins with an interesting introduction part which emphasizes the need to learn this skill and covers all the basic points. As the course progress various important and advanced concepts are also covered.Real life examples and case studies are used to explain the advanced concepts and to make the course interesting. The entire course is explained using simple English. Images/Icons and infographics are used to add value to the content and make the course interesting.What are the prerequisites for joining this course?No prior experience or qualification is required for enrolling in this course. You need uninterrupted internet connection to watch the videos and basic understanding of English.How you will get benefitted from this course?After learning this course, you will become a Master in this skill. This course teaches you how to treat your customers, how employees can assist customers in choosing a service.  In addition to this you can also learn how to plan your spatial layout well. Make sure there is ample space inside the service location for customers to move and shop freely.DON'T MISS THE OPPORTUNITY, CLICK ON THE ENROL BUTTON AND START LEARNING!",
    "instructor": "Management Study Guide",
    "requirements": [
      "No prior knowledge is required"
    ],
    "whatYouWillLearn": [
      "Explain What is meant by Service Environment",
      "Explain Roles of the Servicescape",
      "List the Characteristics of Good Service Environment Design",
      "Explain Types of Organizations Based on Servicescape",
      "Explain Components of the Service Environment",
      "Explain Types of Spatial Layouts & Functionality",
      "Describe Aspects of Service Environment Design",
      "Explain Interior Design as an Element of Servicescape",
      "Explain Lighting as an Element of Servicescape",
      "Explain Colors as an Element of Servicescape",
      "Describe Role of Employees as Part of Service Environment",
      "Describe Role of Manager as Part of Service Environment",
      "Explain Russell Model of Affect of Consumer Behavior",
      "Explain Factors of Servicescape that Affect Customers",
      "List Tips for Servicescape to Affect Customer’s Experience"
    ],
    "content": [
      {
        "title": "Introduction",
        "subsections": [
          "IntroductionPreview04:37",
          "Explain What is meant by Service EnvironmentPreview00:31",
          "Explain Roles of the ServicescapePreview00:51",
          "List the Characteristics of Good Service Environment DesignPreview00:28",
          "Explain Types of Organizations Based on ServicescapePreview01:11",
          "Explain Components of the Service EnvironmentPreview13:25",
          "Explain Types of Spatial Layouts & Functionality03:45",
          "Explain Types of Spatial Layouts & Functionality03:05",
          "Explain Interior Design as an Element of Servicescape03:45",
          "Explain Lighting as an Element of Servicescape01:47",
          "Explain Colors as an Element of Servicescape06:55",
          "Describe Role of Employees as Part of Service Environment00:50",
          "Describe Role of Manager as Part of Service Environment03:26",
          "Explain Russell Model of Affect of Consumer Behavior00:47",
          "Explain Factors of Servicescape that Affect Customers06:11",
          "List Tips for Servicescape to Affect Customer’s Experience03:49"
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/2542645_ab1e.jpg",
    "category":"management"
  },
  {
    "id":"24",
    "title": "Leadership Skills: Three Key Skills Critical to Your Success",
    "price": "Price not found",
    "description": "The right people skills lead to personal and business success.WHAT STUDENTS ARE SAYING (AI): The learner appreciates the practical application of Brown's HST model in their daily life. They highlight that the updated course includes improved graphics and additional lectures. The 'Next Steps' section is praised for its instructiveness, despite some minor lighting issues (which have been fixed). Overall, they find the content consistently useful over an extended period.This course: Leadership Skills: Three Key Skills Critical to Your SuccessUsing your people skills to overcome business challenges is leading others so they can do their best work, working together, feeling valued and contributing in meaningful ways. There is synergy, a sense of belonging, a strong work ethic. And you will know how to make that happen.  You will learn proven tools to solve problems, make decisions, resolve conflicts, create teams and make organizational changes. You will learn how to include everyone and to balance business and human needs. What makes this course different? Trained in human behavior, I help business leaders and employees interact with each other and with customers in the most productive ways. This course has three major topics. 1) A decision making, problem solving tool (HST) which combines a concept from neuroscience (Type-2 Thinking) with one from psychology (Parallel Thinking). People work together to assemble a solution rather than debating different points of view. 2) A team building model I learned twenty years ago from its creator. It's the best one I know. 3) Using what you learned in 1 and 2, you'll be able to successfully make large and small organizational changes.1) I created HST soon after completing my doctoral dissertation in 1973. The model was first used with doctors to help patients better understand and follow their treatment plans. It has evolved over the years to become a universal decision-making and problem-solving tool. It is a tool you should have in your arsenal and is available online only in my courses.2) This section presents Rudy F. Williams' Four-Part Teaming Model, the best method I know after 40 years of teaming experience, including working with Olympic and professional sports teams, business teams and medical teams. I co-wrote a book on the model and co-conducted many workshops with Rudy. The Four-Part Teaming Model teaches you how to enhance individuality at the same time you create and sustain a team. This model can be used in business settings, sports, nonprofits, even families, anywhere a group of people want to support each other and achieve important goals.3) I created the HST Model for Change while teaching change management workshops. I realized that what I was teaching (the most popular change models) lacked important people elements that made them almost impossible to implement without undue stress and workarounds. Other change models focus on the business change and then help people accept and adjust. This model emphasizes emotions. The focus is on logic and emotions in every step of change. When logic and emotions are included, everything works better. By the end of this course, you will be able to successfully plan and lead just about any change effort.  (Change efforts fail to reach their goals 70% of the time.)The HST Model can enhance models you may currently use (such as Kotter or ADKAR), or as an effective stand-alone process. Either way, you will manage change in your organization with a greater chance of success. This course will give you a solid foundation of people skills to ensure your ability to work productively and enjoyably with others.Rock Solid Business Soft SkillsMy set of LEADERSHIP SKILLS courses is ideal if you want to significantly improve your soft skills as a leader, manager or employee. Each course presents a specific topic; you’ll dive deeply into the content and emerge with newly acquired ideas and rock-solid soft skills. Many of the ideas and skills are unique to this set of courses.Business is a balancing act of controlling and enabling others. As a leader/manager, you must be in charge, but also encourage the best from every worker. As you know, this isn’t easy. Make a mistake or two and everyone suffers. Rock solid skills have clear steps, easily followed and measured. And if you aspire to leadership, these skills will propel you upward.My courses follow that old saying, \"if you give a man a fish, you feed him for a day, if you teach him to fish, you feed him for a lifetime.\" I teach both skills and concepts. If you want both training and an education, this is the place, tools and ideas. Each course provides ideas to explore and skills to try out. You choose the topic and in about three hours or less, you’ll acquire rock solid soft skills enabling you to support and inspire your employees. Double asterisks (**) around a section or lecture denotes core material.This series of Leadership Skills courses is ideal for these topics: Entrepreneurship, Communication Skills, Management Skills, Business Fundamentals, Leadership Skills, Manager Training, Conflict Management, and Influence.",
    "instructor": "Robert Brown, Ph.D.",
    "requirements": [
      "You should be a current leader or someone who has some influence in a group. It is important to have a group situation where you can try out tools and models. This is a skill building course."
    ],
    "whatYouWillLearn": [
      "Make decisions, solve problems and resolve conflicts like an expert--because you'll know EXACTLY what to do",
      "Resolve most conflicts so they are win-win for all involved",
      "Help others having difficulty with decisions or problems.",
      "Become comfortable and competent as a team builder and a team leader",
      "Enhance individual performance and satisfaction through effective teamwork",
      "Learn how to promote the power of peer accountability",
      "Ensure organizational  change makes logical AND emotional sense",
      "Be able to create a change-ready organization",
      "Absolutely minimize resistance to change and maximize employee engagement"
    ],
    "content": [],
    "image": "https://img-c.udemycdn.com/course/240x135/6051149_c0da_3.jpg",
    "category":"management"
  },
  {
    "id":"25",
    "title": "Restaurant Management Event",
    "price": "Price not found",
    "description": "There is enormous opportunities in the restaurant industry but it takes a very careful planning to ensure that your company gets the needed market share in this stringent competition era. Brand reputation is very important in sustaining your customers as well as performing events in your restaurant that will attract more potential customer so that they can stay and keep on doing business with you. many research has shown greatly that restaurant events boost sales because more new people will come by and try your services. To increase sales in your restaurant through events, you have to make sure that all your things are in order such as clear environment, good food, good ambiance, decent chairs and great staff. For any restaurant events to be successful, there should be great internal marketing meaning management and employees must understand the goal of the event and how their contribution will help the business realize that goal. The next key point we need to understand is that proper budgeting is a very key factor in the success of any restaurant event. If the company can set up a clear financial budget and work within the budget then it will help in reducing waste and overspending.Happy customers keep coming to do business with you but bad customers sell your company negatively to others. The only way you can keep customers coming back is to properly develop policies that will make your customer come back to you such as make available free wi-fi, organize live music concert, host wine tasting event in your restaurant, organize holiday parties in your restaurant etc. after every event make sure that you measure the success rate of the event this will give you the practical insight into areas that need real improvement.",
    "instructor": "Eric Yeboah",
    "requirements": [
      "No special requirement",
      "Desire to learn more"
    ],
    "whatYouWillLearn": [
      "How to plan the best restaurant event",
      "Tips to entertain customers in your restaurant",
      "Tips for creating a restaurant event space",
      "Strategies to increase special event booking at your restaurant",
      "How to plan a corporate event",
      "Ways to measure restaurant event success",
      "Tips to create a memorable restaurant experience",
      "How to eat at a sit down restaurant",
      "Tips to increasing revenue at your restaurant",
      "How restaurant events boost business"
    ],
    "content": [],
    "image": "https://img-c.udemycdn.com/course/240x135/5305950_aeb3.jpg",
    "category":"management"
  },
  {
    "id":"26",
    "title": "Hybrid Teams and Future of Work: Fortune 500 Leaders",
    "price": "Price not found",
    "description": "Your ability to master hybrid teams best practices will determine whether you reach your business and career goals in the hybrid and remote future of work of our increasingly-disrupted post-COVID world.Unfortunately, our intuitive leadership style is adapted to pre-pandemic work arrangements in the office, and is poorly suited to the hybrid and remote future of work. Our gut reactions on hybrid teams best practices in the future of work can’t be trusted, as revealed by research in behavioral economics, psychology, and cognitive neuroscience. So how do the leaders of Fortune 500 companies make the right calls on hybrid teams best practices in the hybrid and remote future of work?They follow evidence-based hybrid teams best practices as revealed by such research. In this course, you will master techniques for gaining hybrid teams skills by drawing on cutting-edge behavioral science and real-world best practices from Fortune 500 leaders. After taking this course, you will:Master hybrid teams best practices used by Fortune 500 leaders to seize competitive advantage for their bottom lines and careers in the future of workMaximize productivity, engagement, retention, and morale in the hybrid and remote future of work through hybrid teams best practicesDevelop a plan with specific next steps to adapt for yourself the best practices used by Fortune 500 leaders for hybrid teams skillsDiscover how to lead collaboration and innovation most effectively through hybrid teams best practices in the hybrid and remote future of workLearn the dangerous judgment errors called cognitive biases that undermine successful leadership in the future of work and how Fortune 500 leaders defeat themFeel truly confident about whether you mastered the best hybrid teams best practices to make the right calls in the hybrid and remote future of workSounds too good to be true? These methods were successfully used by Aflac, Applied Materials, Entergy, Honda, Jones Lang LaSalle, IBM, Reckitt, Wells Fargo, and Xerox to dramatically improve the skills of their top executives, senior VPs, middle managers, and lower-level supervisors in leading telecommuting teams. I trained the leaders at these Fortune 500 companies, as well as at numerous middle-market companies and quickly-growing startups, on hybrid teams best practices. More broadly, I served for over 20 years as the CEO of the boutique future-proofing consultancy Disaster Avoidance Experts. Below is a sample testimonial from a recent training.Here’s a recent testimonial from Dan Rooney, Senior Vice President at Jones Lang LaSalle, a company ranked #186 by Fortune, speaking about the impact of my training:“Thank you for taking time out of your schedule to present to our Consulting team last week. The content was spot-on and provided a unique perspective into building culture, driving innovation and brainstorming across telecommuting and hybrid teams (among other things). I appreciate your willingness to partner leading up to the presentation to ensure the content was tailored for the audience – it made the discussion that much more impactful. I have received positive feedback from a number of team members and look forward to collaborating more in the future!”Here's another recent testimonial by Susan Winchester, the Chief Human Resource Officer at Applied Materials, a Fortune 200 high-tech manufacturing company:· “Hi, I'm Susan Winchester, and it's my delight and pleasure to tell you a little bit about our experience with Dr. Gleb. He had a big positive impact at Applied Materials. Our leaders and engineers love data-based, research-based insights, which is exactly what he brings. He hit it out of the park, and he used a team led process, which was incredibly engaging. He introduced us to a concept he created called asynchronous brainstorming. It was a process we used with hundreds and hundreds of leaders globally at the same time. We did this during our CEO kickoff session for our strategy work. In a very short amount of time, we were able to get great benefits. I also love the work he's doing to educate leaders around the power and positive benefits of hybrid and virtual working. And one of his techniques that I'm planning to use is what he calls “virtual coworking”, where you and as many coworkers as you'd like create a virtual meeting, no purpose or agenda, but rather just to be working with one another. I highly endorse Dr. Gleb's work with leadership teams.”Besides such real-world, pragmatic expertise, I have a strong academic background as a behavioral scientist studying hybrid teams, stakeholder engagement, and related fields. I spent 8 years at the University of North Carolina at Chapel Hill, first getting a PhD in the History of Behavioral Science and then serving as a lecturer there. Then, I spent 7 years as a professor at the Ohio State University, where I published dozens of peer-reviewed articles on this topic in high-quality academic journals such as Behavior and Social Issues and Journal of Social and Political Psychology. Thus, this course is thoroughly informed by cutting-edge research.This combination of business and science led to my expertise gaining global recognition. I published over 650 articles and gave over 550 interviews to prominent venues. They include Harvard Business Review, Fast Company, Fox News, USA Today, CBS News, CNBC, Time, Business Insider, Government Executive, The Chronicle of Philanthropy, Inc. Magazine, and Fortune.Further attesting to my global renown, my work was translated into Chinese, German, Russian, Korean, Polish, Spanish, French and other languages.That's what you can expect in this course: methods used successfully at even the biggest companies to seize competitive advantage, thoroughly informed by cutting-edge research, and featured in top media venues and best-selling books around the globe.Course Content and Structure OverviewThe course is self-paced, consisting of modules which the participants can complete any time they want.For each module, participants in the course will first read book chapters from the textbook. Then, participants will answer questions in the book chapters. Each chapter has references for additional readings that participants are invited to check out for additional context on any concepts about which they wish to learn more.Next, participants will watch the video for each segment, which uses case studies to apply the content of the readings to real-life scenarios.After each video, the participants should journal for 20-30 minutes to answer the questions in the prompts.This is an intermediate-level course: at least a year of real-world experience in a professional setting is required to appreciate the strategies and case studies outlined in the class.I look forward to welcoming you into the world of evidence-based, science-driven techniques tested in the real world of many Fortune 500 companies and numerous middle-market companies and startups. To ensure that you master the secrets of Fortune 500 companies to help yourself seize competitive advantage in hybrid teams best practices for the sake of your bottom line and your career, register now!",
    "instructor": "Dr. Gleb Tsipursky",
    "requirements": [
      "You need to trust hybrid teams best practices from Fortune 500 leaders and behavioral science-based findings over going with outdated advice stemming from pre-pandemic work arrangements to seize a competitive advantage in the hybrid and remote future of work"
    ],
    "whatYouWillLearn": [
      "Master hybrid teams best practices used by Fortune 500 leaders to seize competitive advantage for their bottom lines and careers in the future of work",
      "Maximize productivity, engagement, retention, and morale in the hybrid and remote future of work through hybrid teams best practices",
      "Develop a plan with specific next steps to adapt for yourself the best practices used by Fortune 500 leaders for hybrid teams skills",
      "Discover how to lead collaboration and innovation most effectively through hybrid teams best practices in the hybrid and remote future of work",
      "Learn the dangerous judgment errors called cognitive biases that undermine successful leadership in the future of work and how Fortune 500 leaders defeat them",
      "Feel truly confident about whether you mastered the best hybrid teams best practices to make the right calls in the hybrid and remote future of work"
    ],
    "content": [],
    "image": "https://img-c.udemycdn.com/course/240x135/4935980_1579.jpg",
    "category":"management"
  },
  {
    "id":"27",
    "title": "Planning Management",
    "price": "Price not found",
    "description": "This comprehensive course is designed to equip participants with essential skills in planning and scheduling for effective project management. Through a blend of theoretical knowledge and practical applications, participants will learn to develop intricate project plans, optimize resource allocation, and create robust schedules. Topics include project scope definition, work breakdown structures, critical path analysis, resource leveling, risk management, and advanced scheduling tools and techniques. Participants will engage in hands-on exercises, real-world case studies, and simulations to master project management software like Microsoft Project and Primavera P6. By the end of this course, students will possess the expertise to create efficient project schedules, anticipate potential challenges, and implement strategies for successful project completion. Join us and elevate your planning and scheduling skills to new heights. Learn the art of efficient project planning and scheduling in this comprehensive course. Dive into essential concepts, tools, and techniques to optimize resource allocation, manage timelines, and ensure project success. Master the skills that can elevate your career in project management. Join our in-depth course to master the art of strategic planning and scheduling. Dive into advanced techniques, tools, and real-world case studies. Acquire the skills to streamline operations, meet deadlines, and drive project success. Elevate your career with this essential expertise.",
    "instructor": "Mohamed Saieed",
    "requirements": [
      "You will learn every thing you need to work in Planning time management"
    ],
    "whatYouWillLearn": [
      "Time Management",
      "Time Control",
      "Planning and Scheduling",
      "Project Control"
    ],
    "content": [],
    "image": "https://img-c.udemycdn.com/course/240x135/5598696_5b28_3.jpg",
    "category":"management"
  }
]