[
  {
    "title": "Business Fundamentals",
    "price": "Current priceE£599.99",
    "description": "First of All, Thank You for Your Interest in This Course!In this course, we’ll discuss how to create a business plan using a very simple methodology.If you’re reading these lines, it’s likely because you have a business idea that you’d like to validate before launching it to the market. Perhaps you’re an experienced entrepreneur creating a business plan to secure investment and scale your existing business. Or maybe you’re a student preparing a final project and need a practical guide for reference.Whatever your motivation may be, my goal with this course is to help you:Better understand the importance of creating a business plan before taking the leap.Structure a business plan and understand the steps involved.Learn through practical examples.Create your own business plan.Entrepreneurship is challenging but incredibly rewarding for everything you can learn and achieve along the way.Creating a business plan is extremely valuable—not just because it gives you a document to present to others, but because the process itself equips you with exceptional preparation for meetings with investors, clients, or even hiring employees for your project.This course is designed to help you create a business plan using a straightforward methodology.By the end of the course, you’ll have a clearer understanding of the key concepts involved in creating a business plan, explored practical examples, and applied your new knowledge.Shall we begin?",
    "instructor": "J. Xie",
    "requirements": [
      "No prior experience needed: This course is designed for beginners and anyone looking to create a business plan, whether you’re a first-time entrepreneur, a seasoned business owner, or a student.",
      "Basic computer skills: Familiarity with tools like Microsoft Word, Google Docs, or similar platforms to draft your business plan.",
      "Motivation and an idea (optional): While having a business idea is helpful, it’s not required—you can use the course to develop one along the way.",
      "A willingness to learn: An open mind and enthusiasm for gaining practical insights and skills to create a professional business plan."
    ],
    "whatYouWillLearn": [
      "The Importance of a Business Plan: Understand why creating a business plan is critical for the success of your idea",
      "Step-by-Step Business Plan Creation: Learn how to structure and write a comprehensive business plan, covering all the key sections with ease.",
      "Practical Examples and Case Studies: Gain insights from real-world examples to better understand concepts and apply them effectively.",
      "Market Research and Analysis: Master the techniques to identify your target market, analyze competitors, and position your business for success.",
      "Financial Planning: Learn how to create financial projections, estimate costs, and determine your break-even point to convince investors"
    ],
    "content": [
      {
        "title": "Your Business Plan Step by Step",
        "subsections": [
          "IntroducciónPreview02:25",
          "What is a Business Plan and When is NeededPreview02:56",
          "The Importance of the Business PlanPreview02:05",
          "The Questions that Every Business Plan must AnswerPreview03:06",
          "Value Proposition04:07",
          "Values, Mission, and Vision01:59",
          "The Team03:00",
          "The Product02:21",
          "Competition06:03",
          "Potential Market02:30",
          "Financial Plan Introduction03:39",
          "Cash Flow Projections01:57",
          "Profit and Loss Projection02:01"
        ]
      },
      {
        "title": "Business Metrics",
        "subsections": [
          "Introduction01:13",
          "Types of Metrics01:56",
          "Selecting the right Metrics03:06",
          "Revenue Growth02:49",
          "Customer Acquisition Cost (CAC)01:15",
          "Customer Lifetime Value (CLV)01:02",
          "Net Promoter Score (NPS)02:07",
          "Conversion Rate01:40",
          "Cash Flow02:41",
          "Profitability Percentage02:04",
          "Burn Rate and Runway03:20",
          "Gross Margin01:59",
          "Break-Even Point01:32",
          "Active Users01:29",
          "Churn Rate02:01",
          "Retention Rate02:01",
          "Acquisition Channels01:18"
        ]
      },
      {
        "title": "Entrepreneurship: A Challenging but Rewarding Journey",
        "subsections": [
          "Entrepreneurship: A Challenging but Rewarding Journey02:10"
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/6361993_57dd.jpg"
  },
  {
    "title": "Importation Made Easy Using Aliexpress As A Tool",
    "price": "Current priceE£599.99",
    "description": "Do You Want to start a profitable importation business but don’t know where to begin?Whether you're looking to import for personal use or build a successful e-commerce business, this course will take you from beginner to pro, unlocking the secrets of sourcing, importing, and selling products profitably from AliExpress.AliExpress has made global importation easier than ever—but knowing what to buy, how to buy, and how to sell is the difference between success and failure. This course will remove all guesswork and provide you with a step-by-step system to import high-demand products at low costs and resell them for maximum profit! No More Middle Man.No prior experience needed – We start from scratch and guide you every step of the way, Real-life demonstrations – Watch step-by-step how to place orders, track shipments & resolve issues, Insider secrets & expert tips – Learn hidden strategies for getting discounts, avoiding scams & selling fast, Turn your importation into profit – Master the skills to turn small investments into consistent earnings.This course is designed to give you everything you need to succeed in the AliExpress importation business! Whether you want to import for personal use or start a profitable business, this course is your shortcut to success.Enroll now and start your journey to becoming a successful importer today!",
    "instructor": "James Ejoha",
    "requirements": [
      "A Laptop or A Smart phone",
      "Internet Connection",
      "An Email Account",
      "A Payment Method – Such as a credit/debit card, PayPal, or other AliExpress-supported payment options for making purchases"
    ],
    "whatYouWillLearn": [
      "Mastering The Importation Process",
      "Understanding Shipping Customs And Taxes",
      "Building A Profitable Importation Business",
      "Handle Orders Refunds And Customer Services"
    ],
    "content": [
      {
        "title": "Introduction to Importation Business",
        "subsections": [
          "Understanding Importation: What It Is and How It WorksPreview10:42",
          "Why Choose Importation Over Other Businesses?09:32",
          "Benefits & Challenges of Importation08:37",
          "Key Terminologies in Importation & E-commerce08:19",
          "History of Global Importation & E-commerce Growth03:19"
        ]
      },
      {
        "title": "Understanding AliExpress as an Importer’s Tool",
        "subsections": [
          "What is AliExpress? The Role of Alibaba Group12:44",
          "How AliExpress Works: A Complete Overview21:12",
          "Pros and Cons of Using AliExpress for Importation10:31",
          "The Difference Between AliExpress, Alibaba, and Other E-commerce Platforms08:04",
          "Understanding the Buyer Protection Policy on AliExpress07:26"
        ]
      },
      {
        "title": "Getting Started with Importation on AliExpress",
        "subsections": [
          "How to Set Up and Secure Your AliExpress Account09:52",
          "How to Navigate the AliExpress Website & Mobile App11:47",
          "How To Navigate the AliExpress Mobile App03:15",
          "Understanding Product Categories and Search Filters05:53",
          "Choosing Between Dropshipping and Bulk Importation06:22",
          "Common Mistakes Beginners Make and How to Avoid Them07:35"
        ]
      },
      {
        "title": "Product Selection and Supplier Verification",
        "subsections": [
          "How to Find the Best-Selling and Profitable Products08:27",
          "How to Analyze Product Reviews & Seller Ratings09:49",
          "How to Identify Reliable and Legitimate Suppliers08:06",
          "Avoiding Scams and Fraudulent Suppliers on AliExpress03:59",
          "Negotiation Tips for Getting Better Prices and Deals09:21"
        ]
      },
      {
        "title": "Shipping and Delivery Strategies",
        "subsections": [
          "Understanding Shipping Options on AliExpress (ePacket, Standard Shipping, DHL, e04:52",
          "How to Estimate Shipping Costs and Delivery Time03:04",
          "Customs Duties, Import Taxes, and How They Affect Your Business04:45",
          "How to Track Your Order and Solve Delivery Issues02:54",
          "How to Speed Up Your Delivery Process06:24"
        ]
      },
      {
        "title": "Ordering & Payment Methods",
        "subsections": [
          "Step-by-Step Guide to Placing Your First Order03:13",
          "Understanding AliExpress Payment Methods (Card, PayPal, Escrow, etc.)03:14",
          "Currency Exchange, Transaction Fees, and Cost Considerations03:10",
          "How to Use Coupons, Discounts, and Promo Codes to Save Money02:48",
          "Refunds, Disputes, and How to Handle Issues with Orders03:03"
        ]
      },
      {
        "title": "Practical Session – Live Importation of a Product",
        "subsections": [
          "Selecting a Real Product to Import04:51",
          "Placing an Order in Real-Time02:58",
          "Tracking the Order from AliExpress to Final Destination04:21",
          "Handling Any Shipping/Customs Issues in Real-Time07:31",
          "Receiving the Product and Quality Checking04:47"
        ]
      },
      {
        "title": "Selling Your Imported Products for Maximum Profit",
        "subsections": [
          "How to Set Competitive Pricing for Imported Goods07:28",
          "Choosing the Right Selling Platforms (Instagram, Facebook, Jiji, Shopify, etc.)06:51",
          "How to Market Your Products Effectively (SEO, Ads, Influencers)04:48",
          "Customer Service & Handling Complaints Professionally05:18",
          "Scaling Your Business for Higher Profits05:20"
        ]
      },
      {
        "title": "Unique Strategies for Success in Importation Business",
        "subsections": [
          "Advanced Product Research Using AI & Market Trends04:41",
          "Secret Hacks to Get Discounts and Special Deals on AliExpress05:42",
          "How to Create a Brand Around Your Imported Products05:18",
          "Building a Loyal Customer Base for Long-Term Profitability07:20",
          "How to Transition from Small Importation to Large-Scale Business07:38"
        ]
      },
      {
        "title": "Final Steps – Building a Sustainable Importation Business",
        "subsections": [
          "Creating a Business Plan for Long-Term Success07:05",
          "How to Source for Capital and Funding for Importation06:18",
          "Expanding Beyond AliExpress: Other Importation Platforms to Consider07:25",
          "Building a Team and Hiring Assistants to Scale Your Business08:20",
          "Course Wrap-Up: Next Steps and Additional Resources07:08"
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/6469791_b1bc.jpg"
  },
  {
    "title": "Fiverr 2023: Learn The Basics And Start Selling!",
    "price": "Current priceE£399.99",
    "description": "Hi Future Fiverr Sellers, my name is Muhammad Hashir, and I have years of Fiverr experience. I am well-versed in Fiverr SEO and Graphic Design. I also run the largest Fiverr community on Discord, with over 3900 members. My sales strategies have been updated to work with the Fiverr 2023 algorithms. You will be given lifetime access to a private Discord server after purchasing this course, where you can ask me questions about the course and talk to your fellow sellers.Do you need help getting started on Fiverr or perhaps you can't get any sales?  Then this is the course for you. In this course, you will learn how to finish your profile, create professional gigs, and Fiverr Search Engine Optimization (SEO) within the site. Below are some of the essential things you will learn:- How to write a clear, professional, and word-rich description- How to get the top 10% in Fiverr Tests by providing answer keys through Discord.- How to find buyers with eye-catching photos- How to write a clear title- How to use Fiverr gig analytics your advantage- Certificate of Completion- Access to a private Discord Server- Lifetime Seller SupportI look forward to helping you get started with your Fiverr career and hope I can get your gigs kick-started.",
    "instructor": "Muhammad Hashir",
    "requirements": [
      "There are no requirements for experience, Just have a Fiverr account. This course is for newbies just starting out with Fiverr."
    ],
    "whatYouWillLearn": [
      "By the end of this course, you will have learned how to:  Finish your profile, create your first gig, and begin selling!",
      "During this course, you will be learning advanced selling strategies such as Fiverr SEO, clear and word-rich descriptions, and clear titles.",
      "This course will also teach you how to get in the top 10% of Fiverr Test Takers.",
      "Certificate of Completion: Finishing 100% of this course will reward you with a certificate to show your dedication to the course.",
      "You will learn how to use Fiverr gig analytics to your own advantage"
    ],
    "content": [
      {
        "title": "Introduction",
        "subsections": [
          "What will you learn?00:19",
          "How to create a Fiverr account.Preview00:50"
        ]
      },
      {
        "title": "How to setup your Fiverr Profile",
        "subsections": [
          "How to set up your Fiverr profilePreview02:10"
        ]
      },
      {
        "title": "Set up your first Fiverr Gig and take Fiverr Tests",
        "subsections": [
          "Fiverr Tests02:10",
          "Fiverr Gig setupPreview11:10"
        ]
      },
      {
        "title": "How to optimize description and tags",
        "subsections": [
          "How to optimize your tags to get sales03:11",
          "How to optimize your description01:36"
        ]
      },
      {
        "title": "How to analyze Fiverr analytics and how to use it to your advantage.",
        "subsections": [
          "How to use Fiverr gig analytics03:02"
        ]
      },
      {
        "title": "How to use Fiverr support, Fiverr Pro, and course recap.",
        "subsections": [
          "Fiverr Support02:42",
          "About Fiverr Pro01:45",
          "Course Recap and key takeaways01:58"
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/5429020_2394_3.jpg"
  },
  {
    "title": "Course Creator: Create, Launch & Sell Your Own Online Course",
    "price": "Price not found",
    "description": "If you are looking to make passive income online without trading your time for money, then read on!There is nothing more stressful than trying and researching every single way possible to make money online and not finding the perfect solution or investing alot of money that you are not sure you will ever see again.Well, what if I told you that you actually have the solution already, and you just need to find it out?I know how it feels. A couple of years ago, I was trading my time for money just in order for me to able to pay rent at the end of the month and not end up homeless, while still putting myself through depression to finish my studies.It is a miserable situation to be financially free, where you can literally do anything you want and fly anywhere you want, whenever you have the urge to.Although freelancing is a great way to make money online, it is still not the best way out there.Getting paid $10 an hour through online income is still considered as a job, as you don't have the most valuable item in the world, which is time.Being wealthy doesn't mean having 1 million dollars in your bank account.Being wealthy means having the freedom to do whatever you want to do in your life without any obstacles.Having the skill to trade your time for money, also means that this skill can be monetized in a way, where you can achieve passive income and wake up on PayPal buzzing your phone informing you that you got yet another purchase.And if you think monetizing this skill needs a HUGE budget or more than 100k Instagram followers, then think again.You don't even need to spend any budget on ads and all of your traffic can come from totally organic reach.Let me tell you one thing, you just hit the jackpot.Introducing: Coursesy Course Creator!Coursesy Course Creator is an online course that will help you discover your hidden skill that you can monetize online by writing, outlining, designing, filming, editing, and publishing it as your own profitable online course. The step-by-step guide modules are shaped in a way to take you through a smooth transition from acquiring the entrepreneurial mentality and discovering you talent all the way to finalizing and scaling your online course to a passive income machine.We understand that although this course has everything you need to start your journey from point A to point B, it might not be for everyone. That's why we are offering money-back guarantee for all students!",
    "instructor": "Ali Matar",
    "requirements": [
      "No previous experience needed!"
    ],
    "whatYouWillLearn": [
      "Brainstorm, Create, Shape and Sell Your Own Successful Online Course",
      "Make Money Passively Online",
      "Learn How to Make Money from Teaching an Online Course",
      "Learn How to Correctly Price Your Course"
    ],
    "content": [],
    "image": "https://img-c.udemycdn.com/course/240x135/5531870_952b_2.jpg"
  },
  {
    "title": "Create Business Model Canvas Step by Step with Templates",
    "price": "Current priceE£599.99",
    "description": "Unlock the power of the Business Model Canvas (BMC) to streamline your business strategy and achieve sustainable success. This comprehensive course provides step-by-step guidance to help you create a clear, actionable BMC tailored to your business. Designed for entrepreneurs, startup founders, business strategists, and professionals, this course simplifies complex business concepts into a single, easy-to-understand visual framework.You’ll learn how to define customer segments, craft compelling value propositions, identify key resources and activities, and develop sustainable revenue streams. Through real-world examples and hands-on exercises, you’ll explore how companies like Apple, Airbnb, and Amazon structure their BMCs for success and apply those insights to your own business.Whether you’re launching a new venture, refining an existing business model, or exploring innovative strategies, this course will equip you with the tools to align every aspect of your business with your goals. You’ll also learn to adapt your BMC as your business grows, ensuring it remains relevant in a changing market.No prior business experience is required—this course is designed for learners at all levels. By the end, you’ll have a complete BMC that provides clarity, focus, and a roadmap for sustainable growth. Join us and take the first step toward mastering the Business Model Canvas, transforming your ideas into a successful, scalable business strategy.",
    "instructor": "Dr. Amar Massoud",
    "requirements": [
      "No prior business experience required; beginners are welcome.",
      "A willingness to learn and apply business concepts.",
      "Basic understanding of business operations is helpful but not necessary."
    ],
    "whatYouWillLearn": [
      "Create a complete and actionable Business Model Canvas.",
      "Analyze and align customer needs with business strategies.",
      "Identify key resources, activities, and partnerships effectively.",
      "Develop sustainable revenue streams and cost structures."
    ],
    "content": [
      {
        "title": "Introduction",
        "subsections": [
          "IntroductionPreview06:34",
          "Our Use Case - EcoHome SolutionsPreview03:35"
        ]
      },
      {
        "title": "Step 1: Defining Customer Segments",
        "subsections": [
          "Step 1: Defining Customer Segments08:32",
          "Defining Customer Segments for EcoHome Solutions1 question"
        ]
      },
      {
        "title": "Step 2: Crafting Value Propositions",
        "subsections": [
          "Step 2: Crafting Value Propositions08:37",
          "Crafting Value Propositions for EcoHome Solutions1 question"
        ]
      },
      {
        "title": "Step 3: Determining Channels",
        "subsections": [
          "Step 3 - Determining Channels08:19",
          "Determining Channels  for EcoHome Solutions1 question"
        ]
      },
      {
        "title": "Step 4 - Building Customer Relationships",
        "subsections": [
          "Step 4 - Building Customer Relationships06:42",
          "Building Customer Relationships for EcoHome Solutions1 question"
        ]
      },
      {
        "title": "Step 5 - Developing Revenue Streams",
        "subsections": [
          "Step 5 - Developing Revenue Streams09:10",
          "Developing Revenue Streams for EcoHome Solutions1 question"
        ]
      },
      {
        "title": "Step 6 - Identifying Key Resources",
        "subsections": [
          "Step 6 - Identifying Key Resources07:55",
          "Identifying Key Resources for EcoHome Solutions1 question"
        ]
      },
      {
        "title": "Step 7 - Outlining Key Activities",
        "subsections": [
          "Step 7 - Outlining Key Activities07:19",
          "Outlining Key Activities for EcoHome Solutions1 question"
        ]
      },
      {
        "title": "Step 8 - Establishing Key Partnerships",
        "subsections": [
          "Step 8 - Establishing Key Partnerships07:30",
          "Establishing Key Partnerships for EcoHome Solutions1 question"
        ]
      },
      {
        "title": "Step 9 - Defining Cost Structure",
        "subsections": [
          "Step 9 - Defining Cost Structure09:20",
          "Defining Cost Structure for EcoHome Solutions1 question"
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/6273543_9bdf.jpg"
  },
  {
    "title": "Zero Cost traffic Case Study",
    "price": "Current priceE£399.99",
    "description": "INTRODUCTION      \t   The Zero Cost Traffic Case Study course does not tell you how to get zero cost traffic it shows you through actual case studies step by step how to get the zero cost traffic you need for your site. YouTube is now the largest source of zero cost traffic on the internet and this course shows you how to raid YouTube for that traffic. This course is about principles and methods that work and the case studies use methods that still continue to work even though YouTube has moved the goal posts over and over again. If you want unlimited zero cost traffic to your site this is the course for you.      \t  These Zero Cost Traffic Case Studies are among the most detailed hands on training available to online marketers. This is not about hype but about tactics and principles that have worked in the past on YouTube and still work today. The concepts and principles of this course are timeless and the opportunities for success are greater than ever because the use of video is increasing year on year and today's marketers are so often not prepared to do the preparation work to ensure their long term success.      \t WHY WEBSITE TRAFFIC IS NECESSARY      \t   Traffic come in two forms paid and free. This course is about free unlimited ongoing traffic. Organic traffic and free traffic that comes in from the search engines - rather than traffic that is paid for with the likes of Google Adwords or Bing Ads.      \t    If you have the #1 position on Page 1 of Google for a keyword, then you'll get about 73% of the traffic that looks at that search results page. The lower down the page you are, the less traffic will come your way. So it's vital that you position highly for your keywords.      \t   Traditional methods work but it's a lot of work and it takes a considerable amount of time. Using these methods, a site can take anywhere from 1-3 months to gain any traction on the rankings.      \t THE BEAUTY OF THE ZERO COST TRAFFIC CASE STUDY      \t   Using video to promote your sites is much less labor intensive, is more time efficient and sees faster results in site rankings.      \t   This course does not teach you how to make videos - there are plenty of tools and courses that will teach that, it shows you how to turn those videos into a never ending stream of free traffic to your site.      \t   What the Zero Cost Traffic Case Study teaches is a specific strategy for ranking websites high in the search engines. But more than that, results happen quickly. While videos rank quickly, sometimes within just minutes of being uploaded, the ultimate goal is to get those videos to boost your website in the search engine rankings as well as driving traffic to your website.      \t   The result is that you can dominate a whole page in Google. That could mean your website and videos take the the top 8-10 positions on a search result page. And you know how powerful that would be!      \t   The Zero Cost Traffic Case Study is a video training course that shows you the easiest and best way to get your videos - and your website - to the first page of Google as quickly as possible. There are 6 Modules in the course:      \t Module 1: Strategy Walk Through  \t      \t   This outlines the strategy in this course that you will use to drive traffic to your websites. It contains 10 videos, total running time: 101 minutes.      \t Module 2: Backlink Building      \t   While this course is primarily about a specific YouTube strategy, getting links from other sites should also be part of your backlinking strategy. In this module, you'll be introduced to some backlinking strategies that not many use, yet they are some of the most powerful techniques you can use to raise the profile of your site.      \t   This module contains 7 videos, total running time: 72 minutes      \t Module 3: Keyword Research And Understanding Keywords      \t   Not a module to be skipped if you're already familiar with keyword research. Here you'll learn the right way to go about choosing keywords, why you choose those keywords and how the search engines learn your relationship with those keywords. Understanding how the search engines see your the relationship between your website and your keywords is crucial. You'll also discover how to use keywords the right way in promoting your website.      \t   This module contains 5 videos with a total running time of 60 minutes.      \t Module 4: Introducing The Case Study Website      \t   This course demonstrates how a particular website was promoted to gain high ranking in Google. That site is introduced in this module along with some specific SEO tweaks that are designed to maximize how Google sees the site.      \t   5 videos, total running time: 57 minutes.      \t Module 5: Case Studies      \t   In this module, several case studies are presented showing just how successful the Zero Cost Traffic Case Study strategy is boosting a site's ranking in Google and how Page #1 for a keyword can be dominated.      \t   7 videos, total running time: 154 minutes.      \t Module 6: Video Creation      \t   Many people are reticent about appearing in front of a camera in their own videos. While this is not a course on video creation, this module provides several ideas on how you can go about creating your own videos if you don't want to appear in camera or don't want to record using your own voice.      \t   There are 3 videos in this module with a running time of 45 minutes.      \t Module 7: Conclusion      \t   Summing up what you will have learned from taking this course.      \t   1 video; running time: 13 minutes.      \t WHAT THIS COURSE WILL DO FOR YOU      \t   You start with one video and create a butterfly effect that can displace the competition with devastating effect.      \t   And, rather than working against Google, as can happen with older SEO techniques, Google gets behind you because they own YouTube.      \t   Take this YouTube Training course now and learn how to dominate Google without the hassle and pain of using traditional backlinking methods",
    "instructor": "Lighthouse Lifestyle Academy",
    "requirements": [
      "A desire to succeed",
      "YouTube is Completely online based and do not need to do installations on your computer",
      "Disciplined approach to follow the step by step instructions",
      "Initally 20-30 minutes per day then 1 hour per week",
      "Perserverance as this course is very detailled designed to help you succeed",
      "Access to free courses on Udemy about how to create videos"
    ],
    "whatYouWillLearn": [
      "To teach you how to drive 1000's of free visitors to your website",
      "To show you how to dominate the search engines with your videos",
      "To enable you to be successful online with an unlimited supply of targeted visitors",
      "How to optimize your video and channel to rank for those keywords"
    ],
    "content": [
      {
        "title": "Welcome To The Course",
        "subsections": [
          "Zero Cost Traffic Case Study - Introduction11:47"
        ]
      },
      {
        "title": "Zero Cost Traffic Case Study - YouTube",
        "subsections": [
          "YouTube overview14:47"
        ]
      },
      {
        "title": "Zero Cost Traffic Case Study -Google Keyword Search Tool",
        "subsections": [
          "Using Google Keyword Search Tool - The Basic Steps17:16",
          "Using Google Keyword Search Tool - Exact Keyword Searches12:56"
        ]
      },
      {
        "title": "Zero Cost Traffic Case Study - Google Keyword Search Tool Zoning In On Keywords",
        "subsections": [
          "Google Keyword Search Tool - Targetting Search Keywords and Phrases14:25",
          "Google Keyword Search Tool - Getting Google To Show Us The Best Keywords11:01"
        ]
      },
      {
        "title": "Zero Cost Traffic Case Study - First Case Study - Dog Breeds",
        "subsections": [
          "Dog Breeds Case Study - Keyword Search Laying The Foundations18:28",
          "Dog Breeds Case Study -In Deepth Building Our Keyword ListPreview10:16",
          "Dog Breeds Case Study -Targetting The Best Keywords and Channel Settings19:34",
          "Dog Breeds Case Study - Advanced Targetting Of Our Keywords19:20",
          "Dog Breeds Case Study - Using Our New Videos To Target Our Keywords16:20",
          "Dog Breeds Case Study - Results So Far17:33",
          "Dog Breeds Case Study - Results Update - First Signs of Success16:34",
          "Dog Breeds Case Study - Results Update - Domination Has Begun09:44",
          "Dog Breeds Case Study - Results Update - Progress Slow But Steady17:31",
          "Dog Breeds Case Study -Results Update - Success No 1 On Google16:09"
        ]
      },
      {
        "title": "Zero Cost Traffic Case Study - How to make money online",
        "subsections": [
          "Case Study - How To Make Money Online - Setting Up The Foundation For Success14:24",
          "Case Study - How To Make Money Online - Results Update - Top Rankings11:21",
          "Case Study - How To Make Money Online - Results Update Slow and Steady19:34",
          "Case Study - How to make money online - Results Update - Dominating Google16:50",
          "Case Study - How To Make Money Online - Results Update -Power Of Other Videos19:34",
          "Case Study - How To Make Money Online - Results Update - The Power Of Series16:50"
        ]
      },
      {
        "title": "Zero Cost Traffic Case Study - Home Business Case Study",
        "subsections": [
          "Case Study - Home Business - Laying The Foundation20:27",
          "Case Study - Home Business - Resurrecting A Neglected Site19:00",
          "Case Study - Home Business - Results Update - Success Is Guaranteed19:14",
          "Case Study - Home Busness - When A Keyword is Not A Keyword10:54",
          "Case Study - Home Business -Results Update16:22",
          "Case Study - Home Business -Results Update -Sure and Steady Steps to No 108:05",
          "Case Study - Home Business - Results Update - Yet More Slow But Steady Progress17:38",
          "Case Study - Home Business - Content, Interaction and Backlinks = Google Love17:16",
          "Case Study - Home Business - Results Update - The Good The Bad And The Ugly15:05",
          "Case Study - Home Business - Results Update- Success Achieved Daily18:19"
        ]
      },
      {
        "title": "Zero Cost Traffic Case Study - Bonus",
        "subsections": [
          "Zero Cost Traffic Case Study - You Tube basics11:34",
          "Zero Cost Traffic Case Study - How To Make Free Online Videos08:10"
        ]
      },
      {
        "title": "Zero Cost Traffic Case Study - The Next Step",
        "subsections": [
          "Zero Cost Traffic Case Study - What Did We Just Do - Conclusion12:39",
          "Zero Cost Traffic Case Study - What YOU Should Do Next03:53"
        ]
      },
      {
        "title": "Zero Cost Traffic Case Study - Extra",
        "subsections": [
          "Zero Cost Traffic Case Study - Google Keyword Planner - New Tool Same Principles16:48"
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/240388_b3f2_6.jpg"
  },
  {
    "title": "How to sell your agency: all the steps to get acquired",
    "price": "Current priceE£399.99",
    "description": "Do you own an agency?If you’re looking to sell your agency, you have come to the right place. If you're not looking to sell your agency just yet, or perhaps not at all, knowing what the process involves will mean you are prepared should the time come or should you change your mind.When I sold my agency it changed my life.After starting from scratch and running my marketing agency for ten years, I sold it in March 2021 and left two weeks later.I learned so much from the process of preparing my agency for sale and meeting with twelve potential buyers. Knowing what to expect and laying the groundwork in advance meant achieving the perfect sale, for me, my team and clients.I’m ready to pass this knowledge on, so you can achieve your perfect sale too. This is the course I wish I had taken before I started down the journey of selling.In this course I cover:Creating a sale-ready agencyPreparing an impressive information deckFinding and approaching buyersSeeking help from a broker (or going it alone)Having successful meetings with potential buyersProgressing your sale to receiving offersNegotiating and completing due diligenceI'll talk you through everything I learned during this process. If you're intentional about selling your business, this course will help you make it happen. Selling your agency can mark a huge milestone in your career. It could create incredible freedom, from a financial, location and headspace perspective. Knowing what to expect could mean you negotiate better and achieve a higher multiple and better terms.I'm here to demystify the entire process for you - let's do this.",
    "instructor": "Jodie Cook",
    "requirements": [
      "Take this course if you own an agency that you might want to sell one day"
    ],
    "whatYouWillLearn": [
      "Gain clarity on exactly what you want from a sale",
      "How to create a sale-ready agency that is appealing to buyers",
      "How to identify and approach prospective buyers",
      "How to have successful conversations and negotiations with buyers",
      "How to progress your sale through to completion"
    ],
    "content": [
      {
        "title": "Introduction and preparing your agency for sale",
        "subsections": [
          "Introduction to this course and what to expectPreview02:48",
          "Get clear on what you want from your sale24:26",
          "The six components of a sale-ready businessPreview12:30",
          "Putting together an impressive information document09:32"
        ]
      },
      {
        "title": "Finding, approaching and meeting potential acquirers",
        "subsections": [
          "Finding potential buyers04:15",
          "The power of your existing network02:29",
          "Approaching potential buyers08:20",
          "Should you use a broker?06:36",
          "How to structure an initial meeting with a potential buyer13:24"
        ]
      },
      {
        "title": "Negotiate and close your deal",
        "subsections": [
          "Inviting offers for your agency04:57",
          "Expertly negotiating your sale10:12",
          "Closing the deal and final steps10:22"
        ]
      },
      {
        "title": "Course conclusion",
        "subsections": [
          "Don't forget and further resources04:09",
          "Over to you00:55"
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/4593388_14be.jpg"
  },
  {
    "title": "Etsy Print on Demand Beginner To BEST SELLER",
    "price": "Current priceE£399.99",
    "description": "Welcome To Our Print on demand 2023 CourseMODULE 1: OPENING YOUR ETSY SHOPI will Walk you through Step by Step on how to create your Etsy Shop. And How to Avoid Suspension .and Also what you can Do if a Suspension Happened . You will Learn how to Build a Beautiful Shop That make any one Wants to Buy From you.MODULE 2: Find TrendsWe Will Find the Latest Trending T-shirts Using many Sources. and How to Use Facebook ads, Twitter Trends Google Trends Google Shopping ,Amazon,Etsy ,Redbubble ... To Find the BEST NICHE for you.MODULE 3: Check The Copyright and TrademarkYou Will Learn How to Check if this Design Contains a Copyright Materials to Avoid Suspension on your Etsy Shop.MODULE 4: Create Designs using PhotoshopYou will Learn How to Create a Similar Design to the Trending One To Avoid Being Reported by the Original Creator.MODULE 5: How To Find The Best Keywords with CHATGPTWe Will Use the AI ChatGPT Bot which is the most important tool since modern search engines (to give us the Most Good Keywords for our Listing. MODULE 6 Bonus: Create HIGH QUALITY Unique Design by Artificial Intelligence in Few Seconds . and How to Make a shirt with it",
    "instructor": "Ennachat Ayoub",
    "requirements": [
      "No requirements or prerequisites besides having a positive mindset."
    ],
    "whatYouWillLearn": [
      "How To Create Your Etsy Shop",
      "How To Find Trending T-shirt That are Sold in The Last 24 Hours",
      "How To Check The Copyright and Trademark or a Design",
      "How To Create the Design using Photoshop",
      "How To Find The Best Keywords For your Shirt to Rank Higher On Etsy",
      "Bonus: Create Design by Artificial Intelligence in Seconds"
    ],
    "content": [
      {
        "title": "Create Your Etsy Shop",
        "subsections": [
          "Setting up Etsy Seller AccountPreview08:38"
        ]
      },
      {
        "title": "How To Find Trending T-shirt That are Sold in The Last 24 Hours",
        "subsections": [
          "Amazon TrendsPreview08:05",
          "Etsy Trends02:55",
          "Twitter Trends03:30",
          "Redbubble Trends04:28",
          "Google Trends and Google Shopping Research03:02",
          "News Sites02:33",
          "Facebook Ads Research Tool03:36"
        ]
      },
      {
        "title": "Check The Copyright and Trademark",
        "subsections": [
          "Checking Copyright and Trademark02:52"
        ]
      },
      {
        "title": "Using Photoshop to Create Designs",
        "subsections": [
          "Photoshop07:29"
        ]
      },
      {
        "title": "Keywords and Description Research Using ChatGPT",
        "subsections": [
          "Keywords and Description Research (ChatGPT)05:31"
        ]
      },
      {
        "title": "Create Design with AI in Seconds",
        "subsections": [
          "Create Design by Artificial Intelligence in Seconds05:55"
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/5067900_94b8_3.jpg"
  },
  {
    "title": "How to Write a Music Business Plan For Busy Professionals",
    "price": "Current priceE£399.99",
    "description": "There is a saying in the marketing world.  If you fail to plan, you plan to fail.  This course is aimed at helping you to succeed in your music business.  After all, it's what you've been dreaming of your whole life.  Therefore, you will want to succeed.  You will want to make it in the music world.  So, I want you to make it in the music world too.How to Write a Music Business Plan for Busy Professionals is built to help you structure your business plan, with questions that prompt you to think of each section with clarity and thoroughly.  Furthermore, the course is built for busy working professionals who have little time. It is comprised of no more than 15 videos with a total running time of just over an hour.  However, what makes it appealing to busy professionals is that it is full of bitesize videos with questions that will help you to formulate an exceptionally effective music business plan.If you have a business as a band, a music software developer (DAWs, VST plugins, virtual studio software), a manufacturer of hardware instruments, a record label, or any other business in the music industry, this course will help you.Whether you are just starting your business, or if you've been working for some weeks, months or years, this course will help you to develop a winning plan for business success.",
    "instructor": "David Verney",
    "requirements": [
      "The course assumes you are either planning or running a music business."
    ],
    "whatYouWillLearn": [
      "By the end of this course, you will have a fully functioning business plan",
      "The course will encourage you to think about every aspect of your business plan.",
      "Plan to succeed with a presentable professional music business plan",
      "You will be able to attract investment from investors, financial instiutions and stakeholders."
    ],
    "content": [
      {
        "title": "Introduction",
        "subsections": [
          "Course trailerPreview04:40",
          "Why is it so Important to Have a Business Plan?Preview03:07",
          "Introduction to the TutorPreview03:23"
        ]
      },
      {
        "title": "Your Business Plan",
        "subsections": [
          "Executive Summary03:24",
          "Business Description04:55",
          "Market Research05:11",
          "Market Analysis04:14",
          "Marketing and Sales Strategy05:45",
          "Product Line04:10",
          "Operations and Management04:51",
          "Financial Plan05:04",
          "SWOT Analysis05:16",
          "Risk Management10:38",
          "Appendix06:02"
        ]
      },
      {
        "title": "BONUS Section",
        "subsections": [
          "BONUS LECTURE:  Connect With Me on Social Media00:09"
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/5910340_6686_2.jpg"
  },
  {
    "title": "How to Monetize Your Personal Brand",
    "price": "Current priceE£399.99",
    "description": "Jon Barnes, author of Creative Threads and Brand Thyself, has spent years mastering the art of personal branding, content creation, and digital entrepreneurship. From coaching and training to viral online content, Jon has built a career around turning creativity into revenue. Now, in How to Monetize Your Personal Brand, he’s sharing his proven formula to help you transform your credibility into cash.This course is designed for creatives, entrepreneurs, coaches, consultants, and professionals who want to leverage their expertise, audience, and reputation into sustainable income streams. You’ll learn how to identify what people truly want from you, package your skills into sellable assets, and deploy your brand in ways that generate consistent revenue. Jon’s insights, strategies, and real-world examples will equip you with the tools to confidently build and scale your personal brand into a profitable business.By the end of this course, you will:• Understand the link between credibility and monetization• Learn how to identify and create revenue-generating opportunities• Develop a strategy to package your expertise into products or services• Explore real-world deployment scenarios and launch methods• Gain actionable techniques for marketing and selling your brandHere's the deal… If you have massive personal and professional goals but haven’t figured out how to turn your credibility into cash… this is the most important course you can take right now.Many people want to make money from their personal brand. Some will even take steps to do it—but very few will actually succeed. Without a clear strategy, it’s too easy to get overwhelmed by the process.Let’s be real here. Yes, there’s a lot to figure out—what to sell, who to sell it to, and how to package it. And even after you’ve nailed the concept, executing the right strategy can feel like an endless game of trial and error.In today’s crowded market, it can feel impossible to stand out—or even put into words what you have to offer and why it’s valuable. That’s why so many people pour weeks or months into building a personal brand, only to give up before they ever make a single dollar.They burn out. They lose momentum. And they leave serious money on the table. But not you.What You’ll Get in This CourseIn this course, Jon Barnes—author of Creative Threads and Brand Thyself—shares his proven framework for turning personal brand credibility into real income. With Jon’s expert guidance, you’ll learn how to identify what people truly want from you, package your expertise into sellable assets, and deploy a monetization strategy that actually works.You’ll get a firehose of training in 7 power-packed modules of video content, plus downloadable resources to accelerate your success. You’ll learn the start-to-finish process of personal brand monetization—not just marketing activities, but real strategies for making money in a way that fits who you are and where you want to go.This isn’t about TikTok trends or becoming an influencer. This is for professionals, entrepreneurs, and creatives who are serious about building sustainable income from their personal brand.The 7 Modules:• Introduction – The mindset shift from personal brand to profitable brand• Trading Credibility for Cash – How to leverage reputation into revenue• What Do People Really Want From You? – Uncovering your most valuable offerings• Converting Credibility into Sellable Assets – Turning knowledge into products and services• Deployment Scenarios – Real-world strategies to launch your monetization plan• Show and Tell – Visibility, storytelling, and showcasing your expertise• Closing – Your roadmap for long-term brand-based incomeWhy This Course MattersMaking money from your personal brand isn’t reserved for influencers and bestselling authors. You don’t need millions of followers or a flashy online presence.You just need the right framework.Jon’s process has worked for countless professionals, and now, you can just copy his blueprint—step by step. No guesswork. No fluff. Just a clear, repeatable system for turning your expertise into real income.The Good News…EVERYONE has the potential to monetize their brand.And with the right process, ANYONE can!If you’ve tried before and failed, chances are you were focused on the wrong things. It’s not about churning out content or spending endless hours on marketing activities.It’s about YOU—your credibility, your expertise, and your ability to package and sell your value in a way that works.That’s exactly what this course will teach you.If you’re ready to stop leaving money on the table and start turning your brand into a business, let’s get started.",
    "instructor": "Jon Barnes",
    "requirements": [
      "Starting out or underway with creating your personal brand"
    ],
    "whatYouWillLearn": [
      "Understand the link between credibility and monetization",
      "Learn how to identify and create revenue-generating opportunities",
      "Develop a strategy to package your expertise into products or services",
      "Explore real-world deployment scenarios and launch methods",
      "Gain actionable techniques for marketing and selling your brand"
    ],
    "content": [
      {
        "title": "Introduction",
        "subsections": [
          "IntroductionPreview08:27"
        ]
      },
      {
        "title": "Let's Rock and Roll",
        "subsections": [
          "Trading Credibility for CashPreview14:25",
          "What Do People Really Want From You?19:11",
          "Converting Credibility into Sellable Assets27:52",
          "Deployment Scenarios45:58",
          "Show and Tell17:20"
        ]
      },
      {
        "title": "Closing",
        "subsections": [
          "Closing02:23"
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/6461511_33d7_6.jpg"
  },
  {
    "title": "Poultry Farming Customer Service",
    "price": "Price not found",
    "description": "Poultry is a commercial business which helps a man maintain his/her economy. In the agricultural  industry, poultry production is a prime example, which vertically integrates. This industry has two divisions and these are, poultry meat production and egg production. The layers  gives us eggs and from broilers, we can get meat. In fact, the poultry business is praise able and beneficial activity and one may improve this business by reading these notes. Remember that communication is the key to good customer service. No matter what format you use- in person over the phone or online, make sure that you have polite and clear communication with your customers. Having clear, simple policies will help present minor complaints from turning into large problems. Make sure these policies are posted in your physical business and online.   Many business leaders overestimate their company's ability to provide good customer service. Be honest with yourself about how happy your customers are with your services and products. A customer satisfaction survey will allow you to get a more objective view of how well you are providing customer service. Use your customers as a resource for learning about new techniques for dealing with problems. You might also learn about how your competition might handle customer service issues.",
    "instructor": "Eric Yeboah",
    "requirements": [
      "Desire to understand poultry",
      "No special requirement"
    ],
    "whatYouWillLearn": [
      "How to ensure excellent customer service",
      "How to find sales leads",
      "Successful poultry retailing starts with the client",
      "Poultry farming marketing plan",
      "How to increase your earnings in poultry farming",
      "Ways to make your poultry products stand out"
    ],
    "content": [],
    "image": "https://img-c.udemycdn.com/course/240x135/6108069_f05f_2.jpg"
  },
  {
    "title": "Online Arbitrage Business",
    "price": "Current priceE£399.99",
    "description": "Arbitrage is the practice of taking advantage of a difference in prices in two or more market- striking a combination of matching deals to capitalize on the difference, the profit being the difference between the market prices at which the unit is traded. when used by academics an arbitrage is a transaction that involves no negative cash flow at any probabilistic or temporal state and a positive cash flow in at least one state; in simple terms, it is the possibility to instantaneously buy something for a low price and sell for a higher price. Retail arbitrage involves purchasing products from brick- and-mortar retail stores at a discount and then reselling them on Amazon at a higher price. This strategy capitalizes on discrepancies in pricing between different marketplaces or clearance sales in physical stores. Online arbitrage follows a similar concept but takes place entirely on the internet. Sellers source products from various online retailers or e-commerce platforms at discounted prices and resell them on Amazon for a profit.  Online arbitrage is also relatively easy to start, as it can be done from the comfort of your own home. Begin by visiting online retailers and e-commerce platforms to search for discounted products. To save time and increase efficiency, you may consider using specialized online arbitrage tools such as tactical arbitrage, which can help you identify profitable deals across multiple websites.",
    "instructor": "Eric Yeboah",
    "requirements": [
      "Desire to learn more about arbitrage",
      "No special requirement"
    ],
    "whatYouWillLearn": [
      "Top Amazon online arbitrage tips fro successful selling",
      "Retail arbitrage versus online arbitrage: choosing the right sourcing strategy for Amazon",
      "How to calculate arbitrage in forex",
      "Covered interest arbitrage",
      "How to make money on Amazon with online arbitrage",
      "Conditions for arbitrage"
    ],
    "content": [
      {
        "title": "Introduction",
        "subsections": [
          "IntroductionPreview02:09",
          "What is arbitragePreview02:55",
          "Arbitrage-free pricing approach for bondsPreview04:40",
          "Conditions for arbitragePreview02:27",
          "Price convergence02:36",
          "Risks of arbitrage03:49",
          "Types of arbitrage04:56"
        ]
      },
      {
        "title": "Top Amazon Online Arbitrage Tips For Successful Selling",
        "subsections": [
          "Market research strategies01:55",
          "Optimizing product listings02:11",
          "Effective pricing tactics01:31",
          "Leverage Amazon's FBA program01:21",
          "Managing inventory efficiently01:59",
          "Utilize Amazon SEO02:01",
          "Leverage backend keywords in Amazon02:30",
          "Use Ecom circle tools02:52"
        ]
      },
      {
        "title": "Retail Arbitrage Versus Online Arbitrage: Choosing The Right Sourcing Strategy",
        "subsections": [
          "Understanding retail arbitrage and online arbitrage01:40",
          "Getting started with retail arbitrage and online arbitrage01:24",
          "Challenges of retail arbitrage and online arbitrage01:02",
          "Comparing retail arbitrage and online arbitrage03:31"
        ]
      },
      {
        "title": "How To Calculate Arbitrage In Forex",
        "subsections": [
          "Understanding arbitrage and the forex market05:16",
          "Calculating arbitrage04:25",
          "Using arbitrage as a trading strategy02:40"
        ]
      },
      {
        "title": "How To Make Money On Amazon With Online Arbitrage",
        "subsections": [
          "What is online arbitrage06:33",
          "How to get started with online arbitrage02:37",
          "Types of products to sell on Amazon00:49",
          "How to analyze product to resell on Amazon03:10"
        ]
      },
      {
        "title": "Covered Interest Arbitrage",
        "subsections": [
          "Covered Interest arbitrage01:33"
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/6182487_cb97_2.jpg"
  },
  {
    "title": "Freelancing - Client Hunting Training Course",
    "price": "Current priceE£399.99",
    "description": "Welcome to \"Freelancing - Client Hunting Training Course,\" a simple and practical course designed to help all types of freelancers find clients and sell their services. Whether you're just starting out or looking to improve your client-hunting skills, this course will guide you every step of the way to success.You’ll learn how to identify freelance opportunities and pitch your services in a way that gets noticed. Whether you’re a graphic designer, writer, virtual assistant, web developer, social media manager, or video editor, educator, instructor , coach, this course will show you how to build a standout portfolio that makes you stand out from the crowd. You’ll also discover how to communicate professionally, negotiate deals confidently, and manage clients effectively for long-term relationships.We’ll cover essential topics like setting fair rates for your services, understanding contracts, and maintaining a steady workflow. You’ll also get real-world tips on finding clients not just on freelancing platforms but also through networking and direct outreach. The goal is to help you take consistent steps toward growing your client base and income.This course is designed for everyone from graphic designers to content creators, marketers, programmers, and virtual assistants, or any other professional who wants to boost their client-hunting skills. By the end, you’ll have clear, actionable strategies to find and secure clients, allowing you to grow your freelance business confidently and steadily. Whether you are a beginner or an experienced freelancer, this course will inspire and equip you to take your freelancing career to the next level!",
    "instructor": "Yasir N",
    "requirements": [
      "No prior freelancing experience needed—this course is beginner-friendly.",
      "Basic computer skills and internet access are required.",
      "A willingness to learn and adapt to the freelancing environment.",
      "A computer or device to access freelancing platforms and complete assignments."
    ],
    "whatYouWillLearn": [
      "Master freelance platforms to find and secure projects.",
      "Create a compelling portfolio to attract clients.",
      "Develop professional communication and negotiation skills.",
      "Manage freelance business operations for long-term success."
    ],
    "content": [
      {
        "title": "Introduction",
        "subsections": [
          "Introduction to FreelancingPreview11:29",
          "Test your knowledge3 questions",
          "Client Communication and TipsPreview08:00",
          "Skills to Learn and Legal GuidancePreview06:55",
          "Profile, Proposals, Emails & Pricing09:19",
          "Test your knowledge3 questions",
          "Clients, Team, Outsourcing & ProjectsPreview07:19",
          "Test your knowledge3 questions",
          "5 Secret Tips Gathered from Successful FreelancersPreview02:17",
          "The Best Approach that works for Everyone02:14"
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/5954206_1ccc.jpg"
  },
  {
    "title": "Eyelash Extensions: Work-From-Home Business Course for Moms",
    "price": "Current priceE£599.99",
    "description": "Eyelash Extensions – Work-From-Home Business Course for MomsImagine turning your passion for beauty into a flexible, profitable business – all from the comfort of your home.Meet Sarah – a busy stay-at-home mom who loved beauty but never had the time (or money) to invest in a full-time career. She wanted something flexible, something that allowed her to be there for her kids while still contributing financially. That’s when she discovered classic eyelash extensions – and within months, she built a thriving home-based business that fit perfectly into her lifestyle.And guess what? You can do the same!This course is designed specifically for moms who want to learn the art of classic lash extensions while creating a real income from home. Even if you have zero experience, we’ll walk you through everything step by step so you can feel confident and ready to take your first clients!What You’ll Learn: How to apply classic lash extensions like a pro The secret to long-lasting lash retention (so clients keep coming back!) How to set up your own lash studio at home – even in small spaces Pricing, branding & marketing tips to attract your first paying clients How to book appointments & manage clients like a business ownerYou’ll get easy-to-follow videos, expert guidance, and ongoing support from a community of other moms building their dream careers.No need for expensive startup costs, no overwhelming schedules – just a simple, step-by-step guide to helping you launch a home-based lash business that works around your life. So, are you ready to start something amazing? Enroll today and take the first step toward your new career in beauty!  Join now & start your lash journey today!",
    "instructor": "Debora Leivalt",
    "requirements": [
      "No prior experience is needed! This course is designed for beginners. You will learn everything step by step. The only things you’ll need are a steady hand, patience, and a willingness to practice. For hands-on training, you may need a basic lash kit (lashes, adhesive, tweezers, and a mannequin or practice model), but we’ll guide you through choosing the right tools!"
    ],
    "whatYouWillLearn": [
      "Master the basics of classic eyelash extensions, including application techniques and lash mapping for different eye shapes.",
      "Learn how to set up a home-based lash business, including workspace setup, pricing, and client management.",
      "Develop essential branding and marketing skills, using social media and photography to attract clients and grow your business.",
      "Handle common challenges confidently, such as dealing with client concerns, retention issues, and maintaining professional hygiene standards."
    ],
    "content": [
      {
        "title": "Introduction",
        "subsections": [
          "IntroPreview00:41",
          "Welcome & Course OverviewPreview01:28",
          "Why Lash Extensions? (Flexible & Profitable Business for Busy Moms)Preview04:57",
          "Products & What You Need to Start (Essential Tools Without Breaking the Bank)Preview03:41",
          "Understanding Lash Types & Styles (Choosing the Right Look for Your Clients)03:43"
        ]
      },
      {
        "title": "Getting to Know Your Lash Tools & Setup",
        "subsections": [
          "Setting Up a Home Lash Studio (How to Create a Professional Space in Any Room!)Preview05:41",
          "Lash Mapping for Beginners (Making Every Set Look Flawless)06:51",
          "Social Media for Mompreneurs (Using Instagram & Facebook to Attract Clients FromPreview04:26",
          "Creating Your Own Lash Brand (Making a Name for Yourself in the Beauty Industry)05:13"
        ]
      },
      {
        "title": "Step-By-Step Lash Application – Your First Clients!",
        "subsections": [
          "Creating a Comfortable Experience for Clients (How to Make Clients Feel at Home)06:23",
          "Model introPreview03:48",
          "Step-by-Step Lash Application (Techniques for Beautiful, Lasting results)09:06",
          "Keeping Lashes Healthy & Long-Lasting (Retention & Aftercare Advice)06:35"
        ]
      },
      {
        "title": "Pricing, Policies & Making Money from Home!",
        "subsections": [
          "How Much to Charge (Making a Profit While Keeping Prices Fair)07:00",
          "Setting Policies & Booking Rules (Handling Cancellations & No-Shows)07:49",
          "How to Talk to Clients & Get More Referrals (Building a Loyal Client Base)06:50"
        ]
      },
      {
        "title": "Taking Stunning Lash Photos & Building Your Business Online",
        "subsections": [
          "How to Take Amazing Lash Photos (Even If You Only Have a Phone!)Preview06:03",
          "Editing Photos to Look Professional (Apps & Easy Tricks to Make Your Work StandPreview04:08",
          "Branding Yourself as a Lash Artist (How to Get Noticed in Your Local Area!)Preview05:13"
        ]
      },
      {
        "title": "Common Challenges & How to Overcome Them",
        "subsections": [
          ": Fixing Lash Retention Issues (What to Do If Clients Lashes Are Falling Out)05:20",
          "Handling Difficult Clients Like a Pro (How to Stay Calm & Professional)Preview05:25",
          "Dealing with Allergies & Sensitivities (Keeping Clients Safe & Comfortable)06:12"
        ]
      },
      {
        "title": "Your Next Steps – Turning Your Skills Into a Full-Time Business!",
        "subsections": [
          ": How to Grow Your Home-Based Business04:08",
          "Recap of Everything You’ve Learned (Your Quick-Start Guide to Success!)Preview03:23",
          "Course Completion & Certification (You’re Ready to Start! What’s Next?)02:09",
          "Thank you!01:33"
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/6507755_aa80.jpg"
  },
  {
    "title": "Business Loan Brokering: Make Money Selling Money",
    "price": "Current priceE£3,099.99",
    "description": "With over 6 million small businesses across the United States and thousands more launching each day, there is an ever-growing need for funding to help these businesses start, grow, and scale. This presents an incredible opportunity for you.By becoming a business funding consultant, you position yourself as the trusted advisor for small businesses seeking financial solutions. Not only will you be helping these businesses thrive, but you'll also have the chance to earn significant commissions. This course is designed to show you how to build a six-figure income, all while working from the comfort of your own home.What You Will Learn:Maximize Your Earnings: Learn how to build a six-figure income in a niche with minimal competition, tapping into the ongoing demand for business funding solutions.Comprehensive Funding Products: Get access to a network of over 85 lenders, providing a wide range of financial products, including SBA loans, business credit coaching, and merchant cash advances.Proven Marketing Strategies: Discover effective marketing techniques that will help you stand out and attract clients as a Business Loan Broker.Lead Generation Tools: Utilize ready-made templates for social media and other channels to generate leads and quickly build your client base.Business Credit Building Solutions: Understand specialized credit-building products that help businesses enhance their credit profiles, making them more appealing to lenders and investors.Professional Landing Page: Set up a professional landing page to effectively capture leads and drive more business opportunities your way.Take advantage of this comprehensive training to become a successful Business Loan Broker. Start earning substantial income by helping businesses secure the funding they need and offering valuable business credit coaching services.",
    "instructor": "Daniel Dias",
    "requirements": [
      "No prior experience in business lending is required. We'll guide you through everything you need to know.",
      "A basic understanding of financial concepts is helpful but not necessary.",
      "Access to a computer and internet connection for online resources.",
      "An eagerness to learn and explore new business and marketing opportunities."
    ],
    "whatYouWillLearn": [
      "Develop effective marketing strategies to generate quality leads for business funding opportunities.",
      "Navigate the lending landscape with over 85 lenders to secure the best funding solutions for clients.",
      "Utilize social media platforms for lead generation and build a strong client base.",
      "Understand specialized credit products to help businesses improve their credit profiles and increase funding eligibility."
    ],
    "content": [
      {
        "title": "Introduction",
        "subsections": [
          "Introduction: How to Use This CoursePreview01:08",
          "Welcome00:57",
          "The Opportunity01:03"
        ]
      },
      {
        "title": "Consider These Items When Starting Your Business",
        "subsections": [
          "Consider These Items When Starting: Explanation Video09:41",
          "Below Is A List Of Items To Consider When Starting Your Business Loan Broker00:54",
          "Your First Week Worksheet00:45",
          "Join Our Private Facebook Page00:07",
          "Claim Your Landing Page00:47",
          "Become A Credit Monitoring Affiliate00:48",
          "Become A Credit Repair Affiliate00:22",
          "Get Setup With Nav00:12",
          "Our Simple Sales Process (FLOW CHART)00:20",
          "The Products & Services You OfferPreview00:35",
          "Book a Call To Ask Me Any Questions00:52"
        ]
      },
      {
        "title": "Funding Assessment Process Explained",
        "subsections": [
          "Funding Assessment Explained05:29",
          "Funding Assessment Pitch08:49",
          "Funding Assessment: What To Do When A Client Sends You The File Back02:20",
          "The Process of a Funding Assessment Call Back. Bad Credit Sell Credit Repair02:39",
          "Funding Assessment Call Back For  Startups02:34",
          "Funding Assessment Call Back For Businesses  Generating 100k03:03"
        ]
      },
      {
        "title": "Funding Programs",
        "subsections": [
          "Funding Tiers & Programs Explained02:53",
          "Funding Tiers & Programs00:25",
          "Tier 1 Breakdown01:07",
          "Tier 2 Funding Breakdown00:51",
          "Tier 3 Funding Breakdown01:31",
          "Tier 4 Funding Breakdown01:45"
        ]
      },
      {
        "title": "Unsecured Line-of-Credit Break Down",
        "subsections": [
          "ULOC Section Video Breakdown01:50",
          "Definitions & Terminology00:47",
          "What is a ULOC?01:26",
          "Basic Pre-Qualification Questions01:11",
          "Ways to Use the ULOC Product00:52",
          "The Process of an Application01:36",
          "Consider These Industries to Target00:28",
          "How the Payback Works00:41"
        ]
      },
      {
        "title": "MCA Break Down: Definitions & Terminology",
        "subsections": [
          "Merchant Cash Advance  Video Breakdown02:54",
          "Types Of MCA Programs13:00",
          "Being Able to Understand and Converse About MCAs Is Critical02:40",
          "What is a MCA?00:38",
          "Parties Involved in MCAs00:43",
          "The Different Types of Cash Advances04:02",
          "The Process of an Application01:32",
          "The Qualification Process02:49",
          "How to Price & Daily ACH01:11"
        ]
      },
      {
        "title": "Equipment Leasing Break Down",
        "subsections": [
          "Merchant Cash Advance  Video Breakdown02:04",
          "Equipment Financing Terminology08:20",
          "Different Types of Equipment Leases01:34",
          "Basic Pre-Qualification Questions01:07",
          "The Process of an Application01:27",
          "Consider These Industries to Target00:47",
          "Equipment To Consider Targeting00:42"
        ]
      },
      {
        "title": "Factoring Break Down",
        "subsections": [
          "Factoring  Video Breakdown02:28",
          "Intro to Invoice Factoring01:39",
          "Benefits of Factoring00:36",
          "Prospects & Referral Sources00:52",
          "Industries Ideal for Factoring00:28",
          "Invoice Factoring Cold Calling01:17",
          "Invoice Factoring Cold Calling - Part 2 of 201:28"
        ]
      },
      {
        "title": "SBA Loan Mini Course",
        "subsections": [
          "SBA Video Breakdown02:54",
          "Definitions & Terminology About SBA Loans02:33",
          "SBA Express Loan01:28",
          "SBA Micro Loan01:25",
          "SBA 7(a) Loan01:13",
          "SBA 504 Loan01:19"
        ]
      },
      {
        "title": "Preparing to Launch: Setting Your New Goals",
        "subsections": [
          "Setting Your New Goals02:54",
          "A Simple 5-Step Process to Setting and Achieving Your New Goals01:15",
          "Determine Your Financial Goals01:17",
          "Do Some Housekeeping01:20",
          "Creating Your Online Marketing Plan01:15",
          "Preparing Your Offline Marketing Plan01:31",
          "Establishing A \"YOU\" Plan01:17"
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/5938032_9031_5.jpg"
  },
  {
    "title": "The Uber Hack No One Is Talking About",
    "price": "Current priceE£399.99",
    "description": "Master the Uber Hack: Double Your Earnings Revolution Are you tired of traditional driving constraints and seeking a revolutionary shift in your income? Look no further! Our comprehensive Udemy course is your gateway to unlocking the secret that's transforming the driving industry in 2024.What You'll Discover:  The Untold Uber Strategies: Delve into exclusive insights that go beyond the conventional, equipping you with strategies to elevate your earnings. Breaking Free from Constraints: Learn how to liberate yourself from the limitations that Uber and traditional driving careers impose. Game-Changing Techniques: Uncover techniques that will not only double your income but also reshape the way you perceive and navigate your driving career. Full Control Over Your Earnings: Gain mastery over your financial destiny by implementing tactics that empower you to take control of your income and business like never before.Why Enroll?  Stay Ahead of the Curve: Be at the forefront of the driving industry's evolution with insights into the latest Uber hack. Expert Guidance: Benefit from expert-led instruction that distills complex strategies into actionable steps, ensuring you grasp every nuance. Lifetime Access: Enjoy unlimited access to course materials, allowing you to revisit and reinforce your newfound knowledge whenever needed. Transform Your Driving Career: Elevate your driving experience from a routine job to a lucrative venture, breaking free from the shackles of conventional norms. Join the Driving Revolution: Enroll now and position yourself as a pioneer in adopting game-changing strategies that will redefine your driving career. Don't miss out on the chance to revolutionize your income – secure your spot today!",
    "instructor": "Luis H Rotermund Kreische",
    "requirements": [
      "Be or have been an Uber driver",
      "Be or have been a Taxi driver",
      "Have the basic knowledge of running your own business."
    ],
    "whatYouWillLearn": [
      "You'll learn and master the IDN Network app",
      "You'll learn how to convert high paying customers from Uber over to yourself",
      "You'll learn how to advertise your business sucessfully",
      "You'll learn how to grow and expand your Private Driver business sucessfully"
    ],
    "content": [
      {
        "title": "How To Truly Work For Yourself And Not Rely On Uber For Jobs",
        "subsections": [
          "How Uber Keep Us Stuck To Their PlatformPreview03:26",
          "What Is The IDN Network AppPreview06:45",
          "How To Properly Setup Your Account05:12",
          "How To Set Your Own Rates09:11",
          "Distribution Channels04:41",
          "Exploring Additional Options19:04"
        ]
      },
      {
        "title": "Before You Start",
        "subsections": [
          "Legal Compliance02:44",
          "Learn The Basics About Marketing06:21",
          "How And Where To Advertise Your Business?10:18",
          "How To Convert High Paying Customers From Uber Over To Yourself08:19",
          "Diversification Of Services06:03",
          "Networking And Relationship Building06:46",
          "Taxes And Accounting05:49",
          "Time Management03:18",
          "Develop A Backup Plan For Everything03:05"
        ]
      },
      {
        "title": "While Running Your Business",
        "subsections": [
          "Client Relationship Management04:48",
          "How To Add Value To Your Customers Experience04:58",
          "Continuous Learning04:26",
          "How To Manage A Busy Schedule09:00",
          "Important Links00:03",
          "Flexibility and Adaptability04:45"
        ]
      },
      {
        "title": "How To Grow And Scale",
        "subsections": [
          "Having A Second Vehicle03:12",
          "Hiring A Driver, Contractor Vs Employee03:59",
          "Continues Testing And Improvement02:44",
          "Review10:28"
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/5788260_2656.jpg"
  },
  {
    "title": "HowTo Easily Publish PDFs As Your own Paperback & Hardcovers",
    "price": "Price not found",
    "description": "Is there a way to turn an PDF/Ebook into a physical paperback, Textbook, or Harcover book?\n\nTHIS COURSE IS Personalized and PHENOMENAL\n\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n1. How-To Easily Step-by-Step\n\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSecretly and Excitingly find ways to convert any PDF into a PAPERBACK, HARDCOVER OR TEXTBOOK for Free.\n\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n2. How-To Easily Step-by-Step\n\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrivately and Safely Convert eBooks without violating your terms of service with places like Amazon.\n\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n3. How-To Easily Step-by-Step\n\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUse the New and Improved free way to upload your PDF to the absolute best Print on Demand sites that require no upfront money to sell your book.\n\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n4. How-To Easily Step-by-Step Powerfully have your book printed with a SUPER FIRE AUDIENCE-PULLING choice of cover.\n\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n5. How-To Easily Step-by-Step\n\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGet your paperback mailed to your home and Instantly and Quality Get Your Self-Publishing Business Registered and licensed with your state so you can quickly and easily save massive amounts of money on taxes.\n\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIN ADDITION, THIS COURSE COMES WITH SEVERAL BONUSES LIKE:\n\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n6. How-To Easily Step-by-Step Turn on a Results getting super simple and effective sales funnel attached to your book to collect money while you set it and forget it.\n\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n7. How-To Easily Step-by-Step Safely create a 300 piece-1000-piece books product body of work in less than 3 months that will feed you for the rest of your life.\n\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n8. How-To Easily Step-by-Step Secretly create a unique and Compelling Press Pulling Author Table at your local Brick and Mortar Bookstore and Benefit greatly by getting Clear-Cut Sales, followers on your Author Social Media, and Global Notoriety as a Smash!!!! Hot!!!!! Author.\n\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n9. How-To Easily Step-by-Step Unleash the Global Author within you to the rest of the paying world despite Family and friends never expecting or even ever knowing your author side.\n\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n10. How-To Easily Step-by-Step Simply get up your Guaranteed Sales Pages and a Clear-Cut Compelling Author Website up before Your Book Even arrives that will make you look good and sell, sell, sell your book before it even arrives printed in the mail.\n\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n11. 50% off my new Mobi Or/And Epub Revolution Unique Powerhouse Course coming out in May 2018. This course shows you How-To Easily Step-by-Step convert your 1 PDF/eBook into 52 different for sale products instantly.",
    "instructor": "Brian Hayward",
    "requirements": [
      "students need basic computer skills",
      "access to a word processing software, and a passion for writing and publishing."
    ],
    "whatYouWillLearn": [
      "Navigate the complete self-publishing process from manuscript preparation to final publication.",
      "Create compelling book covers that attract readers and boost sales",
      "Implement efficient writing and self-editing techniques to produce high-quality manuscripts.",
      "Utilize effective marketing and distribution strategies to maximize book visibility and sales."
    ],
    "content": [],
    "image": "https://img-c.udemycdn.com/course/240x135/1524082_1a96_2.jpg"
  },
  {
    "title": "30-Day Major League Baseball Agent Masterclass (Part II)",
    "price": "Price not found",
    "description": "Join MLBPA General Certified Agent, Jason Hoffman of the book License to Deal, in the immersive 30-Day Major League Baseball Agent Masterclass. Tailored for both aspiring and experienced agents seeking new strategies, this course is a unique opportunity to learn from a 20 year industry veteran. Section I: NAVIGATING THE NCAA AND ELIGIBILITY CONSIDERATIONSGain expertise in NCAA regulations and their impact on amateur players.Learn to advise clients on college commitments and draft implications.Section II: EVALUATING AND SCOUTING AMATEUR PLAYERSMaster player scouting, assessing physical attributes, skills, and potential.Develop skills for conducting player meetings and background checks.Section III: MARKETING AND PROMOTING AMATEUR PLAYERSCreate strong player profiles and personal brands.Utilize social media and digital platforms for effective player promotion.Section 4: DRAFT STRATEGIES AND NEGOTIATION TECHNIQUESAnalyze draft projections and player signability.Learn to prepare players for the draft and negotiate contracts and signing bonuses.Section 5: CONCLUSION AND NEXT STEPSKey considerations to assess your readiness before establishing your own baseball agency.Reflect on the knowledge gained and ensure ongoing career success as an MLB agent.Throughout this course, participants will engage in interactive learning activities, case studies, and practical exercises and quizzes to reinforce their understanding of the concepts covered. By the end of the course, students will have developed the foundational skills necessary to elevate their agent career prospects with valuable insights and proven strategies. Please note that the modules in this course focus on the specific topics of amateur player recruitment and representation, in addition to the MLB draft. It does not cover other areas of MLB agent work, such as recruiting, the international signing period, or MLBPA certification, which may require additional training or expertise covered in other modules of this course.",
    "instructor": "Jason Hoffman",
    "requirements": [
      "This 30-day Major League Baseball Agent Masterclass is designed to be accessible and valuable for learners of all backgrounds and experience levels. No prior skills, experience, tools, or equipment are required to participate. We believe in providing an inclusive and beginner-friendly environment for anyone interested in exploring the world of baseball agent representation. Whether you're new to the field or simply curious about baseball industry dynamics, this masterclass is a great starting point to learn, grow, and excel in this exciting profession. Join us and embark on a journey of knowledge, skill-building, and discovery!"
    ],
    "whatYouWillLearn": [
      "NCAA regulations, ensuring compliance and safeguarding the eligibility of student-athletes you advise.",
      "Advise on college commitments, understanding the profound impact on their MLB draft prospects, exposure, development, visibility, and negotiating leverage.",
      "Assess and guide players in making informed decisions regarding their choice between college and professional baseball.",
      "Master comprehensive scouting techniques to identify and represent top amateur baseball talent.",
      "Confidently assess baseball players' physical attributes, skills, and potential.",
      "Adeptly conduct meetings and background checks, assess player attributes effectively, build trust, and make informed decisions.",
      "Master meetings and player assessments to excel as baseball agents.",
      "Guide players through the intricate MLB draft process, from eligibility to strategy and preparation.",
      "Assess player talent and facilitate communication with MLB teams to enhance draft prospects.",
      "Master contract negotiations, maximize player compensation, and protect long-term interests as baseball agents.",
      "Key considerations to asses your readiness to establish your own sports agency in baseball."
    ],
    "content": [],
    "image": "https://img-c.udemycdn.com/course/240x135/5530512_0e6c.jpg"
  },
  {
    "title": "20/20 Business Education for Healthcare Entrepreneurs",
    "price": "Current priceE£3,099.99",
    "description": "If you want to make more money, to know what to do and take action on that knowledge. So much of what happens to us is because of how we think. You’ve probably heard of things like: raising your vibration; the power of visualization; and The Secret.Have you heard the word spizzerinctum? It means will to succeed, guts, nerve, backbone, energy. I shorten it to spiz. Successful people have spiz. You can too.You might be thinking, well I can’t achieve my goals through positive thinking alone. Some would disagree with you. In fact, I’ve seen $400 just magically show up in my bank account. That is not what this course is about.Let me ask you a question. Do you believe negative thinking can result in failure? Of course, right? If you didn’t believe you could do something, you wouldn’t even try. So negative thinking is a cause of failure because we don’t try. On the other hand, positive thinking is the cause of success because we don’t give up.Mindset is huge!! I’m going to give you an experience of controlling your mind. When I first had this experience, it changed my life. I couldn't believe it. My brain was often running out of control. Every day I’m going to have you practice the experience. You will learn to watch your thoughts. If you’re like me, you’ll find out why you don’t achieve your goals. For me, I prioritize my kids and my wife over money. How about you? You’ll learn. Once you see what you prioritize, then you must decide – do you want more money? Or is family and time off more important? My father once said, “I could make more money, but I’d have to work harder.” You could have both time and money if you structure your business differently.I want you to think of your brain as a bio supercomputer. When you have an experience, it is recorded in your brain. If you are like most chiropractors, you have no business programming. You don’t know about accounting, finance, business valuation, taxes, negotiation, and marketing. When you take the course, you create programs in your brain that you can use to improve your business. You develop a business mindset. You become a businessperson.By the end of the course, you’ll go through some exercises to help you realize what must happen to achieve your income goals. You’ll find it really isn’t that hard. Once you believe you can, you’ll have the energy and persistence to make it happen.I’m here to help. Ask me questions through the Udemy platform.I’m looking forward to hearing of your success.Robert Affolter, MBA, DC",
    "instructor": "Robert Affolter, MBA, DC",
    "requirements": [
      "No experience is required. You will learn everything you need to know. Just login and watch the videos. Do the exercises and homework."
    ],
    "whatYouWillLearn": [
      "Mental Mastery: The difference between the top performers and those at the bottom of every field is mindset. You can control your mindset and change your life!",
      "Business Basics: Learn the basics of accounting, banking, taxes, leases, credit scores, business structures and more. Tweak your business for success!",
      "Business Valuation: The fastest way to owning a profitable business is to buy one. Selling a business can fund your retirement. Key is how much is it worth?",
      "Marketing - The basics from internal marketing to external marketing. Find out why so many methods are failing and how to improve your results.",
      "Negotiation - Learn 12 negotiation tactics incorporated by top business people. Watch real life examples of home sale and car purchase."
    ],
    "content": [
      {
        "title": "Day 1 Mental Mastery and Marketing",
        "subsections": [
          "WelcomePreview03:21",
          "Mental Mastery: The Red Ball Experience ExplanationPreview07:12",
          "Mental Mastery: Practice The Red Ball Experience for 5 minutes05:17",
          "Marketing - Six Selling Points from IBM05:26",
          "Do the Exercises!!00:54",
          "FAQ Does this course count for continuing education?Preview00:11"
        ]
      },
      {
        "title": "Day 2 Internal Marketing",
        "subsections": [
          "Mental Mastery: Practice The Red Ball Experience05:17",
          "Marketing: Starts With You08:06",
          "Marketing: Your Appearance08:13",
          "Exercise: Implementation00:07"
        ]
      },
      {
        "title": "Day 3 Take Control of Your Neural Programming",
        "subsections": [
          "Mental Mastery: Practice The Red Ball Experience for 5 Minutes05:17",
          "Mental Mastery: Creating and Running Your Neural Programs05:19",
          "Mental Mastery: Correcting Your Programming08:48",
          "Exercise - Deleting the Ego Program00:30"
        ]
      },
      {
        "title": "Day 4 Internal Marketing",
        "subsections": [
          "Mental Mastery: Practice The Red Ball Experience05:17",
          "Marketing: The Office08:31",
          "Marketing: Internal11:20",
          "Exercise: Getting Ready Continued...00:44"
        ]
      },
      {
        "title": "Day 5 Mental Mastery, Balance Sheets, plus Advertising",
        "subsections": [
          "Mental Mastery: Practice The Red Ball Experience for 5 Minutes05:17",
          "Business Basics: The Beginner's Guide to Balance Sheets05:54",
          "Marketing: External10:14",
          "Mental Mastery: How the Brain Works01:53",
          "Exercise: Programming Your Brain00:24"
        ]
      },
      {
        "title": "Day 6 Credit Scores and Negotiation Basics",
        "subsections": [
          "Mental Mastery: Practice The Red Ball Experience05:17",
          "Business Basics: Is Your Credit Score Costing You $3000 or More?07:41",
          "Negotiation: The Basics05:46",
          "Exercise: What Is Your Credit Score?00:22"
        ]
      },
      {
        "title": "Day 7 Visualization to Realization Plus Income Statement",
        "subsections": [
          "Mental Mastery: Practice The Red Ball Experience for 5 Minutes05:17",
          "Mental Mastery: From Visualization to Realization06:30",
          "Business Basics: What Everybody Ought to Know about Income Statements06:01",
          "Exercise: Searching for Answers01:48"
        ]
      },
      {
        "title": "Day 8 Importance of the Right Business Structure",
        "subsections": [
          "Mental Mastery: Practice The Red Ball Exercise05:17",
          "Business Basics: Business Structures13:53",
          "Exercise: Do You Have the Right Business Structure?01:32"
        ]
      },
      {
        "title": "Day 9 Two Spiritual Laws and 12 Negotiation Tactics",
        "subsections": [
          "Mental Mastery: Practice The Red Ball Experience for 5 Minutes05:17",
          "Mental Mastery: Two Spiritual Laws04:39",
          "Negotiation: 12 Tactics06:59",
          "Exercise: Using the Spiritual Laws01:07"
        ]
      },
      {
        "title": "Day 10 Planning for Taxes and Negotiating a Car Purchase",
        "subsections": [
          "Mental Mastery: Practice The Red Ball Exercise05:17",
          "Business Basics: Taxes07:50",
          "Negotiation: Buying a Car07:45",
          "Exercise: Taxes00:34"
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/5086572_bad0_2.jpg"
  },
  {
    "title": "Entrepreneurship: How to Kickstart Your Online Home Business",
    "price": "Current priceE£399.99",
    "description": "This course is tailor-made for aspiring entrepreneurs like you, drawing from my three-year experience coaching over 400 clients globally in online business. Many faced similar challenges:- Self-limiting beliefs held them back from starting their own ventures.- Shiny object syndrome led to jumping between opportunities without commitment.- Lack of dedication hindered their progress, leading to dropout.My course aims to:- Overcome these obstacles, breaking through mindset barriers.- Move you from learning to implementation, aligning with your Life Vision.- Challenge and empower you to overcome self-limiting beliefs and stay consistent.Please note: Success depends on your dedication and effort.Some common startup challenges include:- Procrastination due to self-limiting beliefs.- Uncertainty about passions and income streams.- Marketing without understanding ideal clients.- Overwhelm from excessive learning without action.Sound familiar?Let's break free from these traps together. With the right mentorship, entrepreneurship goals, continuous education, and support of automated online business systems, you can build a successful creative entrepreneurship business. It requires self-motivation, commitment to learning, and implementing what you've learned. Be patient with yourself; success often takes years of consistent effort.Are you ready to turn your dreams into reality?Join us and unleash your potential. Lets get you started, sign up and register today! Looking forward to connecting with you,ChikoYour MentorConnect with me @IG: ChikoCfM",
    "instructor": "Chiko Matenda",
    "requirements": [
      "You're a self-motivated, ambitious learner, ready to embark on your journey into online entrepreneurship, creating a business that knows no bounds.",
      "Embrace Full Commitment: Take Ownership of Your Learning Journey and Growth.",
      "Ready to Break Free? Overcome Self-Limiting Beliefs & Launch Your Home Business Now!"
    ],
    "whatYouWillLearn": [
      "Tips for uncovering your Reason Why, Purpose, and Passion, along with guidance on Life Vision Planning.",
      "2. Unlocking Your Potential: Overcoming Self-Limiting Beliefs and Self-Sabotage to Kickstart Your Online Business Journey",
      "3. Mastering Consistency, Motivation, and Confidence: Keys to Achieving Your Entrepreneurial Dreams",
      "4.\tBuilding Your Brand: A Step-by-Step Guide to Attracting Your Ideal Clients Online.",
      "Plus, Unlock Bonus Tips: Learn How to Automate Your Online Business for Efficiency and Growth!"
    ],
    "content": [
      {
        "title": "Introduction",
        "subsections": [
          "Introduction VideoPreview14:17",
          "WHAT IS A LIFE VISION (CONTINUED)03:41",
          "Setting Realistic GoalsPreview05:44",
          "Leadership & Vision29:23"
        ]
      },
      {
        "title": "Leadership & Vision",
        "subsections": [
          "WHAT TO INCLUDE IN YOUR LIFE VISION29:13",
          "LIFE VISION TASKS & GUIDANCE TEMPLATE14:42"
        ]
      },
      {
        "title": "THE END",
        "subsections": [
          "CONGRATULATIONS03:37"
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/2186572_0e4a_5.jpg"
  },
  {
    "title": "Starting an LLC in Florida: The Complete Guide",
    "price": "Current priceE£1,099.99",
    "description": "Starting your LLC in Florida doesn't have to be overwhelming! This beginner-friendly, step-by-step course simplifies the entire process, making it accessible for anyone ready to start a business. Here's what you can expect:Who This Course Is ForFirst-time entrepreneurs looking to launch their first business ventureFreelancers seeking to legitimize their operations with an LLCSeasoned professionals needing a clear, Florida-specific guide to LLC formationWhat You’ll LearnGetting StartedHow to select the right name for your businessChecking name availability in Florida to avoid conflictsFiling Essential PaperworkFiling your Articles of Organization with the state to officially register your LLCDesignating a registered agent to meet Florida’s legal requirementsApplying for an EIN (Employer Identification Number) for tax purposesOngoing Compliance RequirementsFiling annual reports to maintain good standing in FloridaUnderstanding basic liability protections and how they benefit your businessManaging Your BusinessOpening a business bank account to keep finances separateManaging your business’s finances effectively and responsiblyWhy Take This Course?Gain clarity and confidence with a simplified process that removes unnecessary stressEliminate confusion with step-by-step guidance tailored to Florida’s specific requirementsBe empowered to legally establish and confidently manage your LLCBy the end of this course, you’ll not only know how to start your LLC but also be equipped with practical tools and knowledge to successfully operate and grow your business. This course ensures you’re fully prepared to thrive on your business journey.",
    "instructor": "Jack Brand",
    "requirements": [
      "No prior experience required"
    ],
    "whatYouWillLearn": [
      "Understand the Complete Process of Forming an LLC in Florida",
      "Identify and Complete Required Documentation for LLC Formation",
      "Acquire Essential Knowledge of Compliance and Annual Requirements",
      "Apply Practical Knowledge of Tax Registration and Business Finances"
    ],
    "content": [
      {
        "title": "Introduction",
        "subsections": [
          "Introduction to CoursePreview01:05",
          "Legal Disclaimer00:32"
        ]
      },
      {
        "title": "LLC Formation",
        "subsections": [
          "What is a Limited Liability Company (LLC)?Preview03:22",
          "Exceptions to Personal Protection of Member(s)05:46",
          "LLC vs Corporation05:39"
        ]
      },
      {
        "title": "Selecting your Business Name",
        "subsections": [
          "Using ChatGPT for Name Ideas06:35",
          "Checking Name AvailabilityPreview04:39",
          "Distinguishing Factors when Selecting a Name03:15"
        ]
      },
      {
        "title": "Filing Articles of Organization",
        "subsections": [
          "Filing Overview - Articles of Organization07:39",
          "Setting up a Registered Agent02:42"
        ]
      },
      {
        "title": "EIN",
        "subsections": [
          "Apply for an EIN11:46"
        ]
      },
      {
        "title": "Annual Report",
        "subsections": [
          "When and How to File your Florida Annual Report10:15"
        ]
      },
      {
        "title": "Amend LLC",
        "subsections": [
          "Overview of Filing an LLC Amendment and Why15:06"
        ]
      },
      {
        "title": "Trademark",
        "subsections": [
          "What is Trademark Protection07:18",
          "Trademark Classes Explained06:24",
          "How to Search the USPTO Website05:21"
        ]
      },
      {
        "title": "Sales and Use Tax",
        "subsections": [
          "Sales Tax Disclaimer00:45",
          "Sales Tax Explained02:31",
          "State-by-State Nexus ThresholdPreview03:39",
          "Apply for a Sales and Use Tax Permit07:53",
          "Resale Exemption Explained03:00",
          "File Monthly Reports03:50"
        ]
      },
      {
        "title": "Closing Thoughts",
        "subsections": [
          "Congratulations on Completing the Course!01:12"
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/6268031_d4f5_4.jpg"
  },
  {
    "title": "How to Become a Wedding Officiant",
    "price": "Current priceE£399.99",
    "description": "Here's What You'll Get:Everything you need to hit the ground running and perform your first ceremony in just a few weeks!11 Step-by-Step Lessons with 2.5+ Hours of Instructional VideoMy course is designed to teach you everything I've learned over the past few years. Real examples, with material and content that I've created and used for real ceremonies. Things that you would never be able to find on the internet.  Your success is my best asset in showcasing the quality of this course.10+ Jordan's Go-to Resources, Scripts, and Templates (worth the price of the course alone!)By providing you with my award winning ceremony scripts, you will be able to immediately hit the ground running with your officiant business and start offering services within your area. I've also provided you with a few other great resources such as pre written email templates, booking contract, and meeting talk tracks to ensure everything runs smoothly. Private Facebook CommunityOnce you become a student of this course you will be added to our private Facebook group where you can chat with other officiants going through the same process and with myself as well. This helps answer any questions you may have in real time and lean on others for support and mentorship.",
    "instructor": "Jordan Yuppa",
    "requirements": [
      "No previous experience is needed to take this course, however, being comfortable with public speaking certainly helps!"
    ],
    "whatYouWillLearn": [
      "How to legally become a wedding officiant and perform weddings within the United States",
      "Your first steps to get your business up and running",
      "Where to advertise your business",
      "How to land your first lead",
      "How to manage client meetings and what questions you need to ask your couples",
      "How to craft meaningful ceremonies",
      "How to competitively price your services",
      "How to manage your first wedding day"
    ],
    "content": [
      {
        "title": "Module 1",
        "subsections": [
          "How to Become a Wedding Officiant - IntroductionPreview10:53"
        ]
      },
      {
        "title": "Module 2",
        "subsections": [
          "How to Become a Wedding Officiant - Where to Get Ordained09:23",
          "How to Become a Wedding Officiant - Creating Your Website12:36",
          "How to Become a Wedding Officiant - Creating Scripts10:23",
          "How to Become a Wedding Officiant - Contracts, Advertising, and Pricing15:36"
        ]
      },
      {
        "title": "Module 3",
        "subsections": [
          "How to Become a Wedding Officiant - Meetings and Leads10:09",
          "How to Become a Wedding Officiant - Meetings and Leads (Continued)15:39"
        ]
      },
      {
        "title": "Module 4",
        "subsections": [
          "How to Become a Wedding Officiant - Logistics10:38"
        ]
      },
      {
        "title": "Module 5",
        "subsections": [
          "How to Become a Wedding Officiant - Content Creation19:34"
        ]
      },
      {
        "title": "Module 6",
        "subsections": [
          "How to Become a Wedding Officiant - SHOWTIME22:35"
        ]
      },
      {
        "title": "Congratulations!",
        "subsections": [
          "How to Become a Wedding Officiant - Closing Thoughts01:33"
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/4922426_c430_2.jpg"
  },
  {
    "title": "Business Partnership Structure",
    "price": "Current priceE£399.99",
    "description": "IntroductionWelcome to our comprehensive online course on Business Partnership Structure! Whether you're an entrepreneur looking to embark on a new venture with a partner, a seasoned business owner seeking to restructure your existing partnerships, or simply someone intrigued by the intricacies of collaborative business arrangements, this course is designed to provide you with the knowledge and tools necessary to navigate the complexities of forming and managing successful business partnerships.What you will learn from this course.1. What is a partnership, and what are the types of alliances out there?   A business partnership is a legal relationship, a way of organizing and running a company by two or more individuals, and they share the profits or losses. You will learn many types of partnerships when you read through the course.2. Business Partnership Essentials.The essential point is to have trust in one another. If there is doubt and misunderstanding, you are working towards failure.3. How do you form a partnership?Decide who will be your business partners. Partnerships typically involve two or more individuals or entities who agree to share profits and losses.Select a unique and appropriate name for your partnership business. This is a crucial step where you outline the terms and conditions of your partnership. The partnership agreement should cover each partner's contribution, profit-sharing ratio, roles, and responsibilities.4. What are the advantages of a business partnership? In a partnership, the business benefits from each partner's unique perspective. In business, two heads are often better than one, and the combined conclusion of a debate is far better than what each partner could have achieved individually.5. Finding a partner: You must be careful when selecting a partner. If a mistake is made, it could affect the business in many ways. Further, Finding a business partner is only that easy if you are ready to face anything that comes up from that. First, you must learn all about how a partnership works and the pros and cons of having a partner. How will you prepare the partnership agreement, and how will you deal with server problems?Throughout this course, we will investigate various aspects of business partnerships, including different partnership structures, legal considerations, partners' roles and responsibilities, decision-making processes, conflict resolution strategies, and more. By examining real-world case studies and practical examples, you will gain valuable insights into the opportunities and challenges of collaborative business ventures.Thank you for choosing this course. Reading it thoroughly will likely motivate you to form a partnership.",
    "instructor": "Vathani Ariyam",
    "requirements": [
      "Anyone can enter a general partnership provided they take enough control over what they do the essential thing here is to keep leaning daily and apply that in the business."
    ],
    "whatYouWillLearn": [
      "A project manager should know about the type of partnership, partner selection and how it suits his business to achieve the best from a business in the long run",
      "The best option is to set your budget in advance for this business, but you need to be careful and spend enough time to achieve the best from this partnership.",
      "In a general partnership coulld face many disadvantages because there is no legal status, and it has no lawful character. Faces difficulties when partner leaves",
      "If a business partner wants to leave, handling the situation with care and professionalism is essential to minimize potential negative impacts on the business.",
      "Aproject manager should be aware of the pros and cons of  maintaining a partnership to avoid conflicts, dissolution and   other issues while running a business."
    ],
    "content": [
      {
        "title": "Partnership Formation",
        "subsections": [
          "What is a partnership, and what are the types of alliances out there?Preview04:53",
          "Partnership1 question",
          "Business Partnership essentialsPreview05:05",
          "Partnership1 question",
          "How do you form a partnership business?Preview05:54",
          "Forming a partnership.1 question"
        ]
      },
      {
        "title": "Advantages & Disadvantages",
        "subsections": [
          "What are the advantages of a business partnership?06:09",
          "Advantages.1 question",
          "How do you select your partnership?03:52",
          "Selecting.1 question",
          "Detriments of a business partnership Organisation07:34",
          "Disadvantages1 question"
        ]
      },
      {
        "title": "Possible Issues",
        "subsections": [
          "More factors to consider in a general partnership Business.06:56",
          "More factors1 question",
          "How do I deal with my business partner wanting to leave?05:46",
          "Partner1 question",
          "Further actions to prevent the dissolution of the company05:27",
          "Dissolution of the company1 question"
        ]
      },
      {
        "title": "Selection",
        "subsections": [
          "Tips for Finding a Business Partner and Maintaining a Successful Partnership06:30",
          "Finding Partner1 question",
          "Working together: Check the qualities of the potential partner.05:37",
          "Potential Partner1 question",
          "A letter of invitation to join the organisation05:54",
          "Letter of invitation1 question"
        ]
      },
      {
        "title": "Comparison",
        "subsections": [
          "What s the difference between partnership and sole proprietorship?09:43",
          "The difference1 question",
          "Accounting for partnership business06:46",
          "Accounting.1 question",
          "Filing Bankruptcy as a Partnership06:26",
          "Bankruptcy1 question"
        ]
      },
      {
        "title": "Differences among partners",
        "subsections": [
          "How do equal partners resolve conflicts in business?06:14",
          "Equal partners1 question",
          "What are the ethics of starting a new business setup in an equal partnership?05:55",
          "Forming equal partnership1 question",
          "Why Business Associations Are So Significant05:56",
          "Partnerships1 question"
        ]
      },
      {
        "title": "More Plans",
        "subsections": [
          "Long Haul Plans for Phenomenal Business Coalitions07:28",
          "Long haul plans1 question",
          "How partners who developed a successful business09:14",
          "How do Partners Develop Successful Business?2 questions",
          "Two partners1 question",
          "Who Owns the Business in a General Partnership?09:17",
          "Who Owns the Business in General Partnership?2 questions"
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/5830360_dae7.jpg"
  },
  {
    "title": "A Proven Upwork Blueprint To Grow Your Freelance Business",
    "price": "Current priceE£399.99",
    "description": "Welcome to the world of Upwork, a place where your freelance career can truly thrive! Whether you're new to the platform or a seasoned freelancer looking to enhance your profile, proposals, and pitch, you've come to the perfect place.My name is Tess Trotter, and I've been an Upwork member since 2017. Throughout my journey, I've had the pleasure of collaborating with countless clients, generating a six-figure annual revenue, and maintaining a flawless 100% job success score. Each day, I receive an impressive range of five to fifteen job invites and direct messages from enthusiastic clients. This level of interest has opened remarkable opportunities, allowing me to hire a dedicated team and collaborate with renowned brands.Along this fruitful path, I've gained invaluable insights into maximizing the potential of the Upwork platform. From optimizing your profile to crafting compelling proposals and addressing common client inquiries, I've gathered a treasure trove of knowledge that I'm eager to share. With the Upwork Blueprint Course, you can expect remarkable benefits, including...- a surge in job offers- glowing five-star ratings- boosted income- and so much more!So, let's embark on this exciting journey together. Get ready to unlock your full potential on Upwork and make your freelance dreams a reality!_____BONUS: This course includes FOUR valuable downloads to help you out along the way! Consider this a little gift from me to you! These downloads are:An Upwork Profile GuideAn Upwork Proposal GuideAn Upwork Pitch ScriptA Service Agreement Template",
    "instructor": "Tess Trotter",
    "requirements": [
      "No Upwork or freelance experience needed! This course is great for beginners, pros, and everyone in between."
    ],
    "whatYouWillLearn": [
      "Set up your Upwork profile and learn how to navigate the platform",
      "Optimize your Upwork profile for maximum visibility",
      "Send eye-catching Upwork proposals to spark interest and lock in calls",
      "Deliver a project-winning pitch to land the account",
      "Establish a seamless workflow for client satisfaction and retention"
    ],
    "content": [
      {
        "title": "Introduction",
        "subsections": [
          "IntroductionPreview02:45"
        ]
      },
      {
        "title": "What is Upwork",
        "subsections": [
          "What is UpworkPreview02:33"
        ]
      },
      {
        "title": "Optimize Your Profile",
        "subsections": [
          "Optimize Your ProfilePreview04:01"
        ]
      },
      {
        "title": "Proposal Best Practices",
        "subsections": [
          "Proposal Best PracticesPreview05:25"
        ]
      },
      {
        "title": "Pitch Perfect",
        "subsections": [
          "Pitch Perfect02:27"
        ]
      },
      {
        "title": "Client Satisfaction and Retention",
        "subsections": [
          "Client Satisfaction and Retention02:51"
        ]
      },
      {
        "title": "Closing",
        "subsections": [
          "Closing00:37"
        ]
      },
      {
        "title": "Extra Course: Communication Strategies for Freelancers",
        "subsections": [
          "Communication Strategies for Freelancers03:20"
        ]
      },
      {
        "title": "Extra Course: Mastering Time Management",
        "subsections": [
          "Mastering Time Management02:52"
        ]
      },
      {
        "title": "Extra Course: Cultivating a Freelancer Mindset",
        "subsections": [
          "Cultivating a Freelancer Mindset05:18"
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/5846842_97b0_4.jpg"
  },
  {
    "title": "AI Startup Ideas with Sramana Mitra",
    "price": "Current priceE£599.99",
    "description": "The 1Mby1M Methodology is based on case studies. In this course, Sramana Mitra shares the tribal knowledge of tech startup investors by giving students the rare seat at the table with investors who provide the most instructive perspectives on how to build a thriving business. Through these conversations, students gain access to case studies exploring the alleys of entrepreneurship. Sramana’s synthesis of key learnings and incisive analysis add great depth to each discussion.There’s a lot of excitement around AI right now, but also a great deal of noise. With so many possibilities, how do you identify the right AI startup idea to pursue? This course is designed to help entrepreneurs cut through the hype and uncover real opportunities in the AI landscape.In AI Startup Ideas, we explore promising directions for artificial intelligence ventures, examining where AI is making the biggest impact and where untapped potential still exists. You’ll gain insights into how successful AI startups have identified market needs, developed innovative solutions, and positioned themselves for growth.We’ll discuss key trends in enterprise AI adoption, the challenges of AI hallucination, and the ongoing debate between general AI and specialized applications. You'll also learn about the infrastructure required to scale AI and how emerging technologies might shape the next wave of AI-driven businesses.By the end of this course, you'll have a clearer understanding of what makes an AI startup idea viable, how to assess market demand, and where the most promising opportunities lie in this rapidly evolving space. Let’s dive in!",
    "instructor": "Sramana Mitra",
    "requirements": [
      "The only requirement for this course is an open mind and a willingness to learn."
    ],
    "whatYouWillLearn": [
      "Through interviews with real-world AI startup investors you will hear about various AI startup ideas.",
      "How you can think from an investor's point of view about artificial intelligence startup.",
      "What types of AI startups are getting funded.",
      "Where you can seek further mentorship regarding AI startup funding."
    ],
    "content": [
      {
        "title": "Ideas for Building Artificial Intelligence Startups",
        "subsections": [
          "IntroductionPreview02:02",
          "AI Startup Ideas02:12",
          "AI Startup Ideation03:22",
          "AI Startup Idea Brainstorming with Investor Gus TaiPreview35:03",
          "AI Education Startup Idea Brainstorming with Investor Gus Tai43:28",
          "AI Healthcare Startup Idea Brainstorming with Investor Gus Tai44:00",
          "AI Startup Idea Brainstorming with David Hornik, Lobby Capital41:40"
        ]
      },
      {
        "title": "Additional Content",
        "subsections": [
          "Exploring AI Startup Ideas Further01:00",
          "Practice Exercise58:32",
          "Extra02:59"
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/6529687_dab1.jpg"
  },
  {
    "title": "Become a Certified Senior Home Modification Specialist",
    "price": "Current priceE£599.99",
    "description": "Create safer, more accessible living spaces for seniors with \"Become a Certified Senior Home Modification Specialist\". This course provides you with the skills and knowledge to help aging individuals live independently by adapting their homes to meet their evolving physical needs. You’ll learn how to conduct thorough safety assessments, identify potential hazards, and implement modifications that make daily tasks easier and safer for seniors. Each module delves into specific areas of the home, covering modifications like grab bar installation, ramp construction, and kitchen and bathroom accessibility improvements.Beyond practical skills, this course emphasizes the importance of empathy, communication, and collaboration with seniors and their families. By the end, you’ll be prepared to design customized modification plans, manage project budgets, and offer follow-up services to ensure continued safety and comfort. Whether you’re starting a new business or expanding your handyman skills, this certification will equip you to make a positive impact in the lives of seniors, allowing them to age in place with confidence.What You’ll Learn:The benefits of aging-in-place and how to support itPhysical and cognitive challenges common in agingTools and equipment needed for home modificationsSafety standards and accessibility guidelines for senior livingHow to assess homes for safety and accessibility issuesIdentifying and prioritizing high-risk areas in homesConducting consultations with seniors and their familiesDeveloping customized modification plans for individual needsInstalling grab bars and handrails in key areasImplementing non-slip flooring solutions for fall preventionCreating accessible showers, tubs, and toiletsMaking kitchens more accessible with ergonomic adjustmentsInstalling easy-access cabinets and adjustable countertopsModifying doorways and hallways for improved mobilityAdding ramps and modifying thresholds for wheelchair accessSelecting and installing flooring for fall resistanceImplementing stairlift and railing solutions for stairsImproving bedroom safety and comfort for seniorsConducting follow-up assessments to ensure modifications are effectiveClient management, marketing, and business growth for modification specialistsThis course empowers you with the expertise needed to make homes safer and more comfortable for seniors, allowing you to build a rewarding career dedicated to enhancing quality of life for aging individuals.",
    "instructor": "Contractor Companion",
    "requirements": [
      "Your own tools",
      "A willingness to work with your hands",
      "handyman skills"
    ],
    "whatYouWillLearn": [
      "1.\tThe benefits of aging-in-place and how to support it",
      "2.\tPhysical and cognitive challenges common in aging",
      "3.\tTools and equipment needed for home modifications",
      "4.\tSafety standards and accessibility guidelines for senior living",
      "5.\tHow to assess homes for safety and accessibility issues",
      "6.\tIdentifying and prioritizing high-risk areas in homes",
      "7.\tConducting consultations with seniors and their families",
      "8.\tDeveloping customized modification plans for individual needs",
      "9.\tInstalling grab bars and handrails in key areas",
      "10.\tImplementing non-slip flooring solutions for fall prevention",
      "11.\tCreating accessible showers, tubs, and toilets",
      "12.\tMaking kitchens more accessible with ergonomic adjustments",
      "13.\tInstalling easy-access cabinets and adjustable countertops",
      "14.\tModifying doorways and hallways for improved mobility",
      "15.\tAdding ramps and modifying thresholds for wheelchair access",
      "16.\tSelecting and installing flooring for fall resistance",
      "17.\tImplementing stairlift and railing solutions for stairs",
      "18.\tImproving bedroom safety and comfort for seniors",
      "19.\tConducting follow-up assessments to ensure modifications are effective",
      "20.\tClient management, marketing, and business growth for modification specialists"
    ],
    "content": [
      {
        "title": "Module 1: Introduction to Senior Home Modification",
        "subsections": [
          "1.\tCourse Overview and Certification RequirementsPreview03:54",
          "2.\tUnderstanding Aging-in-Place and Its Benefits03:54",
          "3.\tCommon Physical and Cognitive Challenges in Aging04:20",
          "4.\tEssential Tools and Equipment for Home ModificationsPreview04:39",
          "5.\tHome Safety Standards and Accessibility Guidelines03:54"
        ]
      },
      {
        "title": "Module 2: Assessing Home Modification Needs",
        "subsections": [
          "6.\tConducting Safety and Accessibility Assessments03:41",
          "7.\tIdentifying High-Risk Areas in the Home03:41",
          "8.\tConsulting with Clients and Family MembersPreview04:00",
          "9.\tDeveloping a Customized Modification Plan04:26",
          "10.\tBudgeting and Sourcing Materials04:26"
        ]
      },
      {
        "title": "Module 3: Bathroom Modifications",
        "subsections": [
          "11.\tInstalling Grab Bars and Handrails04:07",
          "12.\tNon-Slip Flooring and Surface Solutions04:00",
          "13.\tAccessible Showers, Tubs, and Toilets04:20",
          "14.\tBathroom Lighting for Safety04:06",
          "15.\tEmergency Alert Systems for Bathrooms04:00"
        ]
      },
      {
        "title": "Module 4: Kitchen Modifications",
        "subsections": [
          "16.\tCountertop Adjustments and Accessibility04:42",
          "17.\tInstalling Easy-Access Cabinets and Storage04:26",
          "18.\tAppliance Modifications and Ergonomic Solutions03:54",
          "19.\tImproved Lighting and Safety for Kitchen Areas04:00",
          "20.\tLever-Style Faucets and Accessibility Fixtures04:13"
        ]
      },
      {
        "title": "Module 5: General Home Modifications",
        "subsections": [
          "21.\tWidening Doorways and Hallways for Mobility04:13",
          "22.\tInstalling Ramps and Threshold Modifications04:13",
          "23.\tFlooring Solutions for Fall Prevention04:13",
          "24.\tStairlifts, Railings, and Accessible Stairways04:00",
          "25.\tBedroom Modifications for Comfort and Safety04:26"
        ]
      },
      {
        "title": "Module 6: Professionalism and Client Interaction",
        "subsections": [
          "26.\tBuilding Trust with Seniors and Their Families04:13",
          "27.\tConducting Follow-Up Assessments and Adjustments04:20",
          "28.\tLegal and Ethical Considerations for Home Modifiers04:00",
          "29.\tMarketing and Growing a Senior Home Modification Business03:47",
          "30.\tFinal Exam and Certification Review03:15"
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/6479521_13d5.jpg"
  },
  {
    "title": "How VCs Think About European Startups with Sramana Mitra",
    "price": "Current priceE£399.99",
    "description": "In this course, we will do a deep dive into startup financing in Europe.Raising money is a low probability game. You need to understand how investors think to be able to raise money successfully for your startup.During this course, I will be teaching how investors in Europe think about and analyze startups. We will have in-depth conversations around startups with several real world investors.Designed for tech entrepreneurs and aspiring entrepreneurs interested in building startups in Europe, this course provides insights into the minds of several investors operating in this region for many years in their own words.With this course, we thoroughly discuss with a group of successful European investors the size of their investments, preferences, and the European startup trends they see in their dealflows.Throughout this course, investors focused on the European startup scene share their perspectives and discuss the trends in the market with me. We hope you will join us.Europe is generating Unicorns and the investors are becoming more and more ambitious. Nonetheless, some of the erstwhile pragmatism still remains, and the Silicon Valley led hubris of startup investing, while gaining ground, is still frowned upon a bit.European investors are also developing deeper relationships with their US counterparts, which is very welcome.The 1Mby1M courses are all heavily based on interview-based case studies on Innovation, Business Models, Go To Market Strategies, Validation Principles, and various other nuances of an entrepreneur's journey. We offer extensive opportunities for entrepreneurs to learn the lessons from the trenches from successful entrepreneurs who have done it before and Investors who support their ambition.",
    "instructor": "Sramana Mitra",
    "requirements": [
      "The only requirement for this course is an open mind and a willingness to learn."
    ],
    "whatYouWillLearn": [
      "Through in-depth interviews with prominent investors, learn what investors think about European startups.",
      "What is investor-entrepreneur fit and how to look for it before you start looking for funding.",
      "Why 99% of entrepreneurs who seek funding get rejected by VCs.",
      "Why traditional VCs only invest in hyper growth startups.",
      "What the key considerations are for investors when they evaluate startups.",
      "How entrepreneurs can position themselves for success while building a startup.",
      "What the common mistakes are that entrepreneurs make when pitching their startups to VCs.",
      "The fastest way to find the relevant sources of funding when building a startup in Europe."
    ],
    "content": [
      {
        "title": "How Investors Think About Startups in Europe",
        "subsections": [
          "IntroductionPreview01:11",
          "How Investors Think About Startups in Europe07:08",
          "Entrepreneur - Investor Fit10:36",
          "Spotlight on Entrepreneurship in Central Europe with Ondrej Bartos, Credo Ventur35:06",
          "European-US Bridge for Tech Startups: Rajeev Singh-Morales, Alma Mundi VenturesPreview24:13",
          "Alternative Financing for Startups with Christian Czernich, Round2 Capital16:57",
          "Spotlight on Entrepreneurship and Venture Capital in Vienna25:00",
          "Spotlight on Italian Startups with Giuseppe Donvito, P101 Ventures28:54",
          "Spotlight on Northern European Startups with Andrus Oks, Tera Ventures31:25",
          "European Founder Perspective with Stefan Batory, Booksy36:02",
          "Discussion European Startups with Hussein Kanji, Hoxton Ventures38:54",
          "Focusing on Germany and Switzerland with Harald Nieder, Redalpine Ventures26:44",
          "Eastern and Central European Startups with Cem Sertoglu, Earlybird Ventures29:54"
        ]
      },
      {
        "title": "Conclusion",
        "subsections": [
          "Practice Exercise00:23",
          "Bonus Lecture02:59"
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/4045050_7639.jpg"
  },
  {
    "title": "Cosmetic Formulating: Create Your Own Haircare Products",
    "price": "Current priceE£1,499.99",
    "description": "Creating your own natural hair care products can be extremely rewarding!See the difference natural ingredients can make when formulated properly, and with the right information and knowledge. Without a SOLID foundation, you’ll spend way more time, money and energy in the “trial and error” phase than you need to.Here’s what you’ll get inside the course:Easy-To-Use Online Classroom25 lessons walking you through the set up of making the perfect moisturizer for curly hair, and setting your formulating journey up for major success.Create A FormulaLearn about base ingredients, substituting ingredients, how to convert recipes to formulas, and how to create your formula from scratch.Video TutorialPractical demonstration video that show you exactly how to make the product, as well as receive the exact formula so that you can make it again and again!Clean, Green FormulaOur product formulations are non-toxic, not tested on animals, unadulterated, and are without the use of parabens, sulphates, chemical sunscreens, or synthetic fragrances.Lifetime AccessAccess the courses as often as you wish to assist you in creating your haircare products and setting up your indie business properly.Expect to leave this training empowered.Gain new and vital knowledge about how you can get started as a haircare product formulator more confidently while simultaneously avoiding a number of common and serious mistakes that could stunt you and your business’ growth in the process.",
    "instructor": "Melesande Rhodes",
    "requirements": [
      "You don't have to be a cosmetic chemist to formulate beauty products. You can receive your certification in Ayurvedic hair care product formulation in as little as 90 days."
    ],
    "whatYouWillLearn": [
      "Become an efficient formulator, write qualified formulations and test formulations for the ideal product to be achieved.",
      "You will learn about the different hair types, characteristics and how to tailor the formulations to match them.",
      "Learn how to select ingredients for your formulations and the roles, properties and benefits of a wide variety of ingredients.",
      "Learn how to make the #1 requested hair product for naturally curly hair",
      "Learn about high performing ingredients and effective natural preservatives. Comply with the rules on cosmetics, labelling and claims."
    ],
    "content": [
      {
        "title": "WELCOME TO THE COURSE!",
        "subsections": [
          "IntroductionPreview01:37",
          "Your Home LabPreview13:52"
        ]
      },
      {
        "title": "AYURVEDA 101",
        "subsections": [
          "What is Ayurvedic Hair Care?00:57",
          "What are Doshas?02:48"
        ]
      },
      {
        "title": "DOSHA-SPECIFIC CARE",
        "subsections": [
          "Vata Hair & Scalp Care00:23",
          "Pitta Hair & Scalp Care00:27",
          "Kapha Hair & Scalp Care00:21"
        ]
      },
      {
        "title": "MASTERING EMULSIONS",
        "subsections": [
          "What is an Emulsion?00:31",
          "Crafting Your Signature Blend21:12",
          "Let's Create an Emulsion!12:05"
        ]
      },
      {
        "title": "CREATING THE FORMULA",
        "subsections": [
          "Let's Talk Ingredients00:14",
          "Base Ingredients12:40",
          "What About Substitutions?00:57",
          "Converting Recipes to Formulas01:08",
          "Building Your Formula17:02",
          "Vata-Specific Ingredients00:51",
          "Pitta-Specific Ingredients00:36",
          "Kapha-Specific Ingredients00:47"
        ]
      },
      {
        "title": "SAFETY FIRST",
        "subsections": [
          "Preservatives22:29"
        ]
      },
      {
        "title": "LET'S GET MIXING!",
        "subsections": [
          "Making The Mega-Moisture Hair Cream18:23",
          "Making The Mega-Moisture Hair Cream (pt. 2)09:41"
        ]
      },
      {
        "title": "ADDITIONAL RESOURCES",
        "subsections": [
          "Sourcing Ingredients00:43"
        ]
      },
      {
        "title": "Congratulations!",
        "subsections": [
          "Congratulations!  You've completed the course.00:42"
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/5290308_f01d_4.jpg"
  },
  {
    "title": "Poultry Disease Prevention And Treatment",
    "price": "Current priceE£399.99",
    "description": "Good feed should contain 20% protein, amino acid for growth, corn for energy, additional vitamins, and sufficient but not excessive fats and carbohydrates. Giving your chickens a quality diet will help to keep them healthy and disease free. Give your chickens enough feed so that they can eat consistently throughout the day. The exact amount you put in your coop will vary depending on how many chickens you have and the size of your feeder. Many chicken feeders can hold several days worth of food. Giving your chicken the right nutrition will help their immune systems to be strong and able to fight off infection and disease. Allowing chickens to free range around your yard can reduce their stress, which will help them more healthy overall. They will also grit in the form of weed, grass, worms, and other delicious things they find in the yard. This will also help out their digestive system, making them healthier overall.  Consult with a veterinarian on the phone or take your bird to the vet if you see any sign of illness. Identifying and starting treatment for illness right away can help your chicken survive even life-threatening diseases. Isolate a chicken if you thick they may be sick. This minimizes the chances of them passing a potential illness onto the rest of the flock.",
    "instructor": "Eric Yeboah",
    "requirements": [
      "Desire to learn more about poultry disease",
      "No requirement"
    ],
    "whatYouWillLearn": [
      "How to prevent disease in chickens",
      "How to prevent bird bird",
      "How to avoid cross contamination",
      "How to handle uncooked poultry",
      "How to know if your bird is sick",
      "Marek's disease"
    ],
    "content": [
      {
        "title": "Introduction",
        "subsections": [
          "IntroductionPreview02:22",
          "Virulent newcastle diseasePreview02:34",
          "Marek's diseasePreview04:55"
        ]
      },
      {
        "title": "How To Prevent Bird Flu ( Avian Influenza)",
        "subsections": [
          "Preventing contracting bird fluPreview04:25",
          "Monitoring for symptoms of avian influenza03:15",
          "Preventing your chicken from getting bird flu03:40",
          "Avoiding avian flu while travelling01:50"
        ]
      },
      {
        "title": "How To Prevent Disease In Chickens",
        "subsections": [
          "Keeping your chicken coop clean03:17",
          "Keeping your chickens healthy03:27",
          "Giving preventative care04:34"
        ]
      },
      {
        "title": "How To Know If Your Bird Is Sick",
        "subsections": [
          "Monitoring your bird diet03:22",
          "Monitoring your bird appearance03:22",
          "Monitoring your bird behavior03:14"
        ]
      },
      {
        "title": "How To Handle Uncooked Poultry",
        "subsections": [
          "Transporting and storing poutry01:46",
          "Preparing poultry01:56",
          "Freezing and defrosting poultry03:21"
        ]
      },
      {
        "title": "How To Avoid Cross Contamination",
        "subsections": [
          "Preventing cross contamination when shopping01:51",
          "Storing food correctly02:54",
          "Preparing food safety03:52"
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/6096467_b74d_3.jpg"
  },
  {
    "title": "How VCs Think of Startups in Latin America | Sramana Mitra",
    "price": "Current priceE£399.99",
    "description": "In this course, we will do a deep dive into startup financing in Latin America.Raising money is a low probability game. You need to understand how investors think to be able to raise money successfully for your startup.During this course, I will be teaching how investors in Latin America think about and analyze startups. We will have in-depth conversations around startups with several real world investors (Angels and VCs).Designed for tech entrepreneurs and aspiring entrepreneurs interested in building startups in Latin America, this course provides insights into the minds of several investors operating in this region for many years in their own words.Throughout Latin America, the number of online buyers and e-commerce sales are expected to continue to increase significantly over the next few years. While Latin America consists of more than 20 countries, the region is dominated by six key markets – Argentina, Brazil, Chile, Colombia, Mexico, and Peru. Stretching from the northern border of Mexico to the southern tip of South America, including the Caribbean, a number of startup hubs have emerged within these key markets. All good news for entrepreneurs.Throughout this course, investors focused on the Latin America startup scene share their perspectives and discuss the trends in the market with me. We hope you will join us.The 1Mby1M courses are all heavily based on interview-based case studies on Innovation, Business Models, Go To Market Strategies, Validation Principles, and various other nuances of an entrepreneur's journey. We offer extensive opportunities for entrepreneurs to learn the lessons from the trenches from successful entrepreneurs who have done it before and Investors who support their ambition.",
    "instructor": "Sramana Mitra",
    "requirements": [
      "The only requirement for this course is an open mind and a willingness to learn."
    ],
    "whatYouWillLearn": [
      "Through in-depth interviews with prominent investors, learn how investors think about Latin American startups.",
      "What investor-entrepreneur fit is and how to look for it before looking for funding.",
      "Why 99% of entrepreneurs who seek funding get rejected by VCs.",
      "Why traditional VCs only invest in hyper growth startups.",
      "What are the key considerations for investors when they evaluate startups.",
      "How entrepreneurs can position themselves for success while building a startup.",
      "What some of the common mistakes are that entrepreneurs make when pitching their startups to VCs.",
      "The fastest way to find the relevant sources of funding when building a startup in Latin America."
    ],
    "content": [
      {
        "title": "How Investors Think About Startups in Latin America",
        "subsections": [
          "IntroductionPreview01:13",
          "How Investors Think About Startups in Latin America Introduction05:38",
          "Understanding Entrepreneur - Investor Fit10:36",
          "Discussing AgTech Startups in Latin America with Francisco Jardim, SP VenturesPreview28:42",
          "Startups Spanning Brazil to Silicon Valley with Rodrigo Baer, Redpoint eventures27:20",
          "Trends in the Latin American Startup Scene with Hernan Kazah, Kaszek Ventures27:40",
          "Trends in Latin America with Hernan Fernandez, Angel Ventures Mexico30:03",
          "Pre-seed Investing in Latin America with Laurel Touby, Supernode Ventures16:05",
          "Pre-seed Investment Strategies with Jonathan Lewy, Investo41:34",
          "Peru’s Entrepreneurial Ecosystem with Jose Deustua, UTEC Ventures23:14",
          "Investing in Latin America with Cristobal Perdomo, Jaguar Ventures27:44",
          "The Dynamics of the LatAm Market with Nathan Lustig, Magma Partners27:53"
        ]
      },
      {
        "title": "1Mby1M Roundtable Pitches",
        "subsections": [
          "Marie from Buenos Aires, Argentina11:11"
        ]
      },
      {
        "title": "Conclusion",
        "subsections": [
          "Practice Exercise 100:23",
          "Practice Exercise 258:32",
          "Bonus Lecture02:59"
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/4035738_272b.jpg"
  },
  {
    "title": "Validation for Tech Startups by Sramana Mitra",
    "price": "Current priceE£399.99",
    "description": "When it comes to launching your startup idea, validation is key. Throughout this course, I'll guide you through the process of validating your concept with customers, a universally accepted best practice in the startup world. You'll learn the mechanics of validation, supported by insightful case studies to illustrate the principles in action.While some may point to outliers like Steve Jobs who succeeded without validation, the reality is that most ventures falter without it. Aspiring tech entrepreneurs, particularly those entrenched in coding and development, often overlook the importance of market input. However, proceeding without validation is akin to courting failure.In this course, I'll show you why validation is crucial, especially for tech startups. Whether you're targeting B2C or B2B markets, understanding customer needs and preferences is paramount. While some development may be necessary to test ideas, prioritizing validation over technology development is the key to success.Join me as we explore proven validation methodologies honed over 15 plus years in the 1Mby1M curriculum. By enrolling in this course, you'll gain access to battle-tested strategies that will set your startup on the path to success. Let's embark on this transformative journey together and pave the way for your startup's successful entry into the dynamic tech landscape.",
    "instructor": "Sramana Mitra",
    "requirements": [
      "None."
    ],
    "whatYouWillLearn": [
      "How to do B-to-B / B2B / Business to Business Market Validation.",
      "How to do B-to-C / B2C / Business to Consumer Market Validation.",
      "Understand False Positives and False Negatives.",
      "The order of doing things in a startup context."
    ],
    "content": [
      {
        "title": "How to Validate Tech Startup Ideas",
        "subsections": [
          "IntroductionPreview01:03",
          "Validation of Tech Startup Strategy and Ideas02:25"
        ]
      },
      {
        "title": "Validation for B2B / Business to Business Startups",
        "subsections": [
          "Validation Methodology: BtoB19:50",
          "B2B validation Case Study: RightNow Founder Greg Gianforte25:29",
          "B2B validation Case Study: SnapLogic Founder Gaurav Dhillon00:39",
          "Ragic Founder Jeff Kuo on Bootstrapping a Cutting-Edge Generative AI Business51:37",
          "Backstroke / Pattern89 Founder RJ Taylor Brings GenerativeAI Products to Market33:01"
        ]
      },
      {
        "title": "Validation for B2C / Business to Consumer Startups",
        "subsections": [
          "Validation Methodology: B2C14:56",
          "B2C Validation Case Study: Obligo CEO Omri Dor00:37",
          "B2C Validation Case Study: SnackMagic CEO Shaunak Amin38:34"
        ]
      },
      {
        "title": "False Positives / False Negatives",
        "subsections": [
          "False Positives / False Negatives04:17",
          "False Negative Case Study: DoggieLawn Founder Natalie YounPreview26:44"
        ]
      },
      {
        "title": "Additional",
        "subsections": [
          "Practice Exercise58:32",
          "Extra03:00"
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/5787444_e4f7.jpg"
  },
  {
    "title": "Business Loan Brokering: Make Money Selling Money",
    "price": "Current priceE£3,099.99",
    "description": "With over 6 million small businesses across the United States and thousands more launching each day, there is an ever-growing need for funding to help these businesses start, grow, and scale. This presents an incredible opportunity for you.By becoming a business funding consultant, you position yourself as the trusted advisor for small businesses seeking financial solutions. Not only will you be helping these businesses thrive, but you'll also have the chance to earn significant commissions. This course is designed to show you how to build a six-figure income, all while working from the comfort of your own home.What You Will Learn:Maximize Your Earnings: Learn how to build a six-figure income in a niche with minimal competition, tapping into the ongoing demand for business funding solutions.Comprehensive Funding Products: Get access to a network of over 85 lenders, providing a wide range of financial products, including SBA loans, business credit coaching, and merchant cash advances.Proven Marketing Strategies: Discover effective marketing techniques that will help you stand out and attract clients as a Business Loan Broker.Lead Generation Tools: Utilize ready-made templates for social media and other channels to generate leads and quickly build your client base.Business Credit Building Solutions: Understand specialized credit-building products that help businesses enhance their credit profiles, making them more appealing to lenders and investors.Professional Landing Page: Set up a professional landing page to effectively capture leads and drive more business opportunities your way.Take advantage of this comprehensive training to become a successful Business Loan Broker. Start earning substantial income by helping businesses secure the funding they need and offering valuable business credit coaching services.",
    "instructor": "Daniel Dias",
    "requirements": [
      "No prior experience in business lending is required. We'll guide you through everything you need to know.",
      "A basic understanding of financial concepts is helpful but not necessary.",
      "Access to a computer and internet connection for online resources.",
      "An eagerness to learn and explore new business and marketing opportunities."
    ],
    "whatYouWillLearn": [
      "Develop effective marketing strategies to generate quality leads for business funding opportunities.",
      "Navigate the lending landscape with over 85 lenders to secure the best funding solutions for clients.",
      "Utilize social media platforms for lead generation and build a strong client base.",
      "Understand specialized credit products to help businesses improve their credit profiles and increase funding eligibility."
    ],
    "content": [
      {
        "title": "Introduction",
        "subsections": [
          "Introduction: How to Use This CoursePreview01:08",
          "Welcome00:57",
          "The Opportunity01:03"
        ]
      },
      {
        "title": "Consider These Items When Starting Your Business",
        "subsections": [
          "Consider These Items When Starting: Explanation Video09:41",
          "Below Is A List Of Items To Consider When Starting Your Business Loan Broker00:54",
          "Your First Week Worksheet00:45",
          "Join Our Private Facebook Page00:07",
          "Claim Your Landing Page00:47",
          "Become A Credit Monitoring Affiliate00:48",
          "Become A Credit Repair Affiliate00:22",
          "Get Setup With Nav00:12",
          "Our Simple Sales Process (FLOW CHART)00:20",
          "The Products & Services You OfferPreview00:35",
          "Book a Call To Ask Me Any Questions00:52"
        ]
      },
      {
        "title": "Funding Assessment Process Explained",
        "subsections": [
          "Funding Assessment Explained05:29",
          "Funding Assessment Pitch08:49",
          "Funding Assessment: What To Do When A Client Sends You The File Back02:20",
          "The Process of a Funding Assessment Call Back. Bad Credit Sell Credit Repair02:39",
          "Funding Assessment Call Back For  Startups02:34",
          "Funding Assessment Call Back For Businesses  Generating 100k03:03"
        ]
      },
      {
        "title": "Funding Programs",
        "subsections": [
          "Funding Tiers & Programs Explained02:53",
          "Funding Tiers & Programs00:25",
          "Tier 1 Breakdown01:07",
          "Tier 2 Funding Breakdown00:51",
          "Tier 3 Funding Breakdown01:31",
          "Tier 4 Funding Breakdown01:45"
        ]
      },
      {
        "title": "Unsecured Line-of-Credit Break Down",
        "subsections": [
          "ULOC Section Video Breakdown01:50",
          "Definitions & Terminology00:47",
          "What is a ULOC?01:26",
          "Basic Pre-Qualification Questions01:11",
          "Ways to Use the ULOC Product00:52",
          "The Process of an Application01:36",
          "Consider These Industries to Target00:28",
          "How the Payback Works00:41"
        ]
      },
      {
        "title": "MCA Break Down: Definitions & Terminology",
        "subsections": [
          "Merchant Cash Advance  Video Breakdown02:54",
          "Types Of MCA Programs13:00",
          "Being Able to Understand and Converse About MCAs Is Critical02:40",
          "What is a MCA?00:38",
          "Parties Involved in MCAs00:43",
          "The Different Types of Cash Advances04:02",
          "The Process of an Application01:32",
          "The Qualification Process02:49",
          "How to Price & Daily ACH01:11"
        ]
      },
      {
        "title": "Equipment Leasing Break Down",
        "subsections": [
          "Merchant Cash Advance  Video Breakdown02:04",
          "Equipment Financing Terminology08:20",
          "Different Types of Equipment Leases01:34",
          "Basic Pre-Qualification Questions01:07",
          "The Process of an Application01:27",
          "Consider These Industries to Target00:47",
          "Equipment To Consider Targeting00:42"
        ]
      },
      {
        "title": "Factoring Break Down",
        "subsections": [
          "Factoring  Video Breakdown02:28",
          "Intro to Invoice Factoring01:39",
          "Benefits of Factoring00:36",
          "Prospects & Referral Sources00:52",
          "Industries Ideal for Factoring00:28",
          "Invoice Factoring Cold Calling01:17",
          "Invoice Factoring Cold Calling - Part 2 of 201:28"
        ]
      },
      {
        "title": "SBA Loan Mini Course",
        "subsections": [
          "SBA Video Breakdown02:54",
          "Definitions & Terminology About SBA Loans02:33",
          "SBA Express Loan01:28",
          "SBA Micro Loan01:25",
          "SBA 7(a) Loan01:13",
          "SBA 504 Loan01:19"
        ]
      },
      {
        "title": "Preparing to Launch: Setting Your New Goals",
        "subsections": [
          "Setting Your New Goals02:54",
          "A Simple 5-Step Process to Setting and Achieving Your New Goals01:15",
          "Determine Your Financial Goals01:17",
          "Do Some Housekeeping01:20",
          "Creating Your Online Marketing Plan01:15",
          "Preparing Your Offline Marketing Plan01:31",
          "Establishing A \"YOU\" Plan01:17"
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/5938032_9031_5.jpg"
  },
  {
    "title": "How to turn your 9-5 into a Side Hustle?",
    "price": "Current priceE£399.99",
    "description": "This course will help you to leverage your skillset in doing what you love and your movement!Working with an incalculable boss and colleagues? You need an auxiliary plan.That’s what happens to some people having regular jobs. Life was stuck with the four corners of the company, and life is still lingering to a normal stature.Why not aspire for legendary, opulence, and prominence?There is so much to dream about, use your skillset and run the play.But wait, aspiring as legendary, opulence and prominence is not a facile path to take on.Remember that, before reaching the mountain is a bumpy road full of flabbergast encounters, and sometimes you need to go back and start again.Here I am, helping you to overcome that bumpy road and stand out as legendary.I will share with you these 5 steps on HOW TO TURN YOUR 9-5 TO SIDE HUSTLE.Are you ready to run the play?If yes, Start Now!What can you expect from this course?In this self-paced course consisting you’ll learn;TOPIC 1: How much you can make in the Business?TOPIC 2: What to do before setting up your Turo listing?TOPIC 3: How to add a vehicle to the listing?TOPIC 4: How to become an all-star host?TOPIC 5: Bonus; How to set up your business entity and qualify for funding?TOPIC 6: Bonus; A Video Tutorial on how to list a vehicleWhat do you need to succeed in this course?The only things you need are:An open mind and a willingness to leverage your skillsetsA commitment to being all in, which means watching the videos and doing the exercises.Why does this work?We have results, our students and colleagues have receipts to show proof.Will I get results?Yes, as long as you follow the step by step process in the exact success formula we have laid out in the blueprint from the course we provide and the online mentorship.How much time they have to put in and how much effort do they need to succeed?Depending on your goals 5-10 hours a week and can scale up depending on the size of your fleet and how much you want your business to Scale up.Your Outcomes After you finished the course?Go from confusion to mind clarity From unorganized skillset to right usage of skillset Ready to start your car rental business You will reach your target receipts You are now ready to start your own side hustle Becoming a King of your own Self How long have you been waiting for an opportunity like this? How much longer are you willing to wait?If you’re ready to adapt, learn, grow… and invest in yourself by investing in an industry that is exploding right now by serving others and sharing your movement,But here’s the catch…opportunity won't change your life. Only action will!So it's time to step up.Shift from fear to grace .Pushing through on what's held you back from the past.Joining now brings you confidence because you know what to do, how to do it, and why you're doing it.See you inside!If you're not totally satisfied with the Information above we can meet thru a Zoom Call for a short talk about the Course!Just message thru my Gmail account legendarywork1@gmail.comKeep Rocking! ?",
    "instructor": "King Musa",
    "requirements": [
      "The only things you need are:  An open mind and a willingness to leverage your skillsets  A commitment to being all in, which means watching the videos and doing the exercises."
    ],
    "whatYouWillLearn": [
      "Go from confusion to mind clarity",
      "From unorganized skillset to right usage of skillset",
      "Ready to start your car rental business",
      "You will reach your target receipts",
      "You are now ready to start your own side hustle"
    ],
    "content": [
      {
        "title": "Introduction and Navigation ?",
        "subsections": [
          "Introduction and Navigation ?Preview17:33",
          "Download and Answer the Nourish and Condition your mind and body activity.1 question"
        ]
      },
      {
        "title": "TOPIC 1 &2 : How much you can make in the Business ?",
        "subsections": [
          "TOPIC 1 &2 : How much you can make in the Business ?10:03",
          "Write your Goal Receipts!1 question"
        ]
      },
      {
        "title": "TOPIC 3: How to add a vehicle on the listing?",
        "subsections": [
          "TOPIC 3: How to add a vehicle on the listing?13:46",
          "What did you learn? Please create an SOP out of the Video.1 question"
        ]
      },
      {
        "title": "TOPIC 4: How to become all-star host?",
        "subsections": [
          "TOPIC 4: How to become all-star host?08:22",
          "Create your own Messages Templates and Send it to US!1 question"
        ]
      },
      {
        "title": "TOPIC 5: Extra Topic: How to setup your business entity and qualify for funding?",
        "subsections": [
          "TOPIC 5: Extra Topic; How to setup your business entity and qualify for funding?06:42",
          "List down your right system and research about banking stuff mentioned above.1 question"
        ]
      },
      {
        "title": "TOPIC 6: Extra Topic; How to List a Car on Turo",
        "subsections": [
          "TOPIC 6: Extra Topic; How to List a Car on Turo04:11",
          "List down the SOP on how to List a Car on Turo and Start to List Your Car.1 question"
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/5021984_fe62_3.jpg"
  },
  {
    "title": "How to sell your agency: all the steps to get acquired",
    "price": "Current priceE£399.99",
    "description": "Do you own an agency?If you’re looking to sell your agency, you have come to the right place. If you're not looking to sell your agency just yet, or perhaps not at all, knowing what the process involves will mean you are prepared should the time come or should you change your mind.When I sold my agency it changed my life.After starting from scratch and running my marketing agency for ten years, I sold it in March 2021 and left two weeks later.I learned so much from the process of preparing my agency for sale and meeting with twelve potential buyers. Knowing what to expect and laying the groundwork in advance meant achieving the perfect sale, for me, my team and clients.I’m ready to pass this knowledge on, so you can achieve your perfect sale too. This is the course I wish I had taken before I started down the journey of selling.In this course I cover:Creating a sale-ready agencyPreparing an impressive information deckFinding and approaching buyersSeeking help from a broker (or going it alone)Having successful meetings with potential buyersProgressing your sale to receiving offersNegotiating and completing due diligenceI'll talk you through everything I learned during this process. If you're intentional about selling your business, this course will help you make it happen. Selling your agency can mark a huge milestone in your career. It could create incredible freedom, from a financial, location and headspace perspective. Knowing what to expect could mean you negotiate better and achieve a higher multiple and better terms.I'm here to demystify the entire process for you - let's do this.",
    "instructor": "Jodie Cook",
    "requirements": [
      "Take this course if you own an agency that you might want to sell one day"
    ],
    "whatYouWillLearn": [
      "Gain clarity on exactly what you want from a sale",
      "How to create a sale-ready agency that is appealing to buyers",
      "How to identify and approach prospective buyers",
      "How to have successful conversations and negotiations with buyers",
      "How to progress your sale through to completion"
    ],
    "content": [
      {
        "title": "Introduction and preparing your agency for sale",
        "subsections": [
          "Introduction to this course and what to expectPreview02:48",
          "Get clear on what you want from your sale24:26",
          "The six components of a sale-ready businessPreview12:30",
          "Putting together an impressive information document09:32"
        ]
      },
      {
        "title": "Finding, approaching and meeting potential acquirers",
        "subsections": [
          "Finding potential buyers04:15",
          "The power of your existing network02:29",
          "Approaching potential buyers08:20",
          "Should you use a broker?06:36",
          "How to structure an initial meeting with a potential buyer13:24"
        ]
      },
      {
        "title": "Negotiate and close your deal",
        "subsections": [
          "Inviting offers for your agency04:57",
          "Expertly negotiating your sale10:12",
          "Closing the deal and final steps10:22"
        ]
      },
      {
        "title": "Course conclusion",
        "subsections": [
          "Don't forget and further resources04:09",
          "Over to you00:55"
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/4593388_14be.jpg"
  },
  {
    "title": "Fiverr 2023: Learn The Basics And Start Selling!",
    "price": "Current priceE£399.99",
    "description": "Hi Future Fiverr Sellers, my name is Muhammad Hashir, and I have years of Fiverr experience. I am well-versed in Fiverr SEO and Graphic Design. I also run the largest Fiverr community on Discord, with over 3900 members. My sales strategies have been updated to work with the Fiverr 2023 algorithms. You will be given lifetime access to a private Discord server after purchasing this course, where you can ask me questions about the course and talk to your fellow sellers.Do you need help getting started on Fiverr or perhaps you can't get any sales?  Then this is the course for you. In this course, you will learn how to finish your profile, create professional gigs, and Fiverr Search Engine Optimization (SEO) within the site. Below are some of the essential things you will learn:- How to write a clear, professional, and word-rich description- How to get the top 10% in Fiverr Tests by providing answer keys through Discord.- How to find buyers with eye-catching photos- How to write a clear title- How to use Fiverr gig analytics your advantage- Certificate of Completion- Access to a private Discord Server- Lifetime Seller SupportI look forward to helping you get started with your Fiverr career and hope I can get your gigs kick-started.",
    "instructor": "Muhammad Hashir",
    "requirements": [
      "There are no requirements for experience, Just have a Fiverr account. This course is for newbies just starting out with Fiverr."
    ],
    "whatYouWillLearn": [
      "By the end of this course, you will have learned how to:  Finish your profile, create your first gig, and begin selling!",
      "During this course, you will be learning advanced selling strategies such as Fiverr SEO, clear and word-rich descriptions, and clear titles.",
      "This course will also teach you how to get in the top 10% of Fiverr Test Takers.",
      "Certificate of Completion: Finishing 100% of this course will reward you with a certificate to show your dedication to the course.",
      "You will learn how to use Fiverr gig analytics to your own advantage"
    ],
    "content": [
      {
        "title": "Introduction",
        "subsections": [
          "What will you learn?00:19",
          "How to create a Fiverr account.Preview00:50"
        ]
      },
      {
        "title": "How to setup your Fiverr Profile",
        "subsections": [
          "How to set up your Fiverr profilePreview02:10"
        ]
      },
      {
        "title": "Set up your first Fiverr Gig and take Fiverr Tests",
        "subsections": [
          "Fiverr Tests02:10",
          "Fiverr Gig setupPreview11:10"
        ]
      },
      {
        "title": "How to optimize description and tags",
        "subsections": [
          "How to optimize your tags to get sales03:11",
          "How to optimize your description01:36"
        ]
      },
      {
        "title": "How to analyze Fiverr analytics and how to use it to your advantage.",
        "subsections": [
          "How to use Fiverr gig analytics03:02"
        ]
      },
      {
        "title": "How to use Fiverr support, Fiverr Pro, and course recap.",
        "subsections": [
          "Fiverr Support02:42",
          "About Fiverr Pro01:45",
          "Course Recap and key takeaways01:58"
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/5429020_2394_3.jpg"
  },
  {
    "title": "Course Creator: Create, Launch & Sell Your Own Online Course",
    "price": "Price not found",
    "description": "If you are looking to make passive income online without trading your time for money, then read on!There is nothing more stressful than trying and researching every single way possible to make money online and not finding the perfect solution or investing alot of money that you are not sure you will ever see again.Well, what if I told you that you actually have the solution already, and you just need to find it out?I know how it feels. A couple of years ago, I was trading my time for money just in order for me to able to pay rent at the end of the month and not end up homeless, while still putting myself through depression to finish my studies.It is a miserable situation to be financially free, where you can literally do anything you want and fly anywhere you want, whenever you have the urge to.Although freelancing is a great way to make money online, it is still not the best way out there.Getting paid $10 an hour through online income is still considered as a job, as you don't have the most valuable item in the world, which is time.Being wealthy doesn't mean having 1 million dollars in your bank account.Being wealthy means having the freedom to do whatever you want to do in your life without any obstacles.Having the skill to trade your time for money, also means that this skill can be monetized in a way, where you can achieve passive income and wake up on PayPal buzzing your phone informing you that you got yet another purchase.And if you think monetizing this skill needs a HUGE budget or more than 100k Instagram followers, then think again.You don't even need to spend any budget on ads and all of your traffic can come from totally organic reach.Let me tell you one thing, you just hit the jackpot.Introducing: Coursesy Course Creator!Coursesy Course Creator is an online course that will help you discover your hidden skill that you can monetize online by writing, outlining, designing, filming, editing, and publishing it as your own profitable online course. The step-by-step guide modules are shaped in a way to take you through a smooth transition from acquiring the entrepreneurial mentality and discovering you talent all the way to finalizing and scaling your online course to a passive income machine.We understand that although this course has everything you need to start your journey from point A to point B, it might not be for everyone. That's why we are offering money-back guarantee for all students!",
    "instructor": "Ali Matar",
    "requirements": [
      "No previous experience needed!"
    ],
    "whatYouWillLearn": [
      "Brainstorm, Create, Shape and Sell Your Own Successful Online Course",
      "Make Money Passively Online",
      "Learn How to Make Money from Teaching an Online Course",
      "Learn How to Correctly Price Your Course"
    ],
    "content": [],
    "image": "https://img-c.udemycdn.com/course/240x135/5531870_952b_2.jpg"
  },
  {
    "title": "Smart Negotiation",
    "price": "Current priceE£2,299.99",
    "description": "Successful negotiators are not born with a gift; they simply have learned and followed the rules of the negotiation game.Smart Negotiation is designed to provide the fundamental principles of successful negotiations by following the universal laws of negotiation.Let us honor and celebrate your uniqueness. You have a unique personality that you are comfortable with; you do not need to act and be someone you are not. Similar to driving, you have your own style and way of negotiating. As long as you follow all the negotiation \"laws,\" you will reach your destination!Smart Negotiation offers a new perspective for all your daily interactions and incorporates the latest scientific findings in negotiation as well as ancient wisdom to attain a proper mindset. In this way, you can embrace the opportunities and apply the skills that you learn in this course to maximize the gains for all parties in your negotiations.Learning begins with the basic principles - the laws of trust and communication - that are necessary to build a strong foundation for your negotiated agreement. Next is the law of intention where you learn about the map of human behavior and how you can set and maintain your goals. This is followed by the law of strength, which imparts how to tap into your source of strength to have clear situational awareness as you navigate toward your goal(s). Then the course emphasizes the oft ignored importance of creativity and the law of flexibility enabling you to avoid failure in your negotiations.Finally, we learn the law of manifestation and how to prepare, rehearse, and implement as you move toward finalizing your agreement.We encourage participants to start applying what they learn in basic and simple negotiations in a friendly environment with your family and colleagues. As you feel comfortable and develop confidence, gradually use your newly gained knowledge in more important negotiation situations to achieve optimal outcomes for all parties.",
    "instructor": "Dr. Mehrad Nazari",
    "requirements": [
      "No prerequisite necessary for this course.  Just stay open minded, follow through with the practices and apply the skills that you learn in your everyday negotiations and interactions."
    ],
    "whatYouWillLearn": [
      "Discover the habits of masterful negotiators by understanding negotiation fundamentals, theories and the latest scientific findings.",
      "Develop the mindset to be a leader in any negotiation by handling difficult situations and people through mastering your communication and interpersonal skills.",
      "Learn how to be flexible without compromising your core values with strategic preparation and research that gains you respect and support.",
      "Gain confidence in your personal and professional life by demonstrating assertiveness and empathy for superior outcomes and collective well-being.",
      "Apply the principals of Smart Negotiation and reap the benefits in your relationships, finances, reputation and well-being."
    ],
    "content": [
      {
        "title": "Introduction",
        "subsections": [
          "WELCOMEPreview02:43",
          "INTRODUCTIONPreview08:04",
          "Retention Exercise12 questions"
        ]
      },
      {
        "title": "The Law of Trust",
        "subsections": [
          "THE LAW OF TRUST08:45",
          "Retention Exercise10 questions"
        ]
      },
      {
        "title": "The Law of Intention",
        "subsections": [
          "THE LAW OF INTENTION16:53",
          "Retention Exercise12 questions"
        ]
      },
      {
        "title": "The Law of Communication",
        "subsections": [
          "THE LAW OF COMMUNICATION14:57",
          "Retention Exercise12 questions"
        ]
      },
      {
        "title": "The Law of Strength",
        "subsections": [
          "THE LAW OF STRENGTH11:17",
          "Retention Exercise12 questions"
        ]
      },
      {
        "title": "The Law of Flexibility",
        "subsections": [
          "THE LAW OF FLEXIBILITY09:28",
          "Retention Exercise12 questions"
        ]
      },
      {
        "title": "The Law of Manifestation",
        "subsections": [
          "THE LAW OF MANIFESTATION10:27",
          "Retention Exercise12 questions"
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/5488714_a700_3.jpg"
  },
  {
    "title": "Master the Growth of Digital Sales - Digital Sales Blueprint",
    "price": "Current priceE£399.99",
    "description": "Dive into the world of e-commerce with a practical guide to launching and scaling your business through digital product sales.This course is designed to equip both aspiring and experienced entrepreneurs with practical knowledge and proven strategies to achieve rapid and profitable growth in today's competitive marketplace. We will focus on the 20% of activities that will bring 80% of your results and help you grow rapidly.Uncover the secrets of entrepreneurial success with our comprehensive course, \"Mastering Entrepreneurial Growth: Strategies to Outpace the Competition and Skyrocket Your Business Success.\" This course is designed to equip both aspiring and experienced entrepreneurs with practical knowledge and proven strategies to achieve rapid and profitable growth in today's competitive marketplace.What you will learn:Freelancing and remote services: Learn how to build and grow a successful freelance career in areas such as writing, graphic design, web development, and virtual assistance. Discover how to find clients, set competitive rates, and effectively scale your business.Digital marketing and online presence: Master the essential tools and techniques for building and growing your digital footprint. This section covers social media management, blogging, YouTube content creation, podcasting, and online teaching, and provides you with the skills to create engaging content, engage your audience, and monetize your platforms.E-commerce and product-based businesses: Dive into the world of e-commerce with a practical guide to launching and scaling your business through dropshipping, print-on-demand, and digital product sales. Explore crowdfunding and membership models to increase your revenue and build a base of loyal customers.Investments and passive income opportunities: Explore various ways to generate passive income and build wealth. Learn about affiliate marketing, investing, real estate crowdfunding, stock photography, online surveys, and app testing, and understand how to maximize your earnings with minimal effort.Gig economy and local services: Discover opportunities in the gig economy with insights into ride-sharing, delivery services, and task-based platforms. This section emphasizes practical skills for navigating and thriving in these dynamic markets.By the end of this course, you will have the knowledge and skills to outpace the competition and achieve sustainable business success. Join us and transform your entrepreneurial journey today!",
    "instructor": "Branislav Dubrava",
    "requirements": [
      "No experience needed, you will learn everything from scratch."
    ],
    "whatYouWillLearn": [
      "Learn advanced strategies to outmaneuver your competition and achieve market dominance",
      "Learn proven tactics for accelerating business growth while maintaining profitability",
      "Discover innovative methods for scaling your startups rapidly without compromising quality",
      "Gain insights into effective marketing, sales, and operational techniques to ensure sustainable business success"
    ],
    "content": [
      {
        "title": "Introduction",
        "subsections": [
          "IntroductionPreview02:39"
        ]
      },
      {
        "title": "Freelancing and Remote Services",
        "subsections": [
          "Freelancing WritingPreview11:30",
          "Graphic Design11:41",
          "Web Development06:56",
          "Virtual Assistant07:17"
        ]
      },
      {
        "title": "Digital Marketing and Online Presence",
        "subsections": [
          "Social Media Management05:27",
          "E-commerce06:16",
          "Dropshipping06:43"
        ]
      },
      {
        "title": "E-commerce and Product-Based Ventures",
        "subsections": [
          "Print on Demand06:30",
          "Affiliate Marketing06:10",
          "Blogging04:30",
          "YouTube06:45",
          "Podcasting10:50",
          "Online Teaching10:49",
          "Webinars10:17",
          "Coaching and Consulting10:09",
          "Stock Photography08:58",
          "Investing11:12",
          "Real Estate Crowdfunding11:26"
        ]
      },
      {
        "title": "Investment and Passive Income Opportunities",
        "subsections": [
          "Online Surveys10:25",
          "Testing Websites and Apps07:07",
          "Selling Digital Products06:03",
          "Ride-sharing-Delivery07:28",
          "Task-Based Services05:54",
          "Remote Job Opportunities05:36"
        ]
      },
      {
        "title": "Gig Economy and Local Services",
        "subsections": [
          "Crowdfunding Projects05:37"
        ]
      },
      {
        "title": "Fiverr",
        "subsections": [
          "Fiverr28:52",
          "Patreon and Memberships05:14"
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/6065387_931f_2.jpg"
  },
  {
    "title": "How to Raise Funds: For Women.",
    "price": "Current priceE£3,099.99",
    "description": "Women receive less than 2.7 % of Venture Capital investments and it is time to change these numbers. Research shows that despite all gains in many fields, women still lag behind in growing businesses. Some claim investors are not recognizing that women develop firms differently, that they take fewer risks, that banks would not lend as much, but the reality is quite DIFFERENT. Women are less confident and less prepared to raise funds. This course was developed to overcome these two weaknesses. In particular you will:1. Become aware of your relationship with money.2. Evaluate and overcome, if necessary, any of the Ten Unwealthy Habits.3. Understand the financial world of business (also applicable to non-profits).4. Define your goals.5. Understand key financial concepts and funding mechanisms.6. Select the sources of funding that better fit your goals. 7. Establish a funding strategy.This course is structured in building blocks, so you can do as deep or superficial as you'd like. Browse through the mini-videos, read the supporting texts, revise your understanding or watch the interviews.Whether you are ready to raise funds, want to help others, learn the basics, we are here to help.If you are a consultant, contact us to create a program for your group.",
    "instructor": "Alicia Castillo Holley",
    "requirements": [
      "A basic understanding of business is required. Students that do not have such knowledge might contact us for specific information.",
      "Knowledge about financial terms is recommended: balance sheet, income statements, cash flow,  equity."
    ],
    "whatYouWillLearn": [
      "Create an irresistible commercial deal that fits with your own interest",
      "Understand the differences between Unfunding, Equity, and Debt Funding",
      "Establish a credible and action-based funding strategy",
      "Learn the major pitfalls in getting funds from founders, family, and friends",
      "Overcome obstacles to raising capital that are common to women",
      "Be confident and professional about the funding process"
    ],
    "content": [
      {
        "title": "Your starting point",
        "subsections": [
          "Interview: What would you ask a partner of a $150M VC fund?Preview39:49"
        ]
      },
      {
        "title": "Funding Mechanisms",
        "subsections": [
          "Unfunding04:19",
          "Equity Funding01:51",
          "Debt Funding03:40"
        ]
      },
      {
        "title": "Unfunding: Using resources, not cash",
        "subsections": [
          "Introduction to Unfunding02:19",
          "Reverse Financing02:01",
          "Crowdfunding02:30",
          "Factoring01:43",
          "Leasing01:40",
          "Dissapearing03:43",
          "Gifting01:59",
          "Partnering and Bartering02:10",
          "Granting01:41"
        ]
      },
      {
        "title": "Equity funding - Owners of the company",
        "subsections": [
          "Introduction to Funding by Equity02:17",
          "Founders02:16",
          "Relatives03:38",
          "Friends02:53",
          "Angel Investors02:54",
          "Equity Partners03:10",
          "Venture Capital Funds04:30"
        ]
      },
      {
        "title": "Debt Funding",
        "subsections": [
          "Introduction to Funding by Debt02:42",
          "Short Term Debt03:50",
          "Long Term Debt01:54",
          "Calculating Borrowing Capacity02:27",
          "Convertible Notes02:55"
        ]
      },
      {
        "title": "Crafting a Funding Strategy",
        "subsections": [
          "A Funding Strategy02:20",
          "Step 1. Define your Passion-based Goal01:42",
          "Step 2. Outline How Will You Measure Success01:31",
          "Step 3. Identify Your Team02:17",
          "Step 4. Define the Resources You Need01:55",
          "Step 5. State Your Starting Point02:04",
          "Step 6. Select the Ideal Source of Funding02:35",
          "Step 7. Prepare a Funding Proposal01:43",
          "Step 8. Customize the Message02:05",
          "Step 9. Start Acting (and Stop Thinking)03:22",
          "Step 10. Close the Deal03:04"
        ]
      },
      {
        "title": "How to Create a Business Plan",
        "subsections": [
          "Introduction03:09",
          "Operations - Calculating Costs02:45",
          "Market - Creating Opportunities03:04",
          "Market - Discovering Opportunities03:18",
          "You - Passion, Knowledge, and Purpose04:01",
          "Your Team - From Dreams to Goals03:06",
          "Calculating Funding Needs02:52"
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/475344_3b23_4.jpg"
  },
  {
    "title": "CrashCourse Lite for Authors.",
    "price": "Current priceE£399.99",
    "description": "More authors are creating online course than ever before. This ‘Lite’ easy-to-use online course will show you how.As an author you have a distinct advantage over other course creators because you have all the content already produced.However many authors have never created an online course before and often make the same rookie mistakes. They don’t understand the three types of course, how they can best support your business, how long they should be, what content to include, what to exclude, what price point it should be sold at, and more.You will learn;The three types of online courseHow to select the type of course that's right for youHow a course can best support and grow your businessHow long your course should beWhat content you should includeHow to keep your students engagedWhat price point to sell atAnd what your best next step isThis course will answer all these questions and more.Providing clarity, motivation and direction.Simply use the free downloads included in the course and work through the video exercises and by the end of this short course you will have completed work sheets that answer many (if not all) of your critical course creation decisions. You will then be able to create an inspirational online course that will wow your students, enhance your reputation as an expert in your field, and grow your business at the same time. Without the usual stress, confusion and mistakes that others make.",
    "instructor": "Simon K Williams",
    "requirements": [
      "No previous experience required",
      "This course is created for authors (non authors will learn just as much, but will need 'content')"
    ],
    "whatYouWillLearn": [
      "Learn how to create an inspirational online course",
      "Select and craft your content to inspire your students",
      "Use course design (instructional design) to create a more compelling product",
      "Understand the platform options, and which is right for you",
      "Learn the different engagement techniques and decide which ones you will use",
      "Learn about camera, microphone, software selection and which ones you should use",
      "You will get an easy-to-follow step-by-step production plan that will get your course fast",
      "Learn: effective course content, best practices in course design, choosing a platform, and following a production plan to speed up course completion"
    ],
    "content": [
      {
        "title": "Crash-Course 4 Authors - Introduction",
        "subsections": [
          "Crash-Course 4 Authors - IntroductionPreview02:31",
          "Books & Courses & OpportunityPreview04:22",
          "Crash-Course 4 Authors - Promo VideoPreview00:57"
        ]
      },
      {
        "title": "Your Course Overview",
        "subsections": [
          "Download Your Critical Course Docs00:01",
          "Section introductionPreview01:19",
          "Types of commercial coursesPreview03:40",
          "Your course commercial goal00:39",
          "Product family (architecture)06:34",
          "Your student avatar06:57",
          "Your Course Overview - Quiz1 question",
          "Your student's needs03:58",
          "Ideal Final Solution (IFS)06:09",
          "What you can do06:20",
          "Title & description11:25",
          "Course Overview - Recap01:58",
          "Course Overview - Test3 questions"
        ]
      },
      {
        "title": "Curating Course Content",
        "subsections": [
          "Curating course content - Introduction00:30",
          "How long should your course be?02:32",
          "Converting your book into a compelling course07:59",
          "Curating course content - Quiz4 questions",
          "Other content you need to include03:50",
          "Course Content - Recap00:36"
        ]
      },
      {
        "title": "Your Best Next Step",
        "subsections": [
          "Your best next step06:52"
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/4506358_2a42_4.jpg"
  },
  {
    "title": "6 Principles of a Successful Online Business",
    "price": "Current priceE£399.99",
    "description": "Do you want to learn how to start an online business?Then this course is a must for you!It teaches you the 6 important principles which form the basis of a successful online business.The truth is that only 5% of online businesses actually succeed and the reason for that is a lot of online entrepreneurs don't put enough thought into forming good foundations of their online business. Usually, online businesses are built on shaky foundations and with a short term thinking. This course will teach you how about the different principles that you should apply before starting your online business and also during your online entrepreneurship journey. Here are the 6 vital principles that you will learn about in this course:Principle #1 - The Principle of \"MOAT\"Here you will learn the importance of competitive advantage.Principle #2 - The Principle of Narrow NicheHere you will learn about the importance of operating your online business in a specific domainPrinciple #3 - The Principle of Market Demand ValidationHere you will learn different techniques that will help you evaluate the market potential for your online business Principle #4 - The Principle of Margin (Revenue, Expenses and Profit)Here you will learn about the different financial metrics that you should be aware of if you are to run an online business that an rely on its own profitPrinciple #5 - The Principle of a Marketing FunnelHere you will learn about how to market your products and services using an objective based strategy.Principle #6 - The Principle of Online InfrastructureHere you will learn about some of the best tools and software to use to build the infrastructure of your online business.Throughout this course, I will be giving examples from my own online business as well as examples of some other well known online businesses.What you will learn in this course is what I've learned after running a successful and profitable online business for over a decade.I hope to see you inside the course!",
    "instructor": "Kush Sharma",
    "requirements": [
      "There are no pre-requisites. This course is perfect for complete beginners as well as people who are already running an online business."
    ],
    "whatYouWillLearn": [
      "Principles that form the basis of a successful online business",
      "Importance of competitive advantage.",
      "Importance of operating an online business in a specific domain (niche)",
      "Different techniques that will help them evaluate the market potential for their online business",
      "Different financial metrics that they should be aware of if they are to run an online business that an rely on its own profit",
      "How to market their online products and services using an objective based strategy",
      "Some of the best tools and software to use to build the infrastructure of an online business"
    ],
    "content": [
      {
        "title": "Introduction to the Course",
        "subsections": [
          "How This Course is StructuredPreview04:10"
        ]
      },
      {
        "title": "Principle #1 - The Principle of \"MOAT\"",
        "subsections": [
          "What is MOAT and what factors make up a MOAT in an online business?Preview07:09",
          "An example of MOAT from my own online businessPreview07:57",
          "Discussing MOAT by taking the example of a well known company03:22",
          "Some important points to know about MOAT03:18"
        ]
      },
      {
        "title": "Principle #2 - The Principle of Narrow Niche",
        "subsections": [
          "What does a narrow niche mean? Demonstration with examples05:27",
          "What are the advantages of operating in a narrow niche?06:02",
          "Example of a narrow niche from my own online business05:11",
          "Be careful about narrowing down too much05:02"
        ]
      },
      {
        "title": "Principle #3 - The Principle of Market Demand Validation",
        "subsections": [
          "Doing Keyword Research Using Google Keyword Planner06:51",
          "Surveying the Competition to Evaluate Market Demand04:26",
          "Using YouTube, Google Ads and Reddit to Evaluate Market Demand05:00",
          "Some Other Advanced Techniques to Evaluate Demand07:25"
        ]
      },
      {
        "title": "Principle #4 - The Principle of Margin (Revenue, Expenses and Profit)",
        "subsections": [
          "Understanding Revenue, Expenses and Profit (Margin)06:03",
          "Taking an example to understand how margin relates to a business model04:11",
          "Different ways to increase margin09:25",
          "Why certain companies ignore margin06:15"
        ]
      },
      {
        "title": "Principle #5 - The Principle of a Marketing Funnel",
        "subsections": [
          "Understanding the concept of a marketing funnel with some examples05:45",
          "The advantages of implementing a marketing funnel03:52",
          "How I use funnels in my own online business03:30",
          "Important things to know about a marketing funnel04:01"
        ]
      },
      {
        "title": "Principle #6 - The Principle of Online Infrastructure",
        "subsections": [
          "The Different Elements of an Online Business Infrastructure08:53",
          "Which is the best platform to build your website on?07:54",
          "Which Landing Page software is the best?04:31",
          "Which is the best email marketing software?05:48"
        ]
      },
      {
        "title": "Conclusion",
        "subsections": [
          "One Important Point to Remember02:29"
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/5596390_b3d9.jpg"
  },
  {
    "title": "How to Write a Music Business Plan For Busy Professionals",
    "price": "Current priceE£399.99",
    "description": "There is a saying in the marketing world.  If you fail to plan, you plan to fail.  This course is aimed at helping you to succeed in your music business.  After all, it's what you've been dreaming of your whole life.  Therefore, you will want to succeed.  You will want to make it in the music world.  So, I want you to make it in the music world too.How to Write a Music Business Plan for Busy Professionals is built to help you structure your business plan, with questions that prompt you to think of each section with clarity and thoroughly.  Furthermore, the course is built for busy working professionals who have little time. It is comprised of no more than 15 videos with a total running time of just over an hour.  However, what makes it appealing to busy professionals is that it is full of bitesize videos with questions that will help you to formulate an exceptionally effective music business plan.If you have a business as a band, a music software developer (DAWs, VST plugins, virtual studio software), a manufacturer of hardware instruments, a record label, or any other business in the music industry, this course will help you.Whether you are just starting your business, or if you've been working for some weeks, months or years, this course will help you to develop a winning plan for business success.",
    "instructor": "David Verney",
    "requirements": [
      "The course assumes you are either planning or running a music business."
    ],
    "whatYouWillLearn": [
      "By the end of this course, you will have a fully functioning business plan",
      "The course will encourage you to think about every aspect of your business plan.",
      "Plan to succeed with a presentable professional music business plan",
      "You will be able to attract investment from investors, financial instiutions and stakeholders."
    ],
    "content": [
      {
        "title": "Introduction",
        "subsections": [
          "Course trailerPreview04:40",
          "Why is it so Important to Have a Business Plan?Preview03:07",
          "Introduction to the TutorPreview03:23"
        ]
      },
      {
        "title": "Your Business Plan",
        "subsections": [
          "Executive Summary03:24",
          "Business Description04:55",
          "Market Research05:11",
          "Market Analysis04:14",
          "Marketing and Sales Strategy05:45",
          "Product Line04:10",
          "Operations and Management04:51",
          "Financial Plan05:04",
          "SWOT Analysis05:16",
          "Risk Management10:38",
          "Appendix06:02"
        ]
      },
      {
        "title": "BONUS Section",
        "subsections": [
          "BONUS LECTURE:  Connect With Me on Social Media00:09"
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/5910340_6686_2.jpg"
  },
  {
    "title": "Make Money with Chatgpt and Dall-E Freelancing",
    "price": "Current priceE£399.99",
    "description": "Ready to level up your freelancing skills? We are here to help start and scale your Freelancing Business with Chatgpt and Dall-E 2.Our course covers everything you need to know about use of AI in Freelancing. You'll learn how to conduct effective keyword research, create stunning gig images, and get your first Order Fast on Fiverr.The real highlight? Our deep dive into DALL-E, the revolutionary AI program that can generate stunning images from text descriptions. Learn how to create various types of AI art, from Dall-E Outpainting editor to Realistic Portraits, and explore the ways you can sell your DALL-E art as a freelancer. Join us and take your freelancing skills to the next level!Effective Keyword Research with AI to improve your gig ranking on Fiverr.How to create stunning Gig Images using AI tools.Strategies for Gig Creation to get your first order fast.How to improve your Communication Skills with AI to succeed as a freelancer.Complete freelance projects with AI and Demo a real-life project.Fiverr Profile Optimization with AI for maximum exposure and sales.How to Get Started with DALL-E, the revolutionary AI program for generating images from text descriptions.Creating AI art with DALL-E, including Dall-E Outpainting Editor and Realistic Portraits.Ways to SELL your DALL-E Art as a Freelancer.Ready to unlock your full potential? Look no further than Haider Studio!With over 7,000 students worldwide, our community is waiting for you to join.Ready to take your Skills to the Next Level? Enroll Now & Start Learning AI Freelancing today.",
    "instructor": "Haider Studio",
    "requirements": [
      "No Previous AI or Freelancing Experience is Needed to take this Course"
    ],
    "whatYouWillLearn": [
      "Learn Fiverr Keyword Research with AI",
      "Learn Gig Images Creation and Gig Creation with AI",
      "Communication Skills & AI",
      "Freelance Demo Project",
      "Learn Profile Optimization with AI",
      "Learn to Create Stunning AI Art with Dall-E 2",
      "Learn everything about Dall-E 2",
      "Learn to create Realistic Portraits with Dall-E",
      "Freelance with Dall-E & Learn ways to sell your Dall-E Art"
    ],
    "content": [
      {
        "title": "Introduction",
        "subsections": [
          "Course ContentPreview00:21"
        ]
      },
      {
        "title": "Gig Creation with AI",
        "subsections": [
          "Keyword Research with AIPreview05:06",
          "Gig Images with AI (Templates)03:33",
          "Designing Professional Gig Images10:03",
          "Gig Creation with AI16:29",
          "Write a Killer Copy for your Gig07:54",
          "Congratulations!Preview01:43",
          "Get Your First Order FASTPreview00:35"
        ]
      },
      {
        "title": "AI Freelancing",
        "subsections": [
          "Communication Skills & AI04:31",
          "Complete Freelance Projects with AI07:15",
          "Freelance Project Demo06:31",
          "Profile Optimization with AI08:19"
        ]
      },
      {
        "title": "Dall-E Basics",
        "subsections": [
          "Getting Started with Dall-EPreview01:22",
          "DALL-E PricingPreview01:37",
          "Commercial Use of Dall-EPreview01:30",
          "AI Art with DALL-E 206:38",
          "Exploring DALL-E 2 (Part 01)02:51",
          "Exploring DALL-E 2 (Part 02)06:17",
          "Outpainting with DALL-E 2Preview04:32",
          "Realistic Portrait with DALL-E 205:24"
        ]
      },
      {
        "title": "Sell your DALL-E Artwork",
        "subsections": [
          "Ways to Sell your DALL-E Art03:38",
          "Major Freelancing Platforms03:50"
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/5300316_62fe_2.jpg"
  },
  {
    "title": "5 Day Market Research Mastery Challenge",
    "price": "Current priceE£399.99",
    "description": "Unlock the secrets to successful product launches with our 5-Day Market Research Mastery Challenge. This course is designed for established professionals and business owners eager to grow and innovate. Through a step-by-step process, you'll learn how to identify lucrative product ideas, validate their potential quickly, and minimize the risks associated with new product launches.Our comprehensive program covers everything from debunking common market research myths to mastering effective research techniques. You'll gain hands-on experience with tools and methods that will help you deeply understand your target market's needs and preferences. The course also delves into creating minimum viable products (MVPs) and gathering actionable feedback to refine your ideas.Throughout the five days, you'll overcome common roadblocks, such as time management and information overload, and learn how to maintain momentum. Additionally, we provide troubleshooting guidance for frequently asked questions and potential challenges.By the end of this course, you'll be equipped with the skills to confidently launch products that resonate with your market, saving time and resources while maximizing your chances of success. Whether you're looking to expand your existing business or explore new opportunities, this course offers the tools and insights needed to transform your ideas into successful ventures. Join us and take the first step toward mastering market research and product validation.",
    "instructor": "Sathyanarayanan Saketharam",
    "requirements": [
      "Basic Understanding of Business Operations.",
      "Access to a Computer and Internet.",
      "Willingness to Learn and Apply New Methods.",
      "Time Commitment.",
      "Basic Research and Analytical Skills.",
      "Motivation to Grow and Innovate continuously."
    ],
    "whatYouWillLearn": [
      "Identify Niche and Product Ideas.",
      "How to conduct an effective Market Research?",
      "Validate Product ideas Quickly.",
      "Minimize Risks and Avoid Common Pitfalls during Product Development process.",
      "Develop Confidence and Launch Successfully"
    ],
    "content": [
      {
        "title": "The 5 Day Market Research Mastery Challenge",
        "subsections": [
          "Section #1: IntroductionPreview11:31",
          "Personal Story14:56",
          "Benefits of this course01:50"
        ]
      },
      {
        "title": "The Myths",
        "subsections": [
          "The Myths06:36"
        ]
      },
      {
        "title": "The Mechanics",
        "subsections": [
          "Step by Step process for Identifying and validating product ideas31:34",
          "2. Initial Validation32:46",
          "3. Market Research08:18",
          "4. Detailed Validation08:16",
          "4. Detailed Validation part204:55",
          "Transition from Detailed Validation to Decision Making07:13",
          "5. Decision Making01:17"
        ]
      },
      {
        "title": "Section 4: Maintenance",
        "subsections": [
          "Maintenance04:45"
        ]
      },
      {
        "title": "Section:5 Troubleshooting",
        "subsections": [
          "Troubleshooting06:37"
        ]
      },
      {
        "title": "Section 6: Conclusion",
        "subsections": [
          "Conclusion03:10"
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/6076757_0b82_2.jpg"
  },
  {
    "title": "Injury Prevention Mastery Using ChatGPT for Fitness",
    "price": "Current priceE£399.99",
    "description": "Are you aware that a staggering 80% of fitness enthusiasts experience injuries that could have been prevented with the right knowledge and personalized training? This shocking statistic highlights the critical need for a holistic approach to fitness—one that goes beyond traditional workout routines.Introducing \"Holistic Fitness Mastery: AI, Injury Prevention, and Personalized Wellness,\" a groundbreaking Udemy course designed to revolutionize your fitness journey. Say goodbye to generic workouts and hello to a personalized, injury-preventive, and AI-driven approach that transforms not only your physique but your overall well-being.In this comprehensive course, we delve into the revolutionary integration of AI technology, led by the powerful ChatGPT. Learn to navigate and leverage the capabilities of ChatGPT to tailor fitness plans to your unique needs, setting a new standard in the world of personalized wellness.Uncover the secrets of injury prevention as we guide you through the principles of safe exercise design and biomechanics. Structure balanced workouts, adapt routines for various fitness levels, and fine-tune your plan based on real-time analysis—empowering you to train smart, not just hard.But this course isn't just about the physical. Understand the profound connection between mind and body, discovering how exercise enhances cognitive health and emotional well-being.Transforming your fitness journey doesn't have to be complicated or risky.Ready to revolutionize the way you approach fitness and well-being?Risk-Free Learning:Not sure yet? No worries. Your investment in your fitness and knowledge is backed by Udemy's 30-day money-back promise. No risk, all reward.Ready to Transform Your Journey?Hit that \"Enroll\" button and start changing your life for the better right now!",
    "instructor": "Ron Betta",
    "requirements": [
      "None, I walk you through it step by step."
    ],
    "whatYouWillLearn": [
      "People seeking to reduce the risk of injury during exercise.",
      "Fitness Professionals who want to help reduce the risk of injury to their clients",
      "Fitness facilities who want to learn how to help clients exercise with reduced risk of injury",
      "Anyone seeking information on how to use ChatGPT to help design programs, learn about nutrition, supplementation and more - all while aiming to keep people safe",
      "Personal Trainers who want to learn how to work with experts in the fitness industry including Doctors, Physical Therapists and Dietitians.",
      "Personal Trainers who want enhance their career with the latest technology.",
      "Anyone who wants to learn about safely exercising."
    ],
    "content": [
      {
        "title": "Welcome",
        "subsections": [
          "WelcomePreview00:46",
          "ResultsPreview01:30",
          "Intro to Ron Betta02:19",
          "Intro to the Course / SetupPreview01:20",
          "Important Notice - Read This Before BeginningPreview00:11",
          "Protect the End UserPreview01:56",
          "Get Your Certificate00:26",
          "Updates to the Course01:11",
          "SECTION 1 - Introduction to Innovative FitnessPreview12:12",
          "1.1 The Synergy of AI and Fitness00:04",
          "Lecture 1 - Evolution of AI in the Fitness Landscape12:40",
          "Lecture 2 - Navigating the Role of AI in Personalized Fitness12:13",
          "1.2 - Exploring ChatGPT Capabilities00:03",
          "Lecture 1 - Understanding ChatGPTs Functions in Fitness Planning13:29",
          "ChatGPT and Fitness Technology01:32",
          "ChatGPT and Form01:19",
          "ChatGPT and Trainers02:11",
          "Intro to ChatGPT03:09",
          "Course Prompts: 1-303:46",
          "Course Prompts: 4-607:00",
          "Course Prompts: 7-912:16",
          "Course Prompts: 10-1212:35",
          "Course Prompts: 13-1408:38",
          "Lecture 2 - Ethical Use and Limitations of AI in Fitness06:43"
        ]
      },
      {
        "title": "Section 2 - Fundamentals of Injury Prevention",
        "subsections": [
          "2.1 Principles of Safe Exercise Design02:03",
          "Lecture 1 - Key Concepts in Injury Prevention12:27",
          "Key Concepts - Effects on the Human Body09:41",
          "Key Concepts - Movement Analysis08:50",
          "Key Concepts - Biomechanics Principles04:11",
          "Key Concepts - Applications03:53",
          "Shorty Story - Mountain Climbers05:02",
          "2.2 Anatomy and Biomechanics03:26",
          "Lecture 2 -  Risk Assessment and Management in Exercise21:29",
          "Lecture 1 - Understanding Movement Mechanics13:43",
          "Lecture 2 - Common Musculoskeletal Imbalances and Corrections10:41"
        ]
      },
      {
        "title": "Section 3 - AI-Assisted Fitness Program Design",
        "subsections": [
          "3.1 - Customizing Injury Prevention Strategies01:37",
          "Lecture 1 - Communicating Effectively With ChatGPT11:36",
          "Lecture 2 - Personalized Workout Plans:  AI-Generated and Refined07:31",
          "3.2 - Structuring Balanced Workout Routines00:03",
          "Lecture 1 - Incorporating Variety and Balance in Workouts08:00",
          "Lecture 2 - Adapting Workouts for Different Fitness Levels and Injury Histories05:19"
        ]
      },
      {
        "title": "Section 4 - Advanced Injury Prevention and Wellness",
        "subsections": [
          "4.1: Periodic Review and Adjustments00:03",
          "Lecture 1 - Ongoing Evaluation with AI Assistance12:48",
          "Lecture 2 - Fine-Tuning the Fitness Plan Based on ChatGPT’s Analysis07:43",
          "4.2: Cognitive Health / Emotional Well-being00:03",
          "Lecture 1 - Impact of Exercise on Cognitive Health07:54",
          "Lecture 2 - Psychology of Injury: Strategies for Emotional Resilience09:21"
        ]
      },
      {
        "title": "Section 5 - Nutrition & Supplements for Wellness",
        "subsections": [
          "5.1: Macronutrients and Their Roles00:02",
          "Lecture 1 - The Importance of Proteins and Carbohydrates18:20",
          "Lecture 2 - Fats and Hydration in Fitness16:41",
          "5.2: Understanding Dietary Supplements00:03",
          "Lecture 1 -  Types and Benefits of Supplements10:20",
          "Lecture 2 - Risks and Safe Practices in Supplement Use05:30"
        ]
      },
      {
        "title": "Section 6 - Communication and Professional Collaboration",
        "subsections": [
          "6.1: Consulting Healthcare Professionals00:02",
          "Lecture 1 - Recognizing Signs That Require Medical Attention13:06",
          "Lecture 2 - Effective Communication with Healthcare Providers05:17",
          "6.2: Collaborative Approaches in Fitness00:02",
          "Lecture 1 - Interdisciplinary Collaboration for Holistic Wellness11:56",
          "Lecture 2 - Integrating Fitness with Rehabilitation and Therapy04:51"
        ]
      },
      {
        "title": "Conclusion",
        "subsections": [
          "Thank you!01:01"
        ]
      },
      {
        "title": "New Sections - Typical Injuries and How to Prevent Them",
        "subsections": [
          "Update - November 202400:45"
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/5622506_8bd9_2.jpg"
  },
  {
    "title": "Florida LLC Launch, Start a Business With Sunbiz",
    "price": "Current priceE£599.99",
    "description": "Hey there, aspiring entrepreneur! Ever dreamt of starting your own business in Florida without getting tangled in the dense forest of legalities? This dynamic course is your trusty machete to carve out a clear path through the underbrush. From selecting a distinctive business name to understanding the ins and outs of LLC operating agreements, we've got your back every step of the way. We'll dive into crucial details like obtaining an EIN, setting up your business bank account, and the scoop on state-specific compliance requirements. Plus, we'll touch on why having a registered agent is like having the ultimate sidekick for your LLC.By the end of the journey, you won't just have a roadmap, but a business that's ready to roll. This course isn't just a series of lectures; it's a hands-on, interactive workshop where you'll apply what you learn in real-time, setting up your dream enterprise with confidence and smarts. Envision sidestepping common pitfalls and navigating regulatory hoops like a pro. Whether you're selling services, flipping properties, or launching the next big tech startup, you'll leave with a fortified structure, ready to tackle the sunny business landscape of Florida. So, gear up and get ready to transform your vision into a thriving, legally-sound reality!When pulling this course together, I focused on demystifying the entire process of starting a business in the sunny state of Florida for you. I want you to kick things off on the right foot, with confidence and ease. That's why the modules are jam-packed with actionable information, guiding you step-by-step from choosing a business name all the way to opening your bank account. The resources included are meticulously organized, so you can find what you need when you need it, without any hassle. Trust me, this course is your trusty compass in the sometimes overwhelming world of entrepreneurship, making the legal tidbits and paperwork a breeze. It's like having a business-savvy pal by your side, ready to help you make your entrepreneurial dreams a reality.",
    "instructor": "Mark Sias",
    "requirements": [
      "Internet Access Is All You Need. We Explain The Entie LLC, EIN, & DBA Process Step by Step"
    ],
    "whatYouWillLearn": [
      "Form An LLC In Florida",
      "Navigate Sunbiz Like A Pro",
      "Complete Articles of Organization Correctly",
      "Obtain your EIN number fast",
      "Get your DUNS number",
      "Create your Operating Agreement",
      "Build Business Credit"
    ],
    "content": [
      {
        "title": "Introduction To LLC Formation",
        "subsections": [
          "IntroductionPreview01:41"
        ]
      },
      {
        "title": "Navigating Sunbiz Website",
        "subsections": [
          "Researching Names on SunBizPreview03:09",
          "Registering Your LLC Name & Articles of OrganizationPreview13:51",
          "Articles of Incorporation, Operating Agreements & Service Agreements05:11"
        ]
      },
      {
        "title": "Obtaining An EIN From The IRS",
        "subsections": [
          "Applying for an EIN Online07:15",
          "Non-Resident EINs, IRS SS-4 Form02:33"
        ]
      },
      {
        "title": "Fictitious Name Registration",
        "subsections": [
          "What is a Fictitious Name & Registering Your LLC With One03:44",
          "Registering DBA (Fictitious Name)01:59"
        ]
      },
      {
        "title": "Annual Report Filing",
        "subsections": [
          "Filing, Deadlines & Penalties02:48",
          "Changes To Your LLC02:27",
          "Obtaining and Renewing Local Business Tax Stamps01:48"
        ]
      },
      {
        "title": "Rapidly Building Business Credit",
        "subsections": [
          "DUNs Numbers00:45",
          "Establishing Business Credit Accounts02:33",
          "Tradelines: The Business Credit Cheat Code03:10"
        ]
      },
      {
        "title": "Taking Your LLC to the Next Level",
        "subsections": [
          "Small Business Success System03:28"
        ]
      }
    ],
    "image": "https://img-c.udemycdn.com/course/240x135/6290953_aa1c_2.jpg"
  },
  {
    "title": "How To Find Your Profitable Course Topic",
    "price": "Price not found",
    "description": "Are you grappling with the challenge of pinpointing the ideal niche for your course business?That familiar sense of restlessness stemming from an ever-expanding to-do list has taken root. Initially, you felt confident in your grasp of a specific course niche, only to realise that it merely scratched the surface of a broader topic.The multitude of market research strategies available can be downright bewildering. The frustration of feeling stuck, stressed, and directionless in your quest to identify your niche has become an all-too-familiar roadblock.Amidst it all, you find yourself wondering: \"How do other creators seamlessly identify and hit the mark with their lucrative course niches?\"But take heart, for this process doesn't have to be an uphill struggle. Allow me to be your guide in a FREE masterclass that will walk you through the steps to niche success. Together, we will delve into the three indispensable and non-negotiable elements of a successful course niche: understanding the who, what, why, and how of effective course niche creation. Furthermore, I will reveal the five foundational pillars of my proven Niche for Success methodology.As a bonus, you'll gain access to a comprehensive workbook designed to aid your journey. It's not only for note-taking but also for pre-course assignments and logging your valuable insights.Benefits of This Masterclass:Gain clarity and confidence in identifying a lucrative niche for your course business.Acquire a deep understanding of the key elements that constitute a successful course niche.Access a proven methodology, bolstered by five pillars, to refine your course niche and enhance your chances of success.Elevate your course creation strategy and align with the ever-evolving trends on platforms like Udemy by mastering the art of course niche refinement through this transformative masterclass.",
    "instructor": "Bridie Appleby-Gunnill",
    "requirements": [
      "Beginner friendly",
      "No business knowledge necessary"
    ],
    "whatYouWillLearn": [
      "What a 'niche' is",
      "What a profitable niche is",
      "3 key elements to course niche success",
      "5 pillars of profitable course niche discovery",
      "Profitable course niche elements"
    ],
    "content": [],
    "image": "https://img-c.udemycdn.com/course/240x135/5496408_b7a8_10.jpg"
  }
]